{"pdf_text_combined": "   NASA-STD-4005A W/CHANGE  1: REVALIDATED WITH  ADMINISTRATIVE/  EDITORIAL CHANGES  2021-11-17  Approved: 2016-02-01  Superseding NASA-STD-4005  (Baseline)                                   Interim Release  Baseline Release. Interim Standard NASA-  STD-(I)-4005 was transitioned to this  standard and the handbook, NASA-HDBK-  4006.  .1.3: Changed from: “Spacecraft systems  susceptible to arcing or large parasitic  current drains shall be tested in a simulated  LEO . . .” to “Spacecraft systems  susceptible to arcing or large parasitic  current drains shall be tested to ensure their  function and performance in a simulated  LEO . . .”  .1.4, 2nd sentence: Change from  “Spacecraft that operate a significant  amount of time in LEO must use . . .” to  “Spacecraft that operate a significant  amount of time in LEO shall use . . .”  .1: Added information for two reference  documents.  ade editorial and formatting changes.  The original intent of “musts” and “wills”  used in section 4 was to reflect  requirements; changed to “shall” statements  to conform to Agency policy for indicating  requirements. Section 4.1.6 has been  combined with section 4.1.2; section 4.1.6  provided direction on how to minimize  parasitic currents, where section 4.1.2 was  stating the requirement. Added or modified  template boilerplate text. Moved applicable  document AFWAL-TR-88-4143, Volume 2,  to Appendix B, References; and deleted  Interim  Baseline  2006-09-11  2007-06-03       Status Document  Revision  Change  Number                            Document  Revision  A  Change  Number         Continued  section 5, moving all references to  Appendix B. Numbered requirements and  added Requirements Compliance Matrix in  Appendix A. Corrected formatting errors.  Revalidated—This NASA Technical  Standard was reviewed and only  editorial/administrative changes to  conform to the current template resulted.                        his NASA Technical Standard is approved for use by NASA Headquarters and NASA Centers  and Facilities, and applicable technical requirements may be cited in contract, program, and other  Agency documents. It may also apply to the Jet Propulsion Laboratory (a Federally Funded  Research and Development Center [FFRDC]), other contractors, recipients of grants and  cooperative agreements, and parties to other agreements only to the extent specified or  referenced in applicable contracts, grants, or agreements.  his NASA Technical Standard provides a design standard for high-voltage spacecraft power  systems (> 55 volts) that must operate in the plasma environment associated with low Earth orbit  (LEO) at latitudes less than 50 degrees latitude.  Requests for changes to this NASA Technical Standard should be submitted via Marshall Space  Flight Center (MSFC) Form 4657, Change Request for a NASA Engineering Standard.   This NASA Technical Standard is published by the National Aeronautics and Space  Administration (NASA) to provide uniform engineering and technical requirements for  processes, procedures, practices, and methods endorsed as standard for NASA programs and  projects, including requirements for selection, application, and design criteria of an item.   Original Signed By  _______________________________  Ralph R. Roe, Jr.  NASA Chief Engineer    February 1, 2016  _____________________________   Approval Date                        DOCUMENT HISTORY LOG .........................................................................................  FOREWORD .....................................................................................................................  TABLE OF CONTENTS ..................................................................................................  LIST OF APPENDICES ...................................................................................................   2   4   5   6  1.  1.1  1.2  1.3  2.  2.1  2.2  2.3  2.4  3.  3.1  3.2  SCOPE ................................................................................................................  Purpose .................................................................................................................  Applicability.........................................................................................................  Tailoring ...............................................................................................................  APPLICABLE DOCUMENTS .........................................................................  General .................................................................................................................  Government Documents ......................................................................................  Non-Government Documents ..............................................................................  Order of Precedence .............................................................................................   7   7   8   8   9   9   9   9   9  ACRONYMS AND DEFINITIONS .................................................................  Acronyms and Abbreviations...............................................................................  Definitions ............................................................................................................   10   10   10  4.  4.1  4.1.1  4.1.2  4.1.3  4.1.4  4.1.5  4.1.6  4.1.7  REQUIREMENTS .............................................................................................  General LEO Standard Requirements ..................................................................  Arcs on Spacecraft in LEO ..................................................................................  Large Parasitic Current Drains ............................................................................  Simulated LEO Plasma Environment Test ..........................................................  LEO versus GEO Charging .................................................................................  Arc Prevention .....................................................................................................  Steps to Limit the Impact of Arcs to Sensitive Spacecraft Systems ....................  Testing ..................................................................................................................   15   15   15   15   16   16   16   20   21                                              A  B  Requirements Compliance Matrix .......................................................................  References ............................................................................................................   22   27                   LOW EARTH ORBIT SPACECRAFT CHARGING  DESIGN STANDARD  This NASA Technical Standard provides requirements relative to various plasma interactions  that can result when a high-voltage system is operated in the Earth’s ionosphere and standard  practices to eliminate or mitigate such reactions.    The purpose of this NASA Technical Standard is to provide a design standard for spacecraft  electrical power systems using voltages greater than 55 volts that operate in the low Earth orbit  (LEO) plasma environment encountered in altitudes up to 2000 kilometers (km) and latitudes  between -50 and +50 degrees. Such power systems, particularly solar arrays, are the proximate  cause of spacecraft charging in LEO; and these systems can interact with this environment in a  number of ways that are potentially destructive to themselves as well as to the platform or  vehicle that has deployed them.  High-voltage systems are used in space for two primary reasons. The first reason is to save  launch weight. For the same power level, higher voltages enable use of smaller diameter wires  (lighter cabling). This is true because P = IV, and V = IR, so P = I2R (where P is power, I is  current, R is resistance, and V is voltage). If I is decreased by use of higher V, then smaller  wires can be used with no increase in power loss due to cabling. Of course, if one uses the same  cable mass, higher voltages will enable higher efficiencies, since less power will be lost to  resistance in the cables. For very large power systems, the decrease in cable mass can be  substantial.  The second reason to use a high voltage power system is that some spacecraft functions require  them. For example, electric propulsion uses voltages from about 300 V (Hall thrusters) to about  1000 V (ion thrusters). A low-voltage power system would require conversion of substantial  power to high voltages for these spacecraft functions to operate. The weight of the power  conversion systems, power management and distribution (PMAD), can be a substantial fraction  of the total power system weight in these cases. It is more efficient, and can save weight, if the  high-voltage functions can be directly powered from a high-voltage solar array. If the high-  voltage function is electric propulsion, such a system is called a direct-drive electric propulsion  system.  Because of these and other reasons, spacecraft designers and manufacturers are increasingly  employing high voltage power systems, but with the advantages comes a higher risk of  spacecraft charging. The presence of high voltage solar arrays and exposed electrical  conductors that carry high voltages can directly exacerbate the spacecraft charging process in  LEO, potentially resulting in undesirable electrical arcing, power drain and disruptions, and  contamination of spacecraft surfaces and coatings all of which contribute to the damage and                      loss of spacecraft coatings. Thus, system designers need a standard to show them how to  mitigate the spacecraft charging effects of using high voltages in LEO. In addition to system  designers, this document is useful to space mission personnel including project managers, solar  array designers, and system engineers.      his NASA Technical Standard is applicable to spacecraft electrical power systems using  voltages greater than 55 volts that operate in the LEO plasma environment encountered in  altitudes up to 2000 kilometers (km) and latitudes between -50 and +50 degrees. Specifically  excluded are spacecraft that encounter GEO charging conditions that do not (often) encounter  energetic electrons within the auroral ovals, and that do not fly through the Van Allen belts. For  the extreme radiation protection that is necessary for orbits in the Van Allen belts, exterior  spacecraft charging and internal charging will be a concern. However, it is not in the  purview of this document to deal with those two topics. For direction on designing spacecraft to  survive the conditions in GEO and in the Van Allen belts, one should reference NASA-HDBK-  4002A, Mitigating In-Space Charging Effects-A Guideline.  spacecraft. For example, in GEO one would use materials on the external surface of the  spacecraft with low electrical resistance that are all bonded together. This prevents external  charging and the potential for electrostatic discharge. In LEO, if you make external materials  conductive, then more current is collected from the plasma increasing the parasitic currents in the  system and changing the system floating potential. If the spacecraft will fly in both LEO and  GEO conditions, be careful to use design solutions that are applicable in both environmental  regimes (see NASA-HDBK-4002A).    Facilities and may be cited in contract, program, and other Agency documents as a technical  requirement. It may also apply to the Jet Propulsion Laboratory and other contractors only to the  extent specified or referenced in applicable contracts.   Requirement), numbered, and indicated by the word “shall. This NASA Technical Standard contains  14 requirements. Explanatory or guidance text is indicated in italics beginning in section 4. To  facilitate requirements selection by NASA programs and projects, a Requirements Compliance  Matrix is provided in Appendix A.    ailoring of the requirements in this NASA Technical Standard for application to a specific program  or project is acceptable when documented in program or project requirements and formally approved          by the delegated Technical Authority in accordance with NPR 7120.5, NASA Space Flight Program  and Project Management Requirements.  .1.1 The documents listed in this section contain provisions that constitute requirements of this  NASA Technical Standard as cited in the text.  .1.3 Non-use of specifically designated versions will be approved by the delegated Technical  Authority.   2.1.4 Applicable documents may be accessed at https://standards.nasa.gov obtained directly  from the Standards Developing Body or other document distributors, or information for  obtaining the document is provided.      NASA Space Flight Program and Project Management  Requirements       .4.1 The requirements and standard practices established in this NASA Technical Standard do  not supersede or waive existing requirements and standard practices found in other Agency  documentation.  .4.2 Conflicts between this NASA Technical Standard and other requirements documents will  be resolved by the delegated Technical Authority.                          AFWAL  cm  dc  DWV  EMI  ESD  FFRDC  GEO  HDBK  km  LEO  MSFC  NASA  NPR  PMAD  RC  SCR  SI  STD  V  Air Force Wright Aeronautical Laboratories  centimeter(s)  direct current  dielectric withstand voltage  electromagnetic interference  electrostatic discharge  Federally Funded Research and Development Center  geosynchronous Earth orbit  Handbook  kilometer(s)  low Earth orbit  Marshall Space Flight Center  National Aeronautics and Space Administration  NASA Procedural Requirements  power management and distribution  resistor-capacitor  spacecraft charging requirement  Système Internationale or metric system of measurement  standard  volt(s)            flow electrical charge through the material. The SI units are Ohm-cm. A designer must be  careful not to use values of bulk resistivity for materials where water absorption in the material  is the major charge carrier.   storage of electrical charge in dielectric materials when potential differences exist between the  conductors. The value is expressed as the absolute ratio of the stored electrical charge to the  potential differences between the conductors.                         Charge: The fundamental conserved property of certain subatomic particles that  determines their interaction with electromagnetic fields. Electric charge is quantized in integer  multiples of individual small units called the elementary charge, e, approximately equal to  1.602×10−19 coulombs.  Conductivity: A constitutive parameter (σ) of a material that represents the measure of  the material to conduct electrical current in the direction of an externally applied electric field.  Conductivity is the reciprocal of bulk resistivity.  Conductor: An electrical path that offers comparatively little resistance. A wire or  combination of wires not insulated from each other, suitable for carrying a single electric  current.   gas surrounding a conductor around which exists a voltage gradient exceeding a certain critical  value for a gaseous medium.       electrical breakdown level, such that electrical current does not flow under operational  conditions. The term is generally interchangeable with the term insulator.  Dielectric Breakdown: A sudden increase in electric current flow within a dielectric  caused by an applied electric field exhibiting a magnitude in excess of the dielectric strength of  the material.   withstand without breakdown, usually expressed in volts per mm of thickness. May also be  referred to as dielectric withstand voltage (DWV).   leaves an electrolytic cell, arc, furnace, vacuum tube, gaseous discharge tube, or any  conductor of the nonmetallic class.                              Gradient: A vector derivative of a scalar field producing a vector field with the  magnitude of the maximum rate of change of the scalar field, pointing in the direction of the  maximum change of the scalar field.       electrical breakdown level, such that electrical current does not flow under operational  conditions. The term is generally interchangeable with the term dielectric.   giving it a net positive or negative electrical charge. An ion may be formed when a molecule  of gas is stressed electrically beyond its critical voltage.   discharge or electric arc between two conductors in a gas as a function of pressure and gap  length.   capacity of the material to store kinetic energy and to align with and magnetize along an  externally applied magnetic field.   capacity of the material to store potential energy and to align with and polarize along an  externally applied electric field.   which some or all of its constituent atoms are split up into electrons and ions, able to move  independently of each other. Plasma may be strongly influenced by electrostatic and  electromagnetic fields and forces, leading to very complex and interesting behavior.                  excluding the rubbers, that are capable of flowing under heat and pressure at one time or  another.             faces of a 1-centimeter (cm) cube of an insulating material, commonly expressed in ohm-  centimeters. Sometimes called volume resistivity.                                insulator come together. At such a point, the electric field is often at a maximum, and plasma-  arcing is more likely.   provides the motive force in response to which electrical current will flow when a conductor is  located between the two points.                                 potential (which shall be determined by testing; see NASA-HDBK-4006, Appendix  C, section C.1.1.4.3). This control can be achieved by one or more of the  following:  SCR 3] Large parasitic current drains to the LEO plasma can lead to power losses and shall be  minimized.       i. When applying the encapsulation, care should be taken to eliminate  trapped air which could possibly crease at Paschen discharge.    .1.1.1  disastrous consequences (see NASA-HDBK-4006, Appendix C, section C.1.2.3).                               SCR 4] Spacecraft systems susceptible to arcing or large parasitic current drains shall be tested  to ensure their function and performance in a simulated LEO plasma environment under  simulated (worst-case) operational conditions before flight.   SCR 5] Spacecraft that operate a significant amount of time in LEO shall use arc prevention and  mitigation techniques appropriate for the LEO environment. The techniques used to prevent and  mitigate arcing in LEO are not the same as those used to mitigate GEO arcing. For design  guidelines to prevent spacecraft charging in GEO, use NASA-HDBK-4002A.    a. [SCR 6] Solar array or power system trigger arcs shall be prevented using one or  more of the following methods (see NASA-HDBK-4006, Appendix D, section  D.2.4.2):  (1) Limit the potential of possible arc-sites to a voltage lower than the trigger arc  threshold (which shall be determined by testing). This task can be achieved by  one or more of the following:  interconnects (see NASA-HDBK-4006, Appendix C, section C.1.1.1) or closely  spaced coverslides (see NASA-HDBK-4006, Appendix C, section C.1.1.4.1).     4006, Appendix D, section D.2.3, but be careful of creating Paschen discharge  conditions).                                    avoid creating Paschen discharge conditions. Elimination can be achieved by one  or more of the following:        dimensions than the minimum Debye length expected in the LEO environment  (see NASA-HDBK-4006, Appendix D, section D.2.3.1).  2) Limit the differential potentials of adjacent solar array strings, cells, or power  traces to below the sustained arcing threshold (which shall be determined by  testing). This task can be achieved by using power system string voltages lower    b. [SCR 8] Sustained solar array arcs shall be prevented with one or more of the  following (but see also NASA-HDBK-4006, Appendix D, section D.2.4.2):                                   than the sustained arcing voltage threshold and/or using string layouts that  prevent adjacent cells or strings from having large differential voltages.         [SCR 9] The arcing thresholds for geometries intended to mitigate  sustained arcing shall be determined by testing.  (4) Prevent trigger arc plasmas from initiating Paschen discharge at the differential  voltage between strings or cells. The Paschen minimum for most materials that  can be evolved during a trigger arc can only be determined by testing. Without  an extensive test program to determine these thresholds, this technique can only  be implemented by using solar array materials that do not decompose under the  high heat of an arc. This excludes the use of Kapton®, certain adhesives, and  non-refractory metals in solar array construction.   (which shall be determined by testing). This goal can be achieved by one of the  following:         (6) Prevent arcs from extending in duration to milliseconds or more. This task can be  achieved by sensing arc occurrence and quickly (< 200 microsecond) open-  circuiting strings where arcs occur (see NASA-HDBK-4006, Appendix D, section  D.2.4).  c. [SCR 10] Dielectric breakdown of structure surface coatings shall be prevented  with one or more of the following methods (but see also NASA-HDBK-4006,  Appendix D, section D.2.4.2):                                   dielectric strength of the coating. This limitation can be achieved by one of the  following:     interconnects (see NASA-HDBK-4006, Appendix C, section C.1.1.1) or closely  spaced coverslides (see NASA-HDBK-4006, Appendix C, section C.1.1.4.1).   4006, Appendix D, section D.2.3, but be careful of creating Paschen discharge  conditions).       surface potential is close to the underlying conductor potential (but be careful  that the capacitance across the coating does not become great enough to  exacerbate arc damage when arcs occur).   original dielectric breakdown (see above), or by preventing the spacecraft’s  electron current collection from reaching the sustained arc threshold (which  shall be determined by testing) for the dielectric material. This task can be  achieved by one of the following methods:   be determined by testing, see NASA-HDBK-4006, Appendix C, section  C.1.1.4.3).      C. Encapsulating all exposed electron collecting conductors, or by other  techniques for limiting electron current collection (see below).                               (1) Keep potentials of exposed conductors below the Paschen minimum for all  ambient and emitted gases (see NASA-HDBK-4006, Appendix D, section  D.1). This can be achieved by one or all of the following methods:  . Encapsulating exposed electron-collecting conductors (be careful not  to create Paschen discharge conditions below the encapsulation).    (2) Prevent the neutral pressure from entering the Paschen regime for the  spacecraft plasma sheath dimensions. This task can be achieved by the  following methods:                                                                (2) Prevent arc currents from traversing the human body or other circuits sensitive to  power surges. This task can be achieved by using sneak-circuit analysis to make  sure astronauts or sensitive circuits are not in the direct path of current flow  during an arc.   can be achieved by preventing the arc from becoming a sustained arc (see  above).     limitation can be achieved by preventing dielectric breakdown or solar array  arcing on surfaces that are used for thermal control, optical surfaces, possible  electromagnetic interference (EMI)-radiating surfaces, electronics enclosures,  and the like. See above for techniques to prevent dielectric breakdown and/or  solar array arcing on these surfaces. Arcs on surfaces that are not critical to  spacecraft systems and will not contaminate sensitive surfaces nor radiate into  sensitive electronics do not require arc prevention.      .1.7.1  General LEO Standard Requirements shall always be verified by testing.    .1.7.2  and/or large parasitic plasma currents shall never be attempted solely by analysis. No substitute  exists for testing in a simulated LEO environment under simulated (worst-case) operational  conditions. Test the particular design, have a knowledgeable spacecraft electrostatic discharge  (ESD) engineer review the design at the earliest possible stage in the program, and ensure  continuing support is provided through launch. (See NASA-HDBK-4006, Appendix F, for  appropriate test conditions.)                 ue to the complexity and uniqueness of space flight, it is unlikely that all of the requirements in a NASA technical standard will  apply. The Requirements Compliance Matrix below contains this NASA Technical Standard’s technical authority requirements and  may be used by programs and projects to indicate requirements that are applicable or not applicable. Follow the process for tailoring in  section 1.3 in this NASA Technical Standard. Enter “Yes” in the “Applicable” column if the requirement is applicable to the program  or project or “No” if the requirement is not applicable to the program or project. The “Comments” column may be used to provide  specific instructions on how to apply the requirement or to specify proposed tailoring.        Arcs on Spacecraft in  LEO  Arcs on Spacecraft in  LEO  [SCR 1] Arcs on spacecraft in LEO shall be prevented because of  their potentially disastrous consequences (see NASA-HDBK-4006,  Appendix C, section C.1.2.3).  [SCR 2] The four types of arcs which shall be prevented are as  follows:  Applicable  (Enter Yes  or No)                                   Applicable  (Enter Yes  or No)    c. Dielectric breakdown of structure surface coatings (can also  become sustained, see NASA-HDBK-4006, Appendix C, section  C.1.2.3.1).   section B.2, and Appendix D, section D.2.3).  [SCR 3] Large parasitic current drains to the LEO plasma can lead to  power losses and shall be minimized.  [SCR 4] Spacecraft systems susceptible to arcing or large parasitic  current drains shall be tested to ensure their function and  performance in a simulated LEO plasma environment under  simulated (worst-case) operational conditions before flight.  [SCR 5] Spacecraft that operate a significant amount of time in LEO  shall use arc prevention and mitigation techniques appropriate for  the LEO environment.   a. [SCR 6] Solar array or power system trigger arcs shall be  prevented using one or more of the following methods (see NASA-  HDBK-4006, Appendix D, section D.2.4.2):   than the trigger arc threshold (which shall be determined by  testing).  (2) Limit the electric fields of potential arc-sites.  (3) Eliminate arc-sites (see NASA-HDBK-4006, Appendix D,  section D.2.3) and avoid creating Paschen discharge  conditions.  i. [SCR 7] Openings in vented electronics enclosures shall  have smaller dimensions than the minimum Debye length     Large Parasitic Current  Drains  Simulated LEO Plasma  Environment Test  LEO versus GEO  Charging                                           Applicable  (Enter Yes  or No)     expected in the LEO environment (see NASA-HDBK-  4006, Appendix D, section D.2.3.1).    b.  one or more of the following (but see also NASA-HDBK-4006,  Appendix D, section D.2.4.2):     strings, cells, or power traces to below the sustained arcing  threshold (which shall be determined by testing).   strings.  i. [SCR 9] The arcing thresholds for geometries  intended to mitigate sustained arcing shall be  determined by testing.     discharge at the differential voltage between strings or  cells.                                                 c. [SCR 10] Dielectric breakdown of structure surface  coatings shall be prevented with one or more of the following  methods (but see also NASA-HDBK-4006, Appendix D, section  D.2.4.2):    Applicable  (Enter Yes  or No)    breakdown voltage set by the dielectric strength of the  coating.  (2) Prevent sustained dielectric breakdowns (sizzle arcs) by  preventing the original dielectric breakdown (see above),  or by preventing the spacecraft’s electron current  collection from reaching the sustained arc threshold  (which shall be determined by testing) for the dielectric  material.      d.  more of the following:   Steps to Limit the  Impact of Arcs to  Sensitive Spacecraft  Systems   Paschen minimum for all ambient and emitted gases  (see NASA-HDBK-4006, Appendix D, section D.1).  (2) Prevent the neutral pressure from entering the Paschen  regime for the spacecraft plasma sheath dimensions.    (1) Limit the energy that is dissipated in a trigger arc.  (2) Prevent arc currents from traversing the human body or                                      Applicable  (Enter Yes  or No)     (4) Prevent a trigger arc from becoming a Paschen discharge.  (5) Limit arc-sites to material surfaces that are not sensitive to   (6) Detect the occurrence of arcs and rapidly cut off current to  the site when an arc occurs (see NASA-HDBK-4006,  Appendix D, section D.2.4).  [SCR 13] Compliance with the LEO spacecraft charging standards  in section 4.1, General LEO Standard Requirements shall always  be verified by testing.  [SCR 14] Verification of LEO space systems’ performance in  preventing arcing and/or large parasitic plasma currents shall never  be attempted solely by analysis.                              2003. It contains an extensive annotated bibliography that is not repeated here. A good (and  current) reference for test procedures is Ferguson, et al., 2005. For other guidance information,  see NASA-HDBK-4006.                            "}