{"pdf_text_combined": "   NASA-SPEC-5022  w/CHANGE 2:  REVALIDATED  w/ADMINISTRATIVE/  EDITORIAL CHANGES  2021-07-16  Approved: 2015-06-24  Superseding NASA-SPEC-  5022 w/Change 1  NASA MANUFACTURING AND TEST REQUIREMENTS FOR  NORMALLY CLOSED PYROVALVES FOR HAZARDOUS FLIGHT  SYSTEMS APPLICATIONS                             Document  Revision  Change  Number     2015-06-24  2016-05-20   Baseline  Change     Initial Release  Revalidated w/Administrative/Editorial  Changes—This NASA Technical  Specification was reviewed and no technical  changes resulted. Administrative changes to  number requirements, add a Requirements  Compliance Matrix as an appendix, and  conform to the current template were made,  along with editorial corrections.  Revalidated w/Administrative/Editorial  Changes—This NASA Technical  Specification was reviewed and no technical  changes resulted. Administrative changes  were made to conform to the current  template.                      This NASA Technical Specification is published by the National Aeronautics and Space  Administration (NASA) to describe essential technical requirements for purchased or in-house  items, services, functions, or processes for NASA programs and projects and includes procedures  necessary to determine that the requirements covered by the NASA Technical Specification have  been met. These requirements are mandatory when specified as such by program documentation  or contracts.  his NASA Technical Specification is approved for use by NASA Headquarters and NASA  Centers and Facilities, and applicable technical requirements may be cited in contract, program,  and other Agency documents. It may also apply to the Jet Propulsion Laboratory (a Federally  Funded Research and Development Center [FFRDC]), other contractors, recipients of grants and  cooperative agreements, and parties to other agreements only to the extent specified or  referenced in applicable contracts, grants, or agreements.   metal barrier normally closed (NC) valves used in ELV payload hazardous spacecraft  applications. Pyrovalves meeting these requirements will provide programs, NASA Payload  Safety, and United States Air Force (USAF) Range Safety consistent and reliable hardware.   for changes to this NASA Technical Specification should be submitted via MSFC Form 4657,  Change Request for a NASA Engineering Standard.   Original Signed By: 06-24-2015  Ralph, R. Roe  NASA Chief Engineer                     2   3   4   5   5   6   6   7   7   7   8   8   9   10   10  DOCUMENT HISTORY LOG ...............................................................................  FOREWORD ............................................................................................................  TABLE OF CONTENTS .........................................................................................  LIST OF APPENDICES .........................................................................................  LIST OF FIGURES .................................................................................................     1.  1.1  1.2  1.3  1.4  2.  2.1  2.2  2.3  2.4  3.  3.1  3.2  4  4.1  4.2  4.3  4.3.1  4.3.2  4.4  4.4.1  4.4.2  4.5  4.6  4.7  SCOPE .......................................................................................................  Purpose ........................................................................................................  Applicability ................................................................................................  Tailoring ......................................................................................................  Background .................................................................................................  APPLICABLE DOCUMENTS ................................................................  General ........................................................................................................  Government Documents..............................................................................  Non-Government Documents .....................................................................  Order of Precedence ....................................................................................  ACRONYMS AND DEFINITIONS ........................................................  Acronyms and Abbreviations ......................................................................  Definitions ...................................................................................................   10   10   11  REQUIREMENTS ....................................................................................  Pyrovalve Analysis and Evaluation Process ...............................................  Systems-Level Considerations ....................................................................  Pneumatic Pressure Tests ............................................................................  Proof Pressure and Leak Tests ....................................................................  Burst Pressure Test ......................................................................................  General Requirements .................................................................................  Internal Structural Requirements ................................................................  Parent Metal Shear-Sections and Valve Housing .......................................  Dual Independent Shear-Section Parent Metal Barrier Valve ....................  Manufacturing Requirements ......................................................................  Hardware Records and Test Hardware .......................................................   12   12   13   15   15   16   16   16   17   19   20   22                                            5.  5.1  5.2   VERIFICATION .......................................................................................  Non-destructive Acceptance Testing ...........................................................  Destructive Acceptance Testing ..................................................................   22   23   23       A  B  C  D  Safety Document Checklist .........................................................................  Parent Metal Shear-Section Analysis Process .............................................  Reference Documents .................................................................................  Requirements Compliance Matrix ..............................................................  24  28  30  32     1  2  3  Basic Pyrovalve Design and Features .......................................................  Dual Independent Parent Metal Shear-Section Valve ...............................  Dual One-Piece Parent Metal Shear-Section Valve ..................................   8   19   20                                                   NASA MANUFACTURING AND TEST REQUIREMENTS FOR  NORMALLY CLOSED PYROVALVES FOR HAZARDOUS  FLIGHT SYSTEMS APPLICATIONS  his NASA Technical Specification establishes and implements the manufacturing and test  requirements and applications guidelines for normally closed (NC) parent metal shear-section  valves. The NASA Technical Specification is a guide for design engineers to develop more  detailed requirements for specific pyrovalve applications. Adherence to these requirements will  reliably prevent NC parent metal valve leakage or other failure-induced release of hazardous  fluids (liquids or gases) from NASA payloads on Expendable Launch Vehicles (ELVs). This  NASA Technical Specification does not address NC parent metal valve sizing, pressure drop,  and other requirements.  programmatic documentation to ensure valves meet structural requirements and are considered to  be equivalent to other hazardous fluids pressure components such as tubing, tanks, and fittings,  and that any mode of external or internal leakage of the contained hazardous fluid is extremely  improbable (3 × 10-5) in accordance with NASA-STD-8719.24, NASA Expendable Launch  Vehicle Payload Safety Requirements, and AFSPCMAN 91-710, Air Force Space Command  Range Safety User Requirements Manual, or equivalent document for the applicable range.  ppendix A of this NASA Technical Specification presents a checklist of documents to be  prepared for NASA and/or Range Safety. The checklist is provided for manufacturers of NC  pyrovalves used in personnel hazardous applications. It is a tool for documenting the detailed  compliance to the intent of the safety specification. The checklist also provides an aid for  payload safety, Range Safety engineers, and other subject matter experts in reviewing the  documentation. Letter designations after the checklist item number refer to the following  requirement sources:                           For the purposes of this NASA Technical Specification, hazardous valve applications involve  hazardous flight hardware pressure systems as defined by NASA-STD-8719.24 and  AFSPCMAN 91-710, Volume 3, Chapter 12, Section 12.1.     as well as to valves that use a different means of applying force, e.g., memory shape alloys to  break out a section of a parent metal section allowing flow. The parent metal shear sections and  interface tubes are defined by the term “parent metal” when they are machined from a single,  certified bar of high-purity metal alloy with no welds.  This NASA Technical Specification is intended to be applied when these NC parent metal shear-  section valves are used to prevent failure-induced release of hazardous fluids (liquid or gas) from  spacecraft. It is primarily applicable to ELV payloads subject to NASA Payload Safety and  United States Air Force (USAF) Range Safety Requirements, where a consistently high level of  reliability and safety is required.  his NASA Technical Specification is approved for use by NASA Headquarters and NASA  Centers and Facilities, and applicable technical requirements may be cited in contract, program,  and other Agency documents. It may also apply to the Jet Propulsion Laboratory (a Federally  Funded Research and Development Center [FFRDC]), other contractors, recipients of grants and  cooperative agreements, and parties to other agreements only to the extent specified or  referenced in applicable contracts, grants, or agreements.  erifiable requirement statements are designated by the acronym NCPR (Normally Closed  Pryovalves Requirement), numbered, and indicated by the word “shall”; this NASA Technical  Specification contains 80 requirements. Explanatory or guidance text is indicated in italics  beginning in section 4. To facilitate requirements selection and verification by NASA programs  and projects, a Requirements Compliance Matrix is provided in Appendix D.  ocument tailoring of the requirements in this NASA Technical Specification for application to a  specific program or project as part of program or project requirements and obtain formal approval  by the delegated Technical Authority in accordance with NPR 7120.5, NASA Space Flight  Program and Project Management Requirements.  and in most cases less expensive than other types of valves. They also consume less electrical  power. They are single-use devices that are used in propulsion systems to isolate propellants or  pressurant gases. These fluids may be hazardous because of their toxicity, reactivity, temperature,  or high pressure.                  ote that in the simplified block diagram below not all detail features are shown so that those of  major interest are more prominent. The diagram is provided to point out the various features that  are discussed in this NASA Technical Specification. Features of some NC parent metal valve  designs may differ.   In 2013, NESC concluded an extensive study of the reliability and safety of NC parent metal  valves used in payloads carried aboard ELVs. The assessment successfully evaluated technical data  to determine the risk of NC parent metal valve leakage or inadvertent activation in ELV payloads. The  study resulted in numerous recommendations to ensure personnel and hardware/facility safety  during ground processing of ELV payloads. One of those recommendations was to establish a  NASA specification for NC parent metal valves. This NASA Technical Specification is a result of  that recommendation, which is documented in NESC-RP-10-00614.  .1.1 The documents listed in this section contain provisions that constitute requirements of  this NASA Technical Specification as cited in the text unless waived by the responsible  Technical Authority.        Flame  Channel  One piece with no  welds in flow path                 2.1.3 Non-use of a specifically designated version will be approved by the delegated Technical  Authority.  .1.4 Applicable documents may be accessed at https://standards.nasa.gov/, may be obtained  directly from the Standards Developing Body or other document distributors, or information for  obtaining the document is provided.     Air Force Space Command Range Safety User Requirements  Manual, Volumes 1 through 7   Standard General Requirements for Safe Design and Operation of  Pressurized Missile and Space Systems, 28 May 1984    NASA Space Flight Program and Project Management  Requirements         Pyrovalve Reliability Assessment for Expendable Launch Vehicle  Payloads (Accessible at  https://nsckn.nasa.gov/DMS/FolderDocs.aspx?Filter=585&FolderID=32726)   Safety Policy and Requirements For Payloads Using the Space  Transportation System (Accessible at  http://snebulos.mit.edu/projects/reference/NASA-Generic/NSTS_1700-7B.pdf)                                                              Technical Instructions for the Safe Transport of Dangerous Goods  by Air    Technical Instructions for the Safe Transport of Dangerous Goods  by Air  .4.1 The requirements and standard practices established in this NASA Technical  Specification do not supersede or waive existing requirements and standard practices found in  other Agency documentation.  .4.2 Conflicts between this NASA Technical Specification and other requirements documents  will be resolved by the responsible Technical Authority.             ±  AFSPCMAN Air Force Space Command Manual  AIAA  amp  ASTM  ampere(s)  American Institute of Aeronautics and Astronautics  ASTM International (formerly American Society for Testing and  Materials)  Code of Federal Regulations  centimeter(s)  decibel  Department of Defense  Department of Transportation  electroexplosive device  expendable launch vehicle  foot-pound  International Civil Aviation Organization  inch(es)  International Organization for Standardization  CFR  cm  dB  DoD  DOT  EED  ELV  ft·lb  ICAO  in  ISO                       International Space Station  Joule(s)  Materials and Processes Technical Information System  maximum design pressure  maximum expected operating pressure  maximum ground working pressure  military  minute(s)  National Aeronautics and Space Administration  US Naval Ordnance Laboratory  normally closed  normally closed pyrovalves requirement  non-destructive evaluation  NASA Engineering and Safety Center  NASA Standard Initiator  National Space Transportation System  probability of detection  radio frequency  report  standard  second(s)  Système International  special report  specification  standard  United States Air Force  V-shaped Primer Chamber Assembly  Watt(s)  ISS  J  MAPTIS  MDP  MEOP  MGWP  MIL  min  NASA  NAVORD  NC  NCPR  NDE  NESC  NSI  NSTS  POD  RF  RP  S  sec  SI  SP  SPEC  STD  USAF  V-PCA  W    the expenditure of their own energy or because they initiate a chain of events, may cause  serious injury or death to personnel or damage to property.  energy or because they initiate a chain of events, will not cause serious injury or death to  personnel or damage to property.                 section, a crack, or a scratch. Low notch sensitivity is usually associated with ductile materials  and high notch sensitivity with brittle materials.   vessel, pressurized structure, or pressure component is expected to experience during its  service life and still retain its functionality, in association with its applicable operating  environments. This term is synonymous with maximum operating pressure or maximum  design pressure (MDP) and, if required by the program, may include the effect of temperature,  pressure transients and oscillations, vehicle quasi-steady and dynamic accelerations, and relief  valve operating variability.  Payload: The object(s) within a payload fairing carried or delivered by a launch  vehicle to a desired location and trajectory. A generic term that applies to all payloads ,  including but not limited to satellites, other spacecraft, experimental packages, reentry  vehicles, dummy loads, cargo, and any motors attached to them in the payload fairing.  (NASA-STD-8719.24, Annex 2). For this NASA Technical Specification, the term refers to  cargo carried aboard a launch vehicle.  tringer: An elongated configuration of microconstituents of foreign (metallurgically  distinct) material aligned in the direction of working. The term is commonly associated with  elongated oxide or sulfide inclusions in steels.     . [NCPR 1] Tailoring shall be documented and communicated in writing to the  appropriate range safety organization and the NASA Payload Safety Program Manager.     .1.1  [NCPR 3] NC parent metal valves shall be properly designed based on sound engineering  and analysis to provide a level of protection against rupture or leakage at least equivalent to other  parts of the pressure system, i.e., tubing, tanks, and fittings.    4.1.2  pressure system requirements.                  C parent metal valves should undergo a complete development and qualifications program.  This is typically performed according to a specific program or project technical specification.  Analysis should be accomplished before manufacture to help preclude additional redesign and  testing.  .1.3  [NCPR 5] Several valve loadings shall be performed as a minimum: proof and burst test  pressure loadings, media pressure loadings for pre-launch, launch loadings, pyrotechnic loadings,  and pressure loadings after actuation.   on test results because of the challenges of accurately analyzing stresses from these loadings  using mathematical or computer modeling.   .1.4  process control documentation that prove compliance to NASA-STD-5019, Fracture Control  Requirements for Space Flight Hardware, are not available.   .1.6  (extremely improbable) to comply with NASA-STD-8719.24 (Annex) and AFSPCMAN 91-710.   4.1.5  demonstrate a minimum four times the pressurization cycles of the component.   of inadvertent ignition can be fully mitigated. However, this testing and analysis is beyond the  scope of this NASA Technical Specification.       .2.1  or equivalent meeting the same No-Fire current and pin-to-case high-voltage protection  requirements.                 .2.2  pyrovalve is installed in the spacecraft and the flight connectors are attached.   .2.4  safety requirements in NASA-STD-8719.24 (Annex) and AFSPCMAN 91-710 and prevent  unintended actuation.  (initiators), the basic valve requirements can be applied to valves actuated by mechanical,  electrical, hydraulic, and pneumatic or a combination of means. Whatever actuation method is  chosen, the maximum no-fire energy should be known to a reliability of 0.995 at a 95-percent  confidence level so that a factor of safety can be determined from all inadvertent sources of that  energy (checklist item 2D).    .2.3  electromagnetic interference.   .2.5  Fire and All-Fire requirements.  he No-Fire requirement is a minimum of 1 amp and 1 W applied for 5 min at a reliability of  99.9 percent and confidence level of 95 percent. This is determined by either NAVORD 2101,  Statistical Methods Appropriate for Evaluation of Fuzed Explosive-Train Safety and Reliability,  (the Bruceton test) or ISO 14304, Annex B, All-Fire/No-Fire Test and Analysis Method (the  Neyer test) that requires 20 to 50 initiators for each test (checklist item 3BD).  ther sources of electrical energy such as radio frequency (RF) can be compared to the No-Fire  level of the initiator by tests to meet the factor of safety of a minimum of 20 dB, which is 100 to 1  in energy (W) (MIL-STD-1576, Military Standard: Electroexplosive Subsystem Safety  Requirements and Test Methods for Space Systems, paragraph 4.4.1.a) (checklist item 4BD).  Mechanical, hydraulic, pneumatic, or a combination of means should have a similar safety  margin.   .2.7  exposure to all potential environmental conditions while loaded with hazardous gases or liquids  (checklist item 11A).  ystem testing should include the range of environmental conditions appropriate to the  application (checklist item 5D).     .2.6  accordance with the application requirements when mounted on the valve.           pressure applied individually to each line and separately to the valve housing through the  actuation ram chamber while the lines are vented.  ncluded as part of and after every proof pressure test is a helium leak test at a minimum of  1.0xMEOP with a resulting leak rate less than 1x10-6 standard cc/sec.         . [NCPR 17] Each valve lot shall be qualified by meeting burst pressure test  requirements in accordance with section 4.3.1 in this NASA Technical Specification.          compliance with NASA-STD-5019 (see section 4.1 of this NASA Technical Specification),  growth of the maximum credible crack size shall be demonstrated to the fracture control  authority to be non-credible, based on knowledge of quality control and manufacturing  techniques used to make the NC parent metal valve.      metal barriers to the flow before valve actuation, this capability shall be verified by proof testing  at 1.5xMEOP, independently applied to each parent metal shear-section and then externally to                          b. [NCPR 28] All NC parent metal valves shall meet a minimum design burst pressure  of 2.5xMEOP for lines with diameters ≥3.8 cm (≥1.5 in) or 4.0xMEOP for lines with diameters  <3.8 cm (<1.5 in).    2) [NCPR 30] Testing shall be performed before and after actuation and on a sample  of the units that have successfully functioned after destructive acceptance testing  (checklist items 8AD and 33D).  C parent metal used in hazardous systems without additional barriers to leakage may be  required by USAF Range Safety and NASA Payload Safety to have a minimum design burst  pressure requirement of 4.0 times maximum ground working pressure (MGWP). NC parent  metal valves used in hazardous systems without additional barriers to leakage are considered  Category A ordnance devices and have to follow NASA-STD 8719.24 and AFSPCMAN 91-710,  Volume 3, Chapter 13, or equivalent document for applicable range. This requirement should be  identified and documented early in the launch facility coordination process and be documented  in the tailoring agreement. This requirement would not apply to Category B ordnance pyrovalve  applications, which are, by definition, non-hazardous.       the shear-section when welded in the housing, with no evidence of permanent deformation or  leakage during LAT.                       Other shear-section barriers such as a metal-to-metal seal, elastomeric seats, or O-rings do not  provide the same level of confidence and do not meet the intent of this NASA Technical  Specification (checklist item 9A).     upon actuation of the valve. The shear-section normally has flanges larger than the shear-  section outer diameter that are welded to the valve housing to prevent leakage after actuation.  When installed in the system, the parent metal sections are directly welded to the system tubing  (checklist item 9A).     lthough many materials can be considered for the parent metal shear-section, the use of  vacuum furnace remelt 304L stainless steel has a significant legacy for the shear-section  application (checklist item 13D). (The L on 304L indicates extra-low-carbon stainless steel.)  Other metals may require heat treatment after welding, as judged necessary by the responsible  NASA materials specialist (checklist item 15D). The yield and tensile strength callouts may vary  depending on the strength requirements. The standard yield and tensile strength may be used if  they will meet the stress/force analysis requirements.       fatigue properties; low stress corrosion cracking; high elongation; and toughness  at cryogenic, ambient, and high temperatures (checklist item 14D), if applicable.    3) [NCPR 39] The parent metal shear-section and any other parts wetted by the  fluids and/or combustion products shall be constructed of a metal or other  material that is compatible with the fluids and/or combustion products.  The NASA Materials and Processes Technical Information System II (MAPTIS II),  a single-point source for materials properties for NASA and NASA-associated                  contractors and organizations, contains physical, mechanical, and environmental  properties for metallic and non-metallic materials.2 Other relevant resources for  materials properties are NASA-STD-6016, Standard Materials and Processes  Requirements for Spacecraft, AIAA SP-084-1999, Special Report: Fire,  Explosion, Compatibility, and Safety Hazards of Hypergols – Hydrazine; AIAA  SP-085-1999, Special Report: Fire, Explosion, Compatibility, and Safety  Hazards of Hypergols – Monomethylhydrazine; and AIAA SP-086-2001, Special  Report: Fire, Explosion, Compatibility, and Safety Hazards of Nitrogen  Tetroxide (checklist item 16D).  he parent metal shear-section may have stringers. Investigations have shown  that the stringers that may occur in 304L are usually approximately 0.00127 cm  (0.0005 in) in diameter and that the stringer material is not attacked by common  fuels and oxidizers over a period of several years. Even if the stringers are  oriented perpendicular to any thin break section, the chances of a leak from  stringers are remote. However, a commonly used dye-penetrant etchant (a  solution of nitric acid and hydrofluoric acid) has been shown to dissolve stringer  material in 304L stainless steel. The solution attacks the material in the stringer  and can cause leaks in thin sections. This solution should be avoided on any part  of the valves (checklist item 17D). Note that for 304L stainless steel, any  significant stringer is screened out during the required proof and helium leak  testing process.  he use of vacuum remelt raw material significantly reduces the likelihood of  stringers occurring. Materials used in fracture-sensitive regions of the shear-  section valve should be derived from alloy production processes that implement  modern alloy remelting control practices, e.g., electroslag remelting, vacuum arc  remelting, or vacuum induction melting, which serve to enhance alloy  homogeneity, purity, and metallurgical soundness and reduce the potential for  undesirable secondary inclusion phases that can have a detrimental effect on  mechanical properties, fracture toughness, and pitting corrosion.      hazardous fluids after actuation, e.g., rams, plugs, seals, shall also have the same requirements  for materials compatibility with the hazardous fluids and the same welding compatibility  requirements (checklist item 18D).                Before firing, a leak in the upstream-side parent metal seal could allow hazardous fluid at  system pressure to enter the ram area. Similarly, after firing, leakage past the ram might occur.  In either case, hazardous fluid could enter the ram area. Therefore, to ensure at least single-fault  tolerance against external leakage, all internal valve materials that could then become wetted  are to be fully compatible with the hazardous fluid.  pecific mission requirements may drive other requirements that are not covered by this NASA  Technical Specification. For example, some applications require that the valve be in the system  and pressurized for many years with corrosive propellants after it operates, causing stress  corrosion or metal nitrate formation.   section design. This design is generally considered to contain two inhibits to flow and is the  preferred design approach.     Figure 3, Dual One-Piece Parent Metal Shear-Section Valve, is a design generally considered to  contain two independent barriers to flow (upstream and downstream “V” cut ligaments), but  additional NDE and/or analysis may be required to show that the single piece either does not  contain defects that may grow to leakage or that failure is not credible (extremely unlikely)  during ground processing operations. Both designs, when qualified, can be acceptable for use in  ELV payload hazardous flight applications (checklist item 20A).                             arent metal shear-section valves used in single isolation configurations (without additional  inhibits) need additional inspection and rigorous analysis to ensure the high unlikelihood that  critical flaws exist.   4.6.2  controlled storage as part of process control.  .6.3  [NCPR 47] For single isolation valves, a suitable and representative sample shall be  removed from the middle or ends of each bar and submitted to an accredited laboratory for  analysis.   nitric acid and hydrofluoric acid to remove 0.000762 to 0.00127 cm (0.0003 to 0.0005 in) from  the surface.     .6.1  manufacturing lot basis (checklist item 20A).                  .6.4  using the same tooling and machine setup for each lot of shear-sections (checklist item 24D).  hear-sections should be cleaned using the standard documented cleaning process for the  material (checklist item 24D).   .6.5  as specified by a cognizant materials and process authority (checklist item 25D).  . [NCPR 56] If applicable, the “V” notch angle, depth, and tip radius shall be measured  by optical comparator or equivalent and verified to fully meet drawing requirements and indicate  measured tip radius (checklist item 27D).    t is also recommended that the actual radius be documented to within measurement system  accuracy (within ±0.000635 cm (±0.00025 in), traceable to a national standard). This will  facilitate valve analysis, if required.  a. [NCPR 55] Shear-section dimensions that are critical for containment of hazardous  fluids shall be 100 percent inspected and recorded for each shear-section (checklist item 26D).     .6.7  parent metal barrier conforms to the minimum thickness required by the design drawing  (checklist item 28AD).   established by NDE, proof testing, or process control if the valve does not meet or exceed a  demonstrated safety factor of 1.5.                    This NASA Technical Specification requires that the valve meet a demonstrated safety factor of  2.5 to 4.0, as applicable.   ye penetrants are generally used on flat surfaces (not in sharp groves), are not recommended,  and should not be used unless a well-documented probability of detection (POD) study has been  conducted to prove that the POD is greater than 90 percent with 95 percent confidence (termed  90/95 POD). Eddy current scanners with “V”-shaped sensor ends that ride in the groves are  commonly used for other similar applications such as detecting cracks in critical bolt threads,  and could be considered for this application as long as the technique has been fully validated.  Questions regarding validation should be addressed to the NASA NDE Technical Fellow.  .6.9  [NCPR 62] Etchant limitations: an etchant solution of nitric acid and hydrofluoric acid or  other similar solutions that may dissolve stringers shall not be used internally or externally on the  parent metal shear-section.  .6.10 [NCPR 63] Valves shall be serialized and records of assembly production and inspection  steps kept by serial number (checklist item 29D).   a. [NCPR 65] Welding shall be done on a weld lot basis using the same weld schedule  and weld instructions for a specific weld and be done in a way that minimizes or eliminates “V”  notch residual weld stress (checklist item 30D).     .6.12 [NCPR 67] Although the pyrotechnic devices used to power the valve are specified by  the program, they shall be made and tested from the same lot (checklist item 31D).  NCPR 68] All manufacturing and inspection records and tested units shall be retained by the  manufacturer for a minimum of 10 years, unless otherwise specified by contract (checklist item  36D).                   NCPR 70] The non-destructive 100-percent acceptance testing shall be performed in accordance  with the product procurement specification (checklist item 34D), where required.      NCPR 71] Destructive acceptance testing shall be performed where specified by procurement  documentation.    .2.3  then fired to actuate the valve to the open position (checklist item 10A).    .2.5  35D).   .2.4  [NCPR 75] These units shall be X-rayed, tested for flow rate, leak tested to the  requirements of the performance specification, and then submitted to a burst pressure test of  2.5xMEOP.   .1  or propellant charges shipped by rail, air, vessel, and/or public highway shall comply with the  following: NASA-STD-8719.12, Safety Standard for Explosives, Propellants, and Pyrotechnics,  and Department of Transportation (DOT) regulations: 49 Code of Federal Regulations (CFR)  173 Subpart A General, 49 CFR 174 Carriage By Rail, 49 CFR 175 Carriage By Aircraft, 49  CFR 176 Carriage By Vessel, and 49 CFR 177 Carriage By Public Highway.   .2  Organization (ICAO) DOC 9284, Technical Instructions for the Safe Transport of Dangerous  Goods by Air, and International Air Transport Association, Dangerous Goods Regulations.   .3  explosive shipment approval shall accompany the shipment.     .2.2  units or 10 percent of the production lot.  .2.1  the customer.              application. The checklist assists in documenting the detailed compliance to the intent of the  safety specification. It is understood that different NC pyrovalve designs may meet a safety  requirement with a different approach or new backup material. The checklist also provides an aid  for Range Safety in reviewing the documentation. Note that the manufacturer and the system  designer may have to collaborate to complete the checklist.        List operating hazards, including cryogens, flammables, combustibles, or  hypergols. List MEOP and stored energy levels exceeding 19,307 J (14,240  ft·lb) in accordance with AFSPCMAN 91-710, Vol. 3, Section 12, and MIL-  STD-1522A.  List the maximum No-Fire energy threshold. (Reference section 4.2.4 in this  NASA Technical Specification.)  List the No-Fire level of the actuator at a reliability of 99.9 percent and  confidence level of 95 percent, as determined by either a Bruceton test or a  Neyer test. (See section 4.2.5 in this NASA Technical Specification.)  Provide thresholds of other sources of energy such as RF and the safety  margin. (Reference section 4.2.5 in this NASA Technical Specification.)    A. NESC-RP-10-00614.  B. NSTS 1700.7B.  C. AFSPCMAN 91-710.  D. NASA-SPEC-5022.                                Provide qualification testing data for vibration, shock, and other environmental  conditions. (Reference section 4.2.6 in this NASA Technical Specification.)  Provide detailed calculation of MEOP for the pyrovalve and the pressurization  system when personnel could be endangered.  Document proof pressure testing at 1.5xMEOP. For hypergol systems,  document that this is followed by helium leak test at a minimum of 1.0xMEOP  with a leak rate less than 1x10-6 standard cc/sec.  Document burst pressure testing in qualification test before and after firing and  after firing for LATs. (Reference section 4.3.2 in this NASA Technical  Specification.)  Provide drawing of the non-welded parent metal shear-section to confirm it is a  continuous unit of non-welded parent metal.  Document when the NC parent metal valve will be actuated to the open  position.  Provide safety analysis of inadvertent operation or leakage of hazardous  materials.  Provide verification that the only part of the valve in contact with the  hazardous fluids before actuation is the parent metal shear-section. (Reference  section 4.4.1 in this NASA Technical Specification.)  f the material used for the parent metal shear-section is 304L stainless steel,  checklist items 14 through 17 do not apply.   Provide a description of the material used for the parent metal shear-section.  (Reference section 4.4.2 in this NASA Technical Specification.)     Evaluate the physical properties of the material selected for the parent metal  shear-section compared with the characteristics of 304L stainless steel as the  baseline. (Reference section 4.2.5 in this NASA Technical Specification.)  Document the physical properties of the selected shear-section material to  ensure weldability and to ensure that weld stresses will not create cracks in the  “V” notch. (Reference section 4.4.2 in this NASA Technical Specification.)  Document the compatibility of the material used for the parent metal shear-  section with the hazardous fluids to be used in the system. (Reference section  4.4.2 in this NASA Technical Specification.)                                                                    Document the compatibility of any cleaning, test, or service fluids with  stringer materials to ensure they are not etched away. (Reference section 4.4.2  in this NASA Technical Specification.)  Document the compatibility of the hazardous fluids with the housing material.  (Reference section 4.4.2 in this NASA Technical Specification.)  Document the NC parent metal valve design used: single parent metal, dual  parent metal, or some other design. (Reference section 4.5 in this NASA  Technical Specification.)  Document that the valves have been manufactured, assembled, tested, and  documented on a manufacturing lot basis.  Document that the shear-sections are from the same melt and bar stock lot.  (Reference section 4.6.1 in this NASA Technical Specification.)  Verify that the samples of the shear section bars have been examined for voids  and other anomalies and document the results. (Reference section 4.6.3 in this  NASA Technical Specification.)  Verify that samples of the shear-section bar have been tested for composition,  tensile strength, yield strength, and elongation and that the results met the  specification requirements for the shear-section material. (Reference section  4.6.1 in this NASA Technical Specification.)  Verify that shear-sections were machined at the same machine shop, using the  same tooling and setup for the lot. Verify that the parts were properly cleaned.  (Reference section 4.6.4 in this NASA Technical Specification.)  Verify the proper passivation of the shear-sections. (Reference section 4.6.5 in  this NASA Technical Specification.)  Verify that critical shear-section dimensions are 100 percent inspected and  recorded for each shear-section. (Reference section 4.6.6 in this NASA  Technical Specification.)  Document the results of the shear-section “V” notch radius inspection and  show how it meets the requirement(s). (Reference section 4.6.6 in this NASA  Technical Specification.)  28AD Verify that an independent inspector (from a different company organization or  company or as directed by contract) inspected and recorded the critical  dimensions. (Reference section 4.6.7 in this NASA Technical Specification.)                                                                 Verify the serialization of the top assembly and the recording of the top  assembly production and inspection steps by serial number. (Reference section  4.6.10 in this NASA Technical Specification.)  Verify the welding of the shear-sections to the housing using the same weld  schedule and weld instructions. (Reference section 4.6.11 in this NASA  Technical Specification.)  Document the lot numbers of all ordnance items used in the production and  testing of NC parent metal valve lot. (Reference section 4.6.12 in this NASA  Technical Specification.)  Proof pressure test all weld joints and parent metal shear-sections at  1.5xMEOP; then perform the helium leak test at a minimum of 1.0xMEOP  with a resulting leak rate less than 1x10-6 standard cc/sec. All welds are to be  tested either during assembly or acceptance testing.  Verify that, during qualification testing, one unit was tested for burst pressure  at 2.5xMEOP for lines with diameters ≥3.8 cm (≥1.5 in) or 4.0xMEOP for  lines with diameters <3.8 cm (<1.5 in) and then actuated and retested at the  respective burst pressure test value. (Reference section 4.2.5 in this NASA  Technical Specification.)  Record any required non-destructive testing results as part of the Lot  Acceptance Test Report. (Reference section 5.1 in this NASA Technical  Specification.)  Record any required destructive testing results as part of the Lot Acceptance  Test Report. (Reference section 5.2.5 in this NASA Technical Specification.)  Retain all manufacturing, inspection, test hardware, and test results for a  minimum of 10 years, unless otherwise specified by contract. (Reference  section 4.7 in this NASA Technical Specification.)                                          required in certain situations. As valves subject to this NASA Technical Specification have to  have a safety factor of at least 2.5, analysis is not generally required for shear valves unless there  is measurable deformation.   NCPR 80] When NC parent metal valve analysis is required, either before manufacturing or in  the event that proper documentation has not been maintained, the analysis and evaluation process  shall include the following:      minimum material strength from the current literature, from the manufacturer’s specifications, or  from actual raw material analyses.        epending on the stress levels, non-linear analysis may also be required. This analysis should  result in identification of the regions that control the design, the net and peak stresses in these  regions, and resulting factors of safety. The minimum design factors of safety are 1.5, based on  yield strength, and 2.5, based on ultimate tensile strength, as needed to successfully complete the  1.5 proof and 2.5 design burst safety factors for other pressure components as required by AIAA  b. Identify the component loading(s) to be considered, including proof test pressure  loadings, media pressure loadings for prelaunch, launch loadings, and pressure loadings after  actuation as a minimum.               S-080-1998, Table 2. These analyses are based on worst-case assumptions for tolerances and  material properties.                   Military Standard: Electroexplosive Subsystem Safety Requirements  and Test Methods for Space Systems   Statistical Methods Appropriate for Evaluation of Fuzed Explosive-  Train Safety and Reliability    Standard Materials and Processes Requirements for  Spacecraft  NSTS/ISS 18798,  Revision B  Interpretations of NSTS/ISS Payload Safety Requirements  (Accessible at http://snebulos.mit.edu/projects/reference/NASA-  Generic/NSTS_18798_RevB.pdf)     AIAA Standard for Space Systems – Metallic Pressure Vessels,  Pressurized Structures, and Pressure Components   Special Report: Fire, Explosion, Compatibility, and Safety Hazards  of Hypergols – Hydrazine   Special Report: Fire, Explosion, Compatibility, and Safety Hazards  of Hypergols – Monomethylhydrazine                                                      Special Report: Fire, Explosion, Compatibility, and Safety Hazards  of Nitrogen Tetroxide   ASTM E2375-08  (2013)                       requirements by programs and projects. (Note: Enter “Yes” to describe the requirement’s applicability to the program or project; or  enter “No” if the intent is to tailor, and enter how tailoring is to be applied in the “Rationale” column.)    Applicable  (Enter Yes  or No)                Pyrovalve Analysis and  Evaluation Process  Pyrovalve Analysis and  Evaluation Process  Pyrovalve Analysis and  Evaluation Process  Pyrovalve Analysis and  Evaluation Process  Pyrovalve Analysis and  Evaluation Process  [NCPR 1] Tailoring shall be documented and communicated in writing to the  appropriate range safety organization and the NASA Payload Safety Program Manager.  [NCPR 2] Each individual project shall clearly identify its Technical Authority early in  the project development process.  [NCPR 3] NC parent metal valves shall be properly designed based on sound  engineering and analysis to provide a level of protection against rupture or leakage at  least equivalent to other parts of the pressure system, i.e., tubing, tanks, and fittings. For  more details, see Appendix B in this NASA Technical Specification.  [NCPR 4] NC parent metal valves shall be designed and constructed to meet spacecraft  pressure system requirements.  [NCPR 5] Several valve loadings shall be performed as a minimum: proof and burst  test pressure loadings, media pressure loadings for pre-launch, launch loadings,  pyrotechnic loadings, and pressure loadings after actuation.  [NCPR 6] Post-manufacturing analysis shall be required if design analysis, testing, and  process control documentation that prove compliance to NASA-STD-5019, Fracture  Control Requirements for Space Flight Hardware, are not available.  [NCPR 7] In the case of requirement 4.1.4 (NCPR 10) above, testing and analysis shall  demonstrate a minimum four times the pressurization cycles of the component.                                              Applicable  (Enter Yes  or No)                Pyrovalve Analysis and  Evaluation Process  Systems-Level  Considerations  Systems-Level  Considerations  Systems-Level  Considerations  Systems-Level  Considerations  Systems-Level  Considerations  Systems-Level  Considerations  Systems-Level  Considerations    Proof Pressure and Leak  Tests  Proof Pressure and Leak  Tests  Proof Pressure and Leak  Tests  Proof Pressure and Leak  Tests  [NCPR 8] If reliability analysis is used, it shall predict a risk of leakage less than  3x10-5 (extremely improbable) to comply with NASA-STD-8719.24 (Annex) and  AFSPCMAN 91-710.  [NCPR 9] The NC parent metal valve initiator shall be a NASA Standard Initiator (NSI)  or equivalent meeting the same No-Fire current and pin-to-case high-voltage protection  requirements.  [NCPR 10] Grounding caps shall be installed on pyrovalve initiators at all times until  the pyrovalve is installed in the spacecraft and the flight connectors are attached.  [NCPR 11] Ignition systems shall use twisted shielded control cables to protect from  electromagnetic interference.  [NCPR 12] The actuation method of the NC parent metal valve shall meet all applicable  safety requirements in NASA-STD-8719.24 (Annex) and AFSPCMAN 91-710 and  prevent unintended actuation.  [NCPR 13] For system applications, all qualified aerospace initiators shall meet strict  No-Fire and All-Fire requirements.  [NCPR 14] The actuation method of the valve shall be qualified, with margin, in  accordance with the application requirements when mounted on the valve.  [NCPR 15] The valve design shall preclude inadvertent operation or leakage as a result  of exposure to all potential environmental conditions while loaded with hazardous gases  or liquids (checklist item 11A).  [NCPR 16] All valves shall meet pneumatic leak test and proof pressure test  requirements in accordance with section 4.3.1 in this NASA Technical Specification.  [NCPR 17] Each valve lot shall be qualified by meeting burst pressure test requirements  in accordance with section 4.3.1 in this NASA Technical Specification.  [NCPR 18] All valves shall be proof tested to a minimum pneumatic proof pressure at  1.5xMEOP.  [NCPR 19] This capability shall be demonstrated on every unit during assembly, with  pressure applied individually to each line and separately to the valve housing through  the actuation ram chamber while the lines are vented.  [NCPR 20] The test shall be performed on all parent metal shear-section and all parts of  the valve exposed to pressure after valve actuation (checklist item 7AC).  [NCPR 21] All welds shall be leak tested either during assembly or acceptance testing  (checklist item 32A).                                                                 Applicable  (Enter Yes  or No)            Proof Pressure and Leak  Tests  Proof Pressure and Leak  Tests  Proof Pressure and Leak  Tests  Proof Pressure and Leak  Tests  Proof Pressure and Leak  Tests  4.3.2a  4.3.2b  Burst Pressure Test  Burst Pressure Test           Internal Structural  Requirements  Internal Structural  Requirements  Internal Structural  Requirements  [NCPR 22] Either non-destructive acceptance testing (checklist item 6C) shall be  accomplished or the risk of defects be mitigated through process control.  [NCPR 23] If process control is used, approval shall be obtained from the NASA  Fracture Control Board for spacecraft requiring this in programmatic requirements.  [NCPR 24] If fracture mechanics and crack growth analysis are used to verify  compliance with NASA-STD-5019 (see section 4.1 of this NASA Technical  Specification), growth of the maximum credible crack size shall be demonstrated to the  fracture control authority to be non-credible, based on knowledge of quality control and  manufacturing techniques used to make the NC parent metal valve.  [NCPR 25] However, this capability is technically established, the NC parent metal  valve shall be capable of surviving four times the design operational life.  [NCPR 26] If the valve design is to provide two separate and independent parent metal  barriers to the flow before valve actuation, this capability shall be verified by proof  testing at 1.5xMEOP, independently applied to each parent metal shear-section and then  externally to the shear-section when welded in the housing, with no evidence of  permanent deformation or leakage during LAT.  [NCPR 27] The minimum hold time for each burst pressure test shall be 5 min.  [NCPR 28] All NC parent metal valves shall meet a minimum design burst pressure of  2.5xMEOP for lines with diameters ≥3.8 cm (≥1.5 in) or 4.0xMEOP for lines with  diameters <3.8 cm (<1.5 in).  NCPR 29] This capability shall be demonstrated on at least one NC parent metal valve  from each lot.  [NCPR 30] Testing shall be performed before and after actuation and on a sample of the  units that have successfully functioned after destructive acceptance testing (checklist  items 8AD and 33D).  [NCPR 31] If the unit passes the burst pressure test, the pressure shall be increased until  burst actually occurs or 4.00xMEOP is reached, at which point the test can be  discontinued.  [NCPR 32] An NC valve used in ELV hazardous prelaunch applications shall provide a  parent metal barrier in the shear-section.  [NCPR 33] The internal shear-section shall be a continuous unit of non-welded parent  metal.  [NCPR 34] The parent metal shear-section shall be the only part of the valve that is in  contact with the hazardous fluids before the actuation of the valve (checklist item 12D).                                                             Applicable  (Enter Yes  or No)                    Parent Metal Shear-Section  and Valve Housing  Parent Metal Shear-Section  and Valve Housing  Parent Metal Shear-Section  and Valve Housing  Parent Metal Shear-Section  and Valve Housing  Parent Metal Shear-Section  and Valve Housing  Parent Metal Shear-Section  and Valve Housing  Parent Metal Shear-Section  and Valve Housing          [NCPR 35] The use of a material other than 304L shall be carefully evaluated, with  analysis showing that it meets NASA-STD-5019 requirements.  [NCPR 36] The following material characteristics (checklist item 13D) shall be  addressed:  [NCPR 37] Desirable characteristics shall include low notch sensitivity; good fatigue  properties; low stress corrosion cracking; high elongation; and toughness at cryogenic,  ambient, and high temperatures (checklist item 14D), if applicable.  [NCPR 38] The material used for the parent metal shear-section shall have good  weldability to the housing material and to the spacecraft tubing system.  [NCPR 39] The parent metal shear-section and any other parts wetted by the fluids  and/or combustion products shall be constructed of a metal or other material that is  compatible with the fluids and/or combustion products.  [NCPR 40] The valve housing shall meet the same proof pressure, burst pressure, and  leak test requirements as the parent metal shear-section after the valve is actuated.  [NCPR 41] The housing and all other internal material that will be in contact with the  hazardous fluids after actuation, e.g., rams, plugs, seals, shall also have the same  requirements for materials compatibility with the hazardous fluids and the same welding  compatibility requirements (checklist item 18D).  [NCPR 42] Valves shall be manufactured, assembled, tested, and documented on a  manufacturing lot basis (checklist item 20A).  [NCPR 43] The shear-sections shall be from the same melt and bar stock lot (checklist  item 21D).  [NCPR 44] Samples of the first and, subsequently, every fourth bar shall be tested for  composition, tensile strength, yield strength, and elongation (checklist item 23D).  [NCPR 45] Material certifications and traceability records shall be maintained and  available.  [NCPR 46] The individual shear-section bars shall be identified, tracked, and kept in  controlled storage as part of process control.  [NCPR 47] For single isolation valves, a suitable and representative sample shall be  removed from the middle or ends of each bar and submitted to an accredited laboratory  for analysis.  [NCPR 48] The samples shall be polished, cleaned, and etched with a solution of nitric  acid and hydrofluoric acid to remove 0.000762 to 0.00127 cm (0.0003 to 0.0005 in)  from the surface.                                                                 Applicable  (Enter Yes  or No)            4.6.6  4.6.6a       Manufacturing Requirements  Manufacturing Requirements        4.6.8  4.6.8a  Manufacturing Requirements  Manufacturing Requirements        [NCPR 49] The polished samples shall be examined by optical and scanning electron  microscopy for voids to ensure that the manufacturer’s requirements are met.  [NCPR 50] The customer shall concur with the manufacturer’s requirements (checklist  item 22D).  [NCPR 51] If any sample fails this test, the associated bar shall be rejected and removed  from the lot.  [NCPR 52] The shear-section bar stock shall be machined at the same machine shop,  using the same tooling and machine setup for each lot of shear-sections (checklist item  24D).  [NCPR 53] Tubes shall be passivated in accordance with an industry consensus standard  as specified by a cognizant materials and process authority (checklist item 25D).  [NCPR 54] All shear-sections shall be dimensionally inspected.  [NCPR 55] Shear-section dimensions that are critical for containment of hazardous  fluids shall be 100 percent inspected and recorded for each shear-section (checklist item  26D).  [NCPR 56] If applicable, the “V” notch angle, depth, and tip radius shall be measured  by optical comparator or equivalent and verified to fully meet drawing requirements and  indicate measured tip radius (checklist item 27D).  [NCPR 57] If the shear section has double “V” notches, the dimensions of both break  areas shall be recorded and the inspector’s identification affixed to the data.  [NCPR 58] There shall be an independent quality verification and data recording that  the parent metal barrier conforms to the minimum thickness required by the design  drawing (checklist item 28AD).  [NCPR 59] The risk of critical flaws in the “V” notch area shall be addressed.  [NCPR 60] In accordance with NASA-STD-5019, the initial critical flaw size shall be  established by NDE, proof testing, or process control if the valve does not meet or  exceed a demonstrated safety factor of 1.5.  [NCPR 61] If the NDE method is used, it shall be demonstrated to be capable of  detecting the minimum sized critical flaws.  [NCPR 62] Etchant limitations: an etchant solution of nitric acid and hydrofluoric acid  or other similar solutions that may dissolve stringers shall not be used internally or  externally on the parent metal shear-section.  [NCPR 63] Valves shall be serialized and records of assembly production and  inspection steps kept by serial number (checklist item 29D).                                                                     Applicable  (Enter Yes  or No)       4.6.11  4.6.11a  Manufacturing Requirements  Manufacturing Requirements                Hardware Records and Test  Hardware   Non-Destructive Acceptance  Testing  Destructive Acceptance  Testing  Destructive Acceptance  Testing  Destructive Acceptance  Testing  Destructive Acceptance  Testing  Destructive Acceptance  Testing  Destructive Acceptance  Testing  Packaging and Shipping  [NCPR 64] Shear-sections shall be welded to the housing subassembly.  [NCPR 65] Welding shall be done on a weld lot basis using the same weld schedule and  weld instructions for a specific weld and be done in a way that minimizes or eliminates  “V” notch residual weld stress (checklist item 30D).  [NCPR 66] At a minimum, all housing welds shall be subjected to the full 1.5xMEOP  proof test without leakage and pass visual inspection.  [NCPR 67] Although the pyrotechnic devices used to power the valve are specified by  the program, they shall be made and tested from the same lot (checklist item 31D).  NCPR 68] All manufacturing and inspection records and tested units shall be retained  by the manufacturer for a minimum of 10 years, unless otherwise specified by contract  (checklist item 36D).  [NCPR 69] After manufacturing is complete, the lot of valves shall be submitted to  LAT.  [NCPR 70] The non-destructive 100-percent acceptance testing shall be performed in  accordance with the product procurement specification (checklist item 34D), where  required.  [NCPR 71] Destructive acceptance testing shall be performed where specified by  procurement documentation.  [NCPR 72] A sample for the destructive acceptance testing shall be randomly chosen by  the customer.  [NCPR 73] The quantity of the destructive acceptance testing shall be the larger of 5  units or 10 percent of the production lot.  [NCPR 74] The sample shall be subjected to the specified pressures and temperatures  and then fired to actuate the valve to the open position (checklist item 10A).  [NCPR 75] These units shall be X-rayed, tested for flow rate, leak tested to the  requirements of the performance specification, and then submitted to a burst pressure  test of 2.5xMEOP.  [NCPR 76] After passing the burst test, the units shall again be leak tested (checklist  item 35D).  [NCPR 77] Pyrovalves or other parent metal shear-section valves containing explosives  or propellant charges shipped by rail, air, vessel, and/or public highway shall comply  with the following: NASA-STD-8719.12, Safety Standard for Explosives, Propellants,  and Pyrotechnics, and Department of Transportation (DOT) regulations: 49 Code of  Federal Regulations (CFR) 173 Subpart A General, 49 CFR 174 Carriage By Rail, 49                                                                      Applicable  (Enter Yes  or No)       Parent Metal Shear-Section  Analysis Process  CFR 175 Carriage By Aircraft, 49 CFR 176 Carriage By Vessel, and 49 CFR 177  Carriage By Public Highway.  [NCPR 78] Those transported by air shall comply with International Civil Aviation  Organization (ICAO) DOC 9284, Technical Instructions for the Safe Transport of  Dangerous Goods by Air, and International Air Transport Association, Dangerous  Goods Regulations.  [NCPR 79] A Material Safety Data Sheet or Safety Data Sheet and, if applicable, a DOT  explosive shipment approval shall accompany the shipment.  [NCPR 80] When NC parent metal valve analysis is required, either before  manufacturing or in the event that proper documentation has not been maintained, the  analysis and evaluation process shall include the following:  a. Obtain valve documentation, including a full fabrication drawing set of the  body and fittings and body weldment, to be used to support the analysis and evaluation  process.  b. Identify the component loading(s) to be considered, including proof test  pressure loadings, media pressure loadings for prelaunch, launch loadings, and pressure  loadings after actuation as a minimum.      the minimum material strength from the current literature, from the manufacturer’s  specifications, or from actual raw material analyses.  d. Review the valve design to identify areas that may control the design,  including, as a minimum, the shear-section, tubing section, body housing, and welds.  e. Analyze the previously identified regions using mathematical, finite element                                    "}