{"pdf_text_combined": "   NASA-STD-4003A  w/CHANGE 1:  REVALIDATED w/  ADMINISTRATIVE/  EDITORIAL CHANGES  2016-01-19  Approved: 2013-02-05  Superseding NASA-STD-4003  (Baseline)  ELECTRICAL BONDING FOR  NASA LAUNCH VEHICLES, SPACECRAFT,  PAYLOADS, AND FLIGHT EQUIPMENT                           eleted the following document references:  MIL-C-5541, MIL-STD-889, NSTS 37330,  SAE-AMS-M-3171, SAE-ARP-1481  SAE-ARP-ILO1870, SSP 30245  Documents:  NASA-STD-6012, NASA-STD-6016,  SAE-ARP-5414      ection 3.1: Added “EMI  Electromagnetic Interference”   ection 3.1: Changed GFRP acronym.  From: graphite filament reinforced plastic  To: glass or graphite fiber reinforced  plastic  definition changed  From: “…mechanical interfaces…”  To: “…faying surface mechanical  interfaces..”               Document  Revision  Change  Number        Reformatted document to meet current  NASA Standard Template              Column: CLASS L, Row: BOND REQT.  From: “Bonding components shall  withstand high current.”  To: “Bonding components are required to  withstand high current without arcing.”   From: “…ignition point…”  To: “…ignition temperature…”    From: “…due to heating or arcing.”  To: “due to conditions including heating,  sparking, or arcing.”  igure 1: Changed curve title.  From: “Maximum Resistance”  To: “Maximum Allowable Resistance”   From: “Electrical Connectors”  To: “Electrical Connectors and Shield  Termination”      From: “…ignition point…”  To: “…ignition temperature…”          Document  Revision  A  (Continued)  Change  Number     From: “Reduces power and voltage  losses.”  To: “Reduces power and voltage losses at  the bonding interfaces.”      From: “…20 decibels (dB) less than  applicable minimum ignition energy (MIE)  threshold level…”  To: “1/10 of applicable minimum ignition  energy (MIE) (or 20 decibels (dB) below)  threshold level…”  ection 5.1.2: Moved the information from  the following sections to 5.1.2 Bond Straps:  4.3.3 Bond Straps  4.4.2 Conductivity of Bond Joint  4.4.3 Bond Straps   cleaning and finishing and pointed to  NASA-STD-6012 and NASA-STD-6016  instead.      ection 5.4: Replaced “Graphite Filament  Reinforced Plastic (GFRP)” with “Carbon  Fiber Reinforced Plastic (CFRP).”  Considerations, and changed to: 5.4  Graphite Filament Reinforced Plastic  (GFRP).    5.2.1 Aluminum  5.2.2 Magnesium  5.2.3 Steel       Section 4.1.6.b (1): Added requirement for  conductive coatings.      Document  Revision  A  (Continued)  Change  Number              to the appendix and divided into the  following sections:  A.3.8 Pipe, Tubing and Hoses (Class S)  A.3.9 Composite Materials  A.3.10 Multilayer Insulation    From: “…GFPR…”  To: “…glass or graphite fiber reinforced  plastic (GFRP)…”        reference documents:  NASA-HDBK-4002  NASA-HDBK-4006  NASA-STD-4005  NASA-STD-464C        Document  Revision  A  (Continued)  Change  Number     Deleted Section 5.4.3 Multilayer  Insulation         Document  Revision  A  (Continued)  Change  Number     Section A.3.11: Added Figure 2, Electrical  Bonding Path Diagram Example    Revalidated w/Administrative/Editorial  Changes—This NASA Technical Standard  was reviewed and no technical changes  resulted. However, requirements EBR 33,  34, 43, 92, and 93 were clarified based on  information contained in related notes; and  requirement 5.2.f was re-lettered to 5.2.e.  Administrative changes to number  requirements, add a Requirements  Compliance Matrix as Appendix A, and  conform to the current template were made,  along with editorial corrections.                This NASA Technical Standard is published by the National Aeronautics and Space  Administration (NASA) to provide uniform engineering and technical requirements for  processes, procedures, practices, and methods that have been endorsed as standard for NASA  programs and projects, including requirements for selection, application, and design criteria of an  item.   Facilities and may be cited in contract, program, and other Agency documents as a technical  requirement. It may also apply to the Jet Propulsion Laboratory and other contractors only to the  extent specified or referenced in applicable contracts.   bonding practices across NASA programs. The intent is to provide stand-alone requirements and  to provide enough data to help modify requirements or to allow waivers if needed.   for changes to this NASA Technical Standard should be submitted via MSFC Form 4657, Change  Request for a NASA Engineering Standard.   Original Signed By _  Ralph R. Roe, Jr.  NASA Chief Engineer                          DOCUMENT HISTORY LOG .........................................................................................  FOREWORD ......................................................................................................................  TABLE OF CONTENTS ...................................................................................................  LIST OF APPENDICES ...................................................................................................  LIST OF FIGURES ...........................................................................................................  LIST OF TABLES .............................................................................................................   2   7   8   9   10   10  1.  1.1  1.2  1.3  2.  2.1  2.2  2.3  2.4  3.  3.1  3.2  SCOPE ................................................................................................................  Purpose .................................................................................................................  Applicability .........................................................................................................  Tailoring ...............................................................................................................   11   11   11   11  APPLICABLE DOCUMENTS .........................................................................  General .................................................................................................................  Government Documents ......................................................................................  Non-Government Documents ..............................................................................  Order of Precedence .............................................................................................   11   11   12   12   12  ACRONYMS AND DEFINITIONS .................................................................  Acronyms and Abbreviations ..............................................................................  Definitions ...........................................................................................................   12   12   13  GENERAL REQUIREMENTS ........................................................................  4.  Electrical Bonding ...............................................................................................  4.1  Assembly Drawings .............................................................................................  4.1.1  4.1.2  Power Current Return Path (Class C) ..................................................................  4.1.2.1 Bond Joints ..........................................................................................................  4.1.2.2 Magnesium Alloy ................................................................................................  4.1.2.3 Hazardous Area Bonding .....................................................................................  4.1.2.4 Piping, Tubing, and Hoses ...................................................................................  4.1.3  Shock and Fault Protection (Class H) ..................................................................  4.1.3.1 Hazardous Area Bonding .....................................................................................  4.1.4  Electromagnetic Interference or Radio Frequency (Class R) ..............................  4.1.4.1 Electrical Connectors and Shield Termination ....................................................  4.1.4.2 Antennas ..............................................................................................................  Lightning Protection (Class L) ............................................................................  4.1.5  4.1.5.1 Hazardous Area Bonding .....................................................................................  4.1.6  Electrostatic Discharge (Class S) .........................................................................  4.1.6.1 Multilayer Insulation ............................................................................................  4.1.6.2 Hazardous Area Bonding .....................................................................................  4.1.6.3 Pipe, Tubing, and Hoses ......................................................................................   15   16   16   16   16   16   16   17   17   19   19   19   20   20   20   22   22   23   24                            DETAILED REQUIREMENTS .......................................................................  5.  5.1  Bonding Methods .................................................................................................  5.1.1 Metal-to-Metal (faying surface to faying surface) ................................................  Bond Straps ...........................................................................................................  5.1.2  Fasteners ...............................................................................................................  5.1.3  Surface Cleaning and Finishing ............................................................................  5.2  Galvanic Corrosion of Dissimilar Materials .........................................................  5.3  Carbon Fiber Reinforced Plastic ...........................................................................  5.4  Verification ...........................................................................................................  5.5   24   24   24   24   26   26   27   27   28     30   38   38   38   39   39   39   39   40   42   43   44   45   45   46   46  Requirements Compliance Matrix ........................................................................  Guidance ...............................................................................................................  B  Purpose ..................................................................................................................  B.1  Reference Documents ...........................................................................................  B.2  B.3  Guidelines .............................................................................................................  B.3.1 Design Parameters ................................................................................................  Power Current Return Path (Class C) ...................................................................  B.3.2  Shock and Fault Protection (Class H) ...................................................................  B.3.3  Electromagnetic Interference or Radio Frequency (Class R) ...............................  B.3.4  Lightning Protection (Class L) .............................................................................  B.3.5  Electrostatic Discharge (Class S) ..........................................................................  B.3.6  B.3.7 Galvanic Corrosion of Dissimilar Materials .........................................................  Pipe, Tubing and Hoses (Class S) .........................................................................  B.3.8  B.3.9  Composite Materials .............................................................................................  B.3.10 Multilayer Insulation .............................................................................................  B.3.11 Verification ...........................................................................................................                             Fault Current vs. Maximum Bonding Resistance in the Presence of  Flammable Vapors or Liquids .............................................................................                                      ELECTRICAL BONDING FOR NASA LAUNCH VEHICLES,  SPACECRAFT, PAYLOADS, AND FLIGHT EQUIPMENT  requirements for NASA launch vehicles, spacecraft, payloads, and equipment. Its intent is to  provide fundamental aerospace electrical bonding requirements, as well as to classify electrical  bonds according to their purpose. This NASA Technical Standard also states the requirements  for the various classes. The rationale for specific requirements is stated where possible.  Additional data is provided to support tailoring for new applications, if necessary.      erifiable requirement statements are numbered and indicated by the word “shall”; this NASA  Technical Standard contains 97 requirements. Explanatory or guidance text is indicated in italics  beginning in section 4. To facilitate requirements selection and verification by NASA programs and  projects, a Requirements Compliance Matrix is provided in Appendix A.  Facilities and may be cited in contract, program, and other Agency documents as a technical  requirement. It may also apply to the Jet Propulsion Laboratory and other contractors only to the  extent specified or referenced in applicable contracts.    EBR 1] Tailoring of this NASA Technical Standard for application to a specific program or project  shall be formally documented as part of program or project requirements and approved by the  responsible Technical Authority in accordance with NPR 7120.5, NASA Space Flight Program and  Project Management Requirements.                         2.1.1  designated.   .1.2  Technical Authority.    NASA Space Flight Program and Project Management  Requirements       from the Standards Developing Body or other document distributors, or information for  obtaining the document is provided.        .4.1 The requirements and standard practices established in this NASA Technical Standard do  not supersede or waive existing requirements and standard practices found in other Agency  documentation.   2.4.2  documents shall be resolved by the responsible Technical Authority.       ac  AWG  CFRP  Microhenries  alternating current  American Wire Gauge  carbon fiber reinforced plastic                                class of bond for intentional current return  class of bond for fault current return  class of bond for lightning current  class of bond for radio frequency current  class of bond for dissipation of electrostatic charge  Centimeter  Decibels  direct current  Electrical Bonding Requirements  electro-explosive device  electromotive force  electromagnetic interference  electrostatic discharge  Eastern Test Range  equipment under test  foot/feet  frequency  glass or graphite fiber reinforced plastic  megahertz  minimum ignition energy  National Aeronautics and Space Administration  radio frequency  requirement  Society of Automotive Engineers  second/seconds  standard (as in document)  CLASS C  CLASS H  CLASS L  CLASS R  CLASS S  cm  dB  dc  EBR  EED  EMF  EMI  ESD  ETR  EUT  ft  freq  GFRP  MHz  MIE  NASA  RF  rqmt  SAE  sec  STD     A low impedance bond path for antenna installations to ensure no degradation of  acceptable performance and to protect the antenna element from damage caused  by P-static, radio frequency (RF) currents, or lightning events.      surface mechanical interfaces to minimize electrical potential differences between equipment and  individual parts of structure. Good electrical bonding provides the following:    Electrical bonds are classified according to the purpose for the bond. Table 1, Summary of  APPROVED FOR PUBLIC RELEASE—DISTRIBUTION IS UNLIMITED              Flight Vehicle: The launch vehicle and spacecraft or payload (if the payload outer  surfaces are exposed to the triboelectrification process), and fairings or shrouds protecting  payloads.                      RADIO  FREQUENCY   ELECTROSTATIC  CHARGE        Reduces power and  voltage losses at the  bonding interfaces.  Applies to equipment and  structure, which are  required to return  intentional current  through structure.  PURPOSE OF  BOND  Protects against fire  or shock to personnel.  Applies to equipment  and structure that  may be required to  carry fault current in  case of a short to case  or structure.  Requires low impedance  and low voltage across  joints to assure adequate  power to the user.  Jumpers and straps  acceptable.  Requires low  impedance and low  voltage across joints  to prevent shock  hazard or fire due to  short. Jumpers and  straps acceptable.  BOND  REQMT.  Protects equipment  from RF emissions.  Applies to equipment  that could generate,  retransmit, or be  susceptible to RF.  Includes antenna  mounts and cable  shield connections.  Covers wide  frequency range.  Requires low RF  impedance at high  frequency. Direct  contact preferred. No  jumpers. Short, wide  strap may be used as  last resort.    DC BOND  RESISTANCE  REQMT.  Bonding resistance  requirement depends on  current.  Bonding resistance  requirement, 0.1 ohm  or less. Special  requirements when  near flammable  vapors.  Bonding resistance  requirement, 2.5  milliohms or less.  Low inductance  required.  Protects equipment  from lightning effects.  Applies to equipment  or structure that would  carry current resulting  from a lightning  strike.  Protects against  electrostatic  discharge. Applies to  any item subject to  electrostatic charging.  Requires low  impedance at  moderate frequency.  Bonding components  are required to  withstand high  current without  arcing. Straps and  jumpers are required  to withstand high  magnetic forces.  Bonding resistance  requirement depends  on current. 500 volts  or less across any  joint. Low inductance  required.    Allows moderate  impedance. Jumpers  and straps acceptable.  Typical bonding  resistance  requirement, 1.0 ohm  or less.  Low frequency bonds allow use of straps and jumpers.  High frequency bonds require low inductance paths. Short straps are sometimes acceptable.  High current bonds require large cross-sectional areas.  Low current bonds allow use of small contact areas.         requirement, specific design requirements, and, in most cases, measurable resistance values for  each class of bond. Guidelines in Appendix B discuss the reasons for some of the requirements  and provide data for possible modifications or rationale for waivers to the requirements.      FREQ.  REQMT.  CURRENT  REQMT.                                                        EBR 7] All circuits and systems that use vehicle structure for a power return path shall satisfy  Class C bonding requirements.   EBR 5] There may be more than one purpose for bonding a specific interface, and the bond  shall meet the requirements of each applicable class.        supply and the load shall be controlled to keep the voltage within the tolerance of the applicable  power quality standard.         a. [EBR 11] Electrical bonding of equipment or vehicle structure in areas where  flammable materials, gases, or vapors may be present shall be adequate to prevent ignition due to  heating, sparking, or arcing.   Maximum Allowable Resistance curve shown in figure 1, Fault Current vs. Maximum Allowed  Bonding Resistance in the Presence of Flammable Vapors or Liquids.                [EBR 13] Pipes, tubing, and hoses shall not be used as an intentional return path for electrical  current.       bonded to structure with a resistance of 0.1 ohm or less using the methods described in section  5.1.     Typical personnel protection breakers will trip within 0.2 second after a hard short to case.  Resultant voltage on the enclosure of the affected component should not exceed 4.5 volts, and no  fire or damage to the bond is allowed.                  FAULT  CURRENT  (AMPS)  30  49  58  100  200  1000  5000  MAXIMUM  ALLOWABLE  RESISTANCE  (MILLIOHMS)  3.6  1.86  1.54  0.74  0.37  0.074  0.0148  HAZARD  RESISTANCE  (MILLIOHMS)  18  9.3  7.7  3.7  1.85  0.37  0.074  Figure 1—Fault Current vs. Maximum Allowed Bonding Resistance in the Presence of  Flammable Vapors or Liquids               EBR 18] Electrical bonding of equipment or vehicle structure in areas where flammable  materials, gases, or vapors may be present shall be adequate to prevent ignition due to conditions  including heating, sparking, or arcing.          described in section 5.1 to provide a low impedance path from the equipment enclosure to  structure.  designed such that the inductance and overall impedance, including resonances, are low enough  to prevent interference at the frequencies of interest.     implement Class R electrical bonding between all outer mold line components so as to inherently  provide a uniform low impedance enclosure surrounding the vehicle.     elements, as well as between structural elements and outer mold line components, so that the  entire structure of the vehicle is interconnected with uniform low impedance.     cable shields shall be installed to provide a low impedance path from the backshell to the  equipment case.                    Examples of such joints include between shield and backshell, backshell and connector, harness  connector and enclosure connector, and enclosure connector and equipment enclosure.   EBR 28] Antennas that require low impedance to the ground plane for proper operation shall  meet Class R requirements.   rotection against lightning strikes should be provided for launch vehicles and their payloads  during transportation, storage, prelaunch, launch, and landing. Propellant, pyrotechnics, and  electronic equipment are particularly susceptible to direct and indirect effects of lightning. Refer  to Appendix B.3.5 for more information.  a. [EBR 29] To distribute the current around the vehicle and minimize the currents near  possible entry points into the vehicle and near critical areas and systems (including pyrotechnic  systems, rocket motors, fuel handling and storage areas, antennas, electronic equipment, and  signal and power cables), multiple low impedance paths shall be incorporated across and through  vehicle outer mold line and structural components.  b. [EBR 31] Each electrical bond shall be bonded using the methods described in  section 5.1, have low resistance and adequate contact area to carry its share of lightning current  without sustaining a burning, melting, distorting, or other heating effect due to the long duration,  high-current portion of the lightning strike.      (1) [EBR 32] The bonds shall have low impedance to prevent arcing and coupling of  voltage spikes into electronic circuits due to the fast rise time portion of the  lightning strike.  expected to carry high amplitude lightning currents should be bonded with multiple low  impedance connections to minimize aperture size and slot length.    doors, and other apertures in outer mold line components (expected to carry high amplitude  lightning currents) shall be no greater than 2.5 milliohms.                    that are in the lightning current path, shall be capable of carrying expected lightning currents  without damage.  Electrical cables that are outside the vehicle mold line or that could carry the lightning  current should be completely enclosed in gross overshields with a circumferential 360  degree termination into bulkhead penetrations, connectors, or connector backshells.     with SAE-ARP-5414, Aircraft Lightning Zoning, supplemented by analysis employing lightning  current waveforms defined in SAE-ARP-5412, Aircraft Lightning Environment and Related Test  Waveforms.                              EBR 41] All conducting items, except active antenna elements, having any linear dimension  greater than 7.6 centimeters (cm), which are subject to precipitation static effects, triboelectric  effects, fluid flow, air flow, space and launch vehicle charging, separation of elements, and other  charge generating mechanisms, shall have a mechanically secure electrical bond path to vehicle  structure using the methods described in section 5.1.      A mechanically secure electrical bond path is a continuous bond path that maintains the default  dc resistance (or lower) after exposure to shock, vibration, launch loads, and other expected  mechanical movement.  A limit of 1.0 ohm is used as a requirement because it is easily obtained with good contact  between conductive surfaces. Static charges can usually be dissipated through less conductive  connections.  igher dc resistance values acceptable for Class S electrical bonds may be determined  through performance of a detailed analysis to determine the amount of stored energy on  the item to be bonded as a function of the proposed electrical bond resistance.   electrical bonds, the stored energy determined by the analysis shall be less than applicable hazard  threshold levels for personnel shock, equipment upset, flammable materials, gases, or vapors, or  electro-explosive device (EED) ignition for approval of the proposed electrical bond resistance.  (1) [EBR 44] All conductive coatings, including those used to treat dielectric surfaces,  shall be electrically bonded to the vehicle structure with a dc resistance of less than  105 ohms.    Launch services providers may levy flight vehicle surface conductivity requirements. See  Appendix B.3.6 for more information.                               [EBR 48] Two attach points to the structure per blanket shall be used for  redundancy.  [EBR 49] Resistance from attach points to the structure shall be 1.0 ohm or  less.                   b. [EBR 57] Specific Class S electrical bond values in hazardous areas shall be  determined through performance of a detailed analysis to determine the amount of stored energy  on the item to be bonded as a function of the proposed electrical bond resistance.  (1) [EBR 58] The stored energy determined by the analysis shall be 1/10 of  applicable minimum ignition energy (MIE) (or 20 decibels (dB) below)  threshold level for the flammable materials, gases, or vapors that may be  present.                     voltage, generated by fluid flow, will not exceed 350 volts at any point outside the pipes, tubes,  or hoses.         he following paragraphs describe the bonding methods, with the metal-to-metal method being  the preferred method. The metal-to-metal method may not be feasible, and the bonding strap or  fastener method may be the best bonding alternative for the application.    the mated surfaces into one piece of metal, such as by welding or brazing, are considered  permanent and inherently bonded.   have their faying surfaces prepared prior to assembly in accordance with paragraph 5.2 to ensure  a good electrical bond.   accordance with applicable mechanical engineering assembly and installation  requirements.                               (1) [EBR 65] The bond straps shall be capable of withstanding the anticipated motion  and vibration requirements without suffering metal fatigue or other failure.  Extra care should be utilized in the attachment of the ends of bonding straps to prevent arcing or  other means of electrical noise generation with movements of the strap.            (2) [EBR 71] The cross-sectional area of any individual jumper shall not be less than  number 12 American Wire Gauge (AWG) wire (6530 circular mils) for stranded  copper, and not less than number 10 AWG wire (10,380 circular mils) for  stranded aluminum.    (3) [EBR 72] Where the jumper is subject to arcing, a minimum of number 7 AWG  (20,820 circular mils) for copper or number 5 AWG (33,100 circular mils) for  aluminum for each jumper shall apply.                                 f the bond application is approved by the procuring agency, fasteners (e.g., bolts, nuts, or studs)  may be used to meet bonding requirements. Fasteners should be primarily used to maintain  pressure on faying surfaces. However, in some cases fasteners may perform better than straps  for Class L and R applications. The inductance of multiple bolts between otherwise isolated  materials may be less than the inductance of a strap between surfaces.   performed showing that the number of bolts used in the path is sufficient to provide a low  impedance path.        . [EBR 78] For Class L applications, multiple rivets, bolts, or other fasteners shall be  used at joints in vehicle skin and structure to ensure multiple metallic contact areas capable of  sharing lightning current.         NASA-STD-6012, Corrosion Protection for Space Flight Hardware, and NASA-STD-6016,  Standard Materials and Processes Requirements for Spacecraft.    (1) Self-tapping screws.  (2) Zinc-plated bolts, nuts, or screws.  (3) Star, anodized, or zinc-plated washers.  (4) Cadmium-plated hardware.                blowing, vacuuming, or wiping with appropriate solvent as necessary to remove dust or other  foreign particles before mating.  Non-hardening sealant or thermal grease may be applied to the faying surfaces of semi-  permanent joints if tests indicate bonding requirements can be met after assembly.   If the bond is permanent, a hardening sealant, such as chromated epoxy primer, may be used if  tests indicate bonding requirements can be met after assembly.     impairs the effectiveness of any electrical bond and weakens the structure in which it occurs.  When choosing materials for a given electrical bonding application, major factors that  contribute to corrosion are the degree of separation of metals in the galvanic series and the  amount of moisture present.       mating surfaces to expose the graphite layer. Electrical bonds between CFRP sheets can be  made by overlapping exposed graphite on both sheets. Conductive epoxy may also be placed on  the exposed graphite, and bonding connections may be made to metallic surfaces through the  conductive epoxy.   arbon fiber reinforced plastic (CFRP) provides some conductivity through the graphite  filaments. However, the graphite is usually covered with nonconductive epoxy or phenolic  material.                           ome requirements should be verified at the equipment level, such as bonding of equipment  assembly interfaces and connector backshell contacts.   measurement may be an option. Controls need to be implemented in shield termination paths  through connector assemblies. A realistic value would be on the order of 10 milliohms from the  shield to the electronics enclosure for a cadmium-plated aluminum assembly, with 2.5 milliohms  maximum for any particular joint.            . [EBR 94] For flight vehicle surfaces that have been treated with conductive coatings  (4.1.6.b.1), test or analysis shall show that the bonding requirements are met.        (1) [EBR 95] Relaxation of this requirement shall only be granted if it has been  clearly verified by test or analysis that electrostatic charges deposited on the  surface of the vehicle will not be hazardous to the flight vehicle or the launch  mission.               h. [EBR 96] If flight vehicle surface conductivity requirements are imposed (4.1.6.b.2),  the flight vehicle surface material resistivity requirements shall be verified through test or  analysis.  (1) [EBR 97] Relaxation of this requirement shall only be granted if it has been  clearly verified by test or analysis that electrostatic charges deposited on the  surface of the vehicle, caused by triboelectrification from precipitation particle  impact, will not be hazardous to the flight vehicle or the launch mission.                 requirements by programs and projects. (Note: Enter “Yes” to describe the requirement’s applicability to the program or project; or  enter “No” if the intent is to tailor, and enter how tailoring is to be applied in the “Rationale” column.)    Applicable  (Yes or  No)  If No, Enter  Rationale            4.1.1  4.1.2   Applicable  Documents  Applicable  Documents  Order of Precedence   Assembly Drawings  Power Current Return  Path (Class C)  Bond Joints    [EBR 1] Tailoring of this NASA Technical Standard for application to a specific program or project  shall be formally documented as part of program or project requirements and approved by the  responsible Technical Authority in accordance with NPR 7120.5, NASA Space Flight Program and  Project Management Requirements.  [EBR 2] The latest issuances of cited documents shall apply unless specific versions are designated.  [EBR 3] Non-use of specifically designated versions shall be approved by the responsible Technical  Authority.  [EBR 4] Conflicts between this NASA Technical Standard and other requirements documents shall  be resolved by the responsible Technical Authority.  [EBR 5] There may be more than one purpose for bonding a specific interface, and the bond shall  meet the requirements of each applicable class.  [EBR 6] Notes shall be provided on assembly drawings indicating the applicable class or classes.  [EBR 7] All circuits and systems that use vehicle structure for a power return path shall satisfy  Class C bonding requirements.  [EBR 8] The total voltage drop across all electrical bond joints between the power supply and the  load shall be controlled to keep the voltage within the tolerance of the applicable power quality  standard.  [EBR 9] If no power quality standard is applicable, a default voltage drop value of 3.5 percent of  the operating bus voltage shall be used.                                                  Applicable  (Yes or  No)  If No, Enter  Rationale       4.1.2.2  4.1.2.3a              Magnesium Alloy  Hazardous Area  Bonding  Hazardous Area  Bonding  Pipe, Tubing, and  Hoses  Shock and Fault  Protection (Class H)  Shock and Fault  Protection (Class H)  Shock and Fault  Protection (Class H)  Shock and Fault  Protection (Class H)  Hazardous Area  Bonding  Hazardous Area  Bonding  Electromagnetic  Interference or Radio  Frequency (Class R)  Electromagnetic  Interference or Radio  Frequency (Class R)  Electromagnetic  Interference or Radio  Frequency (Class R)  Electromagnetic  Interference or Radio  Frequency (Class R)  [EBR 10] Magnesium alloy structure shall not be used as an intentional current return path.  [EBR 11] Electrical bonding of equipment or vehicle structure in areas where flammable materials,  gases, or vapors may be present shall be adequate to prevent ignition due to heating, sparking, or  arcing.  [EBR 12] The resistance of bond joints in hazardous areas shall not exceed the Maximum  Allowable Resistance curve shown in figure 1, Fault Current vs. Maximum Allowed Bonding  Resistance in the Presence of Flammable Vapors or Liquids.  [EBR 13] Pipes, tubing, and hoses shall not be used as an intentional return path for electrical  current.  [EBR 14] Exposed cases or chassis of electrical or electronic equipment shall be bonded to  structure with a resistance of 0.1 ohm or less using the methods described in section 5.1.  [EBR 15] Metallic conduit, cable trays, and other conductive objects susceptible to short circuits  shall have a resistance to structure of 0.1 ohm or less.  [EBR 16] For personnel and fire safety, the fault current return path shall be capable of conducting  a minimum of 500 percent overload current for a time period of 0.5 second.  [EBR 17] Magnesium alloy structure shall not be used as a primary fault current return path.  [EBR 18] Electrical bonding of equipment or vehicle structure in areas where flammable materials,  gases, or vapors may be present shall be adequate to prevent ignition due to conditions including  heating, sparking, or arcing.  [EBR 19] The resistance of bond joints in such areas shall not exceed the Maximum Allowable  Resistance curve shown in figure 1.  [EBR 20] All electrical and electronic equipment shall be bonded using the methods described in  section 5.1 to provide a low impedance path from the equipment enclosure to structure.  [EBR 21] All Class R bond paths to structure, and the joints in that path, shall be designed such that  the inductance and overall impedance, including resonances, are low enough to prevent interference  at the frequencies of interest.  [EBR 22] The direct current (dc) resistance across each joint in the path shall not exceed 2.5  milliohms.  [EBR 23] The design and construction of the outer mold line of the vehicle shall implement Class R  electrical bonding between all outer mold line components so as to inherently provide a uniform  low impedance enclosure surrounding the vehicle.                                                                  Applicable  (Yes or  No)  If No, Enter  Rationale                   Electromagnetic  Interference or Radio  Frequency (Class R)  Electromagnetic  Interference or Radio  Frequency (Class R)  Electrical Connectors  and Shield  Termination  Electrical Connectors  and Shield  Termination  Antennas  Lightning Protection  (Class L)  Lightning Protection  (Class L)  Lightning Protection  (Class L)  Lightning Protection  (Class L)  Lightning Protection  (Class L)  Lightning Protection  (Class L)  Lightning Protection  (Class L)  [EBR 24] Hatches, access panels, doors, and other apertures in outer mold line components shall  have at minimum a Class R electrical bond to the outer mold line material.  [EBR 25] Vehicle structural elements shall have a Class R electrical bond between elements, as  well as between structural elements and outer mold line components, so that the entire structure of  the vehicle is interconnected with uniform low impedance.  [EBR 26] Electrical connectors and their backshells that may be used to terminate cable shields  shall be installed to provide a low impedance path from the backshell to the equipment case.  [EBR 27] The dc resistance for each joint in the backshell-to-case path shall not exceed 2.5  milliohms.  [EBR 28] Antennas that require low impedance to the ground plane for proper operation shall meet  Class R requirements.  [EBR 29] To distribute the current around the vehicle and minimize the currents near possible entry  points into the vehicle and near critical areas and systems (including pyrotechnic systems, rockets  motors, fuel handling and storage areas, antennas, electronic equipment, and signal and power  cables), multiple low impedance paths shall be incorporated across and through vehicle outer mold  line and structural components.  [EBR 30] The dc resistance of all such joints shall be no greater than 2.5 milliohms.  [EBR 31] Each electrical bond shall be bonded using the methods described in section 5.1, have  low resistance and adequate contact area to carry its share of lightning current without sustaining a  burning, melting, distorting, or other heating effect due to the long duration, high-current portion of  the lightning strike.  [EBR 32] The bonds shall have low impedance to prevent arcing and coupling of voltage spikes into  electronic circuits due to the fast rise time portion of the lightning strike.  [EBR 33] The dc resistance of all joints and connections from hatches, access panels, doors, and  other apertures in outer mold line components (expected to carry high amplitude lightning currents)  shall be no greater than 2.5 milliohms.  [EBR 34] Shield terminations, connectors, or connector backshells of electrical cables that are in  the lightning current path, shall be capable of carrying expected lightning currents without damage.  [EBR 35] The dc resistance of each such shield termination shall not exceed 2.5 milliohms.                                                          Applicable  (Yes or  No)  If No, Enter  Rationale        Lightning Protection  (Class L)         Lightning Protection  (Class L)  Lightning Protection  (Class L)  Hazardous Area  Bonding  Hazardous Area  Bonding  Electrostatic  Discharge (Class S)  Electrostatic  Discharge (Class S)  Electrostatic  Discharge (Class S)    Electrostatic  Discharge (Class S)  Multilayer Insulation  Multilayer Insulation  4.1.6.1a(1)  4.1.6.1a(1)A Multilayer Insulation  4.1.6.1a(1)B Multilayer Insulation  4.1.6.1a(1)C Multilayer Insulation  Multilayer Insulation  4.1.6.1b  [EBR 36] All paths shall be designed using zoning information developed in  accordance with SAE-ARP-5414, Aircraft Lightning Zoning, supplemented by analysis employing  lightning current waveforms defined in SAE-ARP-5412, Aircraft Lightning Environment and Related  Test Waveforms.  [EBR 37] The voltage developed across any joint in the lightning current path shall not exceed 500  volts.  [EBR 38] Each bond in the lightning current path shall be capable of carrying expected lightning  current.  [EBR 39] Fuel and pyrotechnics shall be completely enclosed by a Faraday cage of conductive  material bonded to structure.  [EBR 40] Pyrotechnics cables and device connector shields shall have 360-degree bonded  termination to the metal enclosure/backshell.  [EBR 41] All conducting items, except active antenna elements, having any linear dimension  greater than 7.6 centimeters (cm), which are subject to precipitation static effects, triboelectric  effects, fluid flow, air flow, space and launch vehicle charging, separation of elements, and other  charge generating mechanisms, shall have a mechanically secure electrical bond path to vehicle  structure using the methods described in section 5.1.  [EBR 42] The resistance across the connection shall be 1.0 ohm or less.  [EBR 43] When performing an analysis to determine acceptable values for Class S electrical bonds,  the stored energy determined by the analysis shall be less than applicable hazard threshold levels  for personnel shock, equipment upset, flammable materials, gases, or vapors, or electro-explosive  device (EED) ignition for approval of the proposed electrical bond resistance.  [EBR 44] All conductive coatings, including those used to treat dielectric surfaces, shall be  electrically bonded to the vehicle structure with a dc resistance of less than 105 ohms.  [EBR 45] All conductive layers of multilayer insulation with an area greater than 100 square cm  shall be electrically bonded together.  [EBR 46] Provisions shall be made for attachment to the vehicle structure.  [EBR 47] The conductive attach points shall be bonded directly to the structure using the methods  described in section 5.1.  [EBR 48] Two attach points to the structure per blanket shall be used for redundancy.  [EBR 49] Resistance from attach points to the structure shall be 1.0 ohm or less.  [EBR 50] Multilayer insulation with an area greater than 100 square cm shall have a minimum of  one bond connection to the vehicle structure.                                                                           Applicable  (Yes or  No)  If No, Enter  Rationale                    Hazardous Area  Bonding  Hazardous Area  Bonding  Hazardous Area  Bonding  Hazardous Area  Bonding  Pipe, Tubing, and  Hoses  Pipe, Tubing, and  Hoses  Pipe, Tubing, and  Hoses  Metal-to-Metal  (faying surface to  faying surface)  Metal-to-Metal  (faying surface to  faying surface)  Bond Straps    [EBR 51] Multilayer insulation with an area greater than 1,000 square cm shall have a minimum of  two bond connections to the vehicle structure.  [EBR 52] A minimum of one additional bond connection to the vehicle structure shall be made for  each increase of 40,000 square cm.  [EBR 53] Multilayer insulation consisting of two or more sections shall have all sections  electrically bonded to each other.  [EBR 54] The contiguous insulation thus formed shall be considered as one section of insulation for  determination of the number of bond tabs.  [EBR 55] All conductive items in areas where flammable materials, gases, or vapors may be present  shall have a Class S electrical bond not to exceed 1.0 ohm.  [EBR 56] In no case shall any such electrical bond be inadequate to prevent ignition due to heating  or arcing.  [EBR 57] Specific Class S electrical bond values in hazardous areas shall be determined through  performance of a detailed analysis to determine the amount of stored energy on the item to be  bonded as a function of the proposed electrical bond resistance.  [EBR 58] The stored energy determined by the analysis shall be 1/10 of applicable minimum  ignition energy (MIE) (or 20 decibels (dB) below) threshold level for the flammable materials,  gases, or vapors that may be present.  [EBR 59] All metallic pipes, tubes, and hoses that carry fluids shall have a mechanically secure  connection to the structure that will measure 1.0 ohm or less.  [EBR 60] Nonmetallic plumbing installations shall be designed so that the static voltage, generated  by fluid flow, will not exceed 350 volts at any point outside the pipes, tubes, or hoses.  [EBR 61] The resistance of nonmetallic hoses shall not exceed 1.0 megohm per meter of length to  dissipate charges developing within the fluid or between fluid and the hose.  [EBR 62] Semi-permanent joints held together by screws, rivets, clamps, etc., shall have their  faying surfaces prepared prior to assembly in accordance with paragraph 5.2 to ensure a good  electrical bond.  [EBR 63] Clamping pressure across semi-permanent joints shall be in accordance with applicable  mechanical engineering assembly and installation requirements.  [EBR 64] Bonding straps installed across shock mounts or other suspension or support devices shall  not impede the performance of the mounting device.  [EBR 65] The bond straps shall be capable of withstanding the anticipated motion and vibration  requirements without suffering metal fatigue or other failure.                                                                      Applicable  (Yes or  No)  If No, Enter  Rationale       5.1.2b  5.1.2b(1)  5.1.2b(2)  Bond Straps  Bond Straps  Bond Straps            5.1.2c(5)  5.1.3a  Bond Straps  Fasteners  5.1.3b  5.1.3c  Fasteners  Fasteners  [EBR 66] For Class R bonds, the bonding straps shall be as short as possible.  [EBR 67] The bond straps shall be flat in cross-section.  [EBR 68] The bond straps shall have a length-to-width ratio of less than 5 to 1 to minimize the  inductance of the strap.  [EBR 69] For Class L application of bond straps, the bond straps or jumpers shall be as short as  possible.  [EBR 70] The bond straps shall have adequate lug contact area and adequate wire/lug cross-  sectional area to carry the lightning current.  [EBR 71] The cross-sectional area of any individual jumper shall not be less than number 12  American Wire Gauge (AWG) wire (6530 circular mils) for stranded copper, and not less than  number 10 AWG wire (10,380 circular mils) for stranded aluminum.  [EBR 72] Where the jumper is subject to arcing, a minimum of number 7 AWG (20,820 circular  mils) for copper or number 5 AWG (33,100 circular mils) for aluminum for each jumper shall  apply.  [EBR 73] The jumper shall be robust enough to withstand magnetic forces caused by the high  current through the strap.  [EBR 74] The jumper shall not rely on soldered connections to carry lightning current.  [EBR 75] When bolts are used as part of the bond path, an analysis shall be performed showing that  the number of bolts used in the path is sufficient to provide a low impedance path.  [EBR 76] Fasteners shall be sealed against moisture and air to prevent corrosion of the threads.  [EBR 77] The following are problematic and shall not be used for electrical bonding purposes:  (1) Self-tapping screws.  (2) Zinc-plated bolts, nuts, or screws.  (3) Star, anodized, or zinc-plated washers.  (4) Cadmium-plated hardware.      Surface Cleaning and  Finishing  Surface Cleaning and  Finishing  [EBR 78] For Class L applications, multiple rivets, bolts, or other fasteners shall be used at joints in  vehicle skin and structure to ensure multiple metallic contact areas capable of sharing lightning  current.  [EBR 79] The faying surfaces of all electrically bonded metal-to-metal joints shall be cleaned of all  nonconductive materials and protected against corrosion.  [EBR 80] The finishes and protection methods for faying surfaces shall be per NASA-STD-6012,  Corrosion Protection for Space Flight Hardware, and NASA-STD-6016, Standard Materials and  Processes Requirements for Spacecraft.                                                                      Applicable  (Yes or  No)  If No, Enter  Rationale               5.5b  5.5c  5.5d  5.5e    Surface Cleaning and  Finishing  Surface Cleaning and  Finishing  Surface Cleaning and  Finishing  Surface Cleaning and  Finishing  Galvanic Corrosion of  Dissimilar Materials  Carbon Fiber  Reinforced Plastic  Carbon Fiber  Reinforced Plastic  Verification  Verification  Verification  Verification  Verification          [EBR 81] The protection method or finish selected shall not negate the electrical bond between the  two surfaces.  [EBR 82] Treated mating surfaces shall be protected by packaging materials or protective films  until just prior to mating.  [EBR 83] After protective material is removed, the surfaces shall be cleaned by blowing,  vacuuming, or wiping with appropriate solvent as necessary to remove dust or other foreign  particles before mating.  [EBR 84] Surfaces that are expected to remain mated indefinitely shall be inspected periodically to  ensure a good electrical bond is maintained.  [EBR 85] Corrosion control of galvanic couples shall be in accordance with NASA-STD-6012 and  NASA-STD-6016.  [EBR 86] CFRP shall be bonded to control electrostatic discharge (ESD) and may be useful as an  RF bond.  [EBR 87] CFRP shall not be used in a Class C or Class H bond path.  [EBR 88] Verification of electrical bonding requirements shall be accomplished by a combination  of tests, similarity, analysis, and inspection.  [EBR 89] The extent of verification and the methods used shall be defined for each program.  [EBR 90] The resistance requirement of all classes of bonds shall be verified by testing sample  bonds.  [EBR 91] Spot checks shall be made to verify the process is still good and is being followed.  [EBR 92] The current carrying capability of Class C, H, and L bonds shall be verified by analysis  and inspection.  [EBR 93] Low inductance paths of Class R and Class L bonds shall be verified by analysis and  inspection.  [EBR 94] For flight vehicle surfaces that have been treated with conductive coatings (4.1.6.b.1), test  or analysis shall show that the bonding requirements are met.  [EBR 95] Relaxation of this requirement shall only be granted if it has been clearly verified by test  or analysis that electrostatic charges deposited on the surface of the vehicle will not be hazardous to  the flight vehicle or the launch mission.  [EBR 96] If flight vehicle surface conductivity requirements are imposed (4.1.6.b.2), the flight  vehicle surface material resistivity requirements shall be verified through test or analysis.  [EBR 97] Relaxation of this requirement shall only be granted if it has been clearly verified by test  or analysis that electrostatic charges deposited on the surface of the vehicle, caused by                                                                                   triboelectrification from precipitation particle impact, will not be hazardous to the flight vehicle or  the launch mission.  Applicable  (Yes or  No)  If No, Enter  Rationale               Fisher, Franklin A.; Plumer, Anderson J.; and Perala, Rodney A.  (1990). Lightning Protection of Aircraft. Pittsfield, MA: Lightning  Technologies, Inc. (LTI).  Terman, F. E. (1943). Radio Engineers’ Handbook. New York and  London: McGraw Hill Book Co., Inc.  AFSPCMAN 91-710  Volume 6  Range Safety User Requirements Manual Volume 6 – Ground and  Launch Personnel, Equipment, Systems, and Material Operations  Safety Requirements            Aerospace Systems Electrical Bonding and Grounding for  Electromagnetic Compatibility and Safety  requirements and to provide data for possible modifications or rationale for waivers to the  requirements.                                              ince a single bond may serve multiple purposes, electrical bonding is performed in accordance  with the requirements of the strictest applicable class or in some cases the strictest requirements  from more than one class. An example of electrical bonding for more than one purpose would be  a piece of electronic equipment powered from the system power supply. It would require Class R  bonding for RF and Class H bonding for fault current protection. Since both classes are  applicable, the bond should be low inductance with no more than 2.5 milliohms dc resistance for  Class R, and the contact area should be adequate to carry the maximum fault current that could  occur for Class H.  A nose cone should meet the lightning and static charge requirements. The Class L requirement  calls for low inductance, low resistance, and adequate area to carry lightning current. Since the  bond requirement for static charge is only moderately low resistance, the lightning bond will be  sufficient for both.  he only requirement for conductive tubing carrying fluid will be to meet the Class S  requirement. An electrical bond to basic structure of 1.0 ohm or less will be adequate.    ee paragraph 4.1.2 for applicable requirements. A dedicated power return is preferred over the  use of structure for power current return and will be stated as a requirement for most programs.  However, structure return is occasionally used for some systems such as small satellites.  n those cases where structure current is used, the voltage drop allowed divided by the maximum  current that may be delivered by the power supply will give the total resistance allowed in the  circuit. This total resistance includes the wire, its connectors, and all Class C electrical bond  joints in the structure return path. The resistance limit for each Class C electrical bond joint can  then be determined by subtracting the resistance of the wire and interconnections from the total  resistance, and dividing the remaining value by the number of Class C electrical bond joints in  the path.  between a power wire and a metallic equipment case or other conductive structure, should return  through structure and the joints in the structure to its source. Circuit protection devices are  intended to limit the duration of fault current events to prevent a significant temperature increase  in the circuit wiring. Typically, the fault current is considerably higher than the fuse or breaker  value, and it trips the device quickly. However, a circuit breaker can sometimes take several  seconds to trip with a current twice its rating. Resistance across all the joints in the return path  should be low enough to allow enough current to trip circuit protection devices in a timely  manner.                SAE-ARP-1870, Aerospace Systems Electrical Bonding and Grounding for Electromagnetic  Compatibility and Safety, restricts voltages on electronic equipment cases to less than 4.5 volts  and requires no fire or damage to the bond in the event of a short to case.  or shock protection from voltages exceeding 30 volts, MIL-HDBK-274, Military Handbook:  Electrical Grounding for Aircraft Safety, recommends a circuit breaker break time of 0.2 second.  tructural material that is not highly conductive, such as glass or graphite fiber reinforced plastic  (GFRP), may increase the path resistance enough to delay or prevent tripping the circuit breaker.  In addition to being a shock hazard, fault current can cause ignition of graphite epoxy material.   inductance of the strap is not a concern for fault current since the high current will be from a dc  or low frequency alternating current (ac) power source. Inductance will be a concern if the strap  conducts RF or lightning current.     equipment, but it is difficult to determine in advance which equipment really needs to be well  bonded. The low impedance to structure is necessary for certain power line to equipment chassis  filters and for proper operation of cable shields terminated to equipment chassis. Isolated  structural elements with linear dimensions approaching 1/4 wavelength, can pick up and re-  radiate RF from high power transmitters or develop enough voltage to produce a glow discharge  or arcing to other elements. This should be taken into account when sizing the length of straps or  jumpers used for Class R bonds, as such elements themselves can become a significant source of  interference under conditions described above.   metal-to-metal contact that can be expected to be consistent. The basic requirement is to have  low impedance at the frequency or frequencies of interest. The value of this impedance depends  upon the quality of the surface preparation (e.g., the chemical formulation used for the  conversion coating, and the thickness thereof), the area of the faying surfaces in contact, and the  amount of pressure holding the surfaces together. The impedance of an acceptable bond may be  in the ohms range for RF even though the dc resistance is less than 2.5 milliohms. The resistance  is overshadowed by the inductive reactance of the configuration.   reactance greater than 2.5 milliohms at frequencies above 10 megahertz (MHz). RF bonds may be  satisfactory with several ohms of impedance; but, when straps are used, even these levels will be  quickly exceeded as frequency increases. If the use of bond straps for RF bonds is unavoidable,  strap length should always be limited to a length to width ratio of 5 to 1.  onopole or half-loop antennas mounted on composite outer mold line surfaces should be  provided with circular or elliptical groundplanes or counterpoises 1/4 wavelength in radii over  the operating frequency range of the antenna, and should be installed with a low impedance         return path to vehicle structure that exhibits a dc resistance no greater than 2.5 milliohms, so that  antenna fields are not attenuated by poorly conductive composite material. Antennas mounted on  composite outer mold line surfaces that do not require local groundplanes or counterpoises but  that otherwise require a low impedance path to the vehicle structure for proper operation, should  be installed with a low impedance return path to the vehicle structure that exhibits a dc resistance  no greater than 2.5 milliohms. Antennas of all types, mounted on metallic outer mold line  surfaces, that require a low impedance path to the mounting surface for proper operation, should  provide a return path to vehicle structure that exhibits a dc resistance no greater than 2.5  milliohms.  he 2.5-milliohm dc resistance requirement is good for a standard, but one should not assume a  good RF bond exists just because the dc resistance is less than 2.5 milliohms. Also, extra effort  need not be made just to satisfy the dc requirement if the RF impedance is much higher due to  the inductance of the configuration. Look at the whole configuration to get the lowest impedance  possible at the frequencies of interest to produce a good RF bond.  he electrical bond path between an electronic box and the structure has a complex equivalent  circuit that may be simplified to a resistance in series with an inductance all in parallel with a  capacitance. The equivalent resistance includes the resistance of any bond strap present plus the  resistance of the joints in the path. At higher frequencies, where the diameter or thickness of the  strap significantly exceeds the skin depth, the ac resistance becomes larger than the dc resistance.  The ac resistance increases with the square root of frequency.  he inductance is directly proportional to the length of the bond path, but is also a function of  width and thickness. Multiple paths can reduce the inductance value by introducing additional  parallel current paths. The magnitude of inductive reactance increases 20 dB with every decade  of frequency increase.   he total impedance across the joint is equal to the resistance at frequencies from dc to the point  where the inductive reactance approaches the resistance. The impedance due to inductance then  increases at 20 dB per decade of frequency to a frequency where the inductive reactance and the  capacitive reactance are equal. At this parallel resonant frequency, the impedance may rise to  thousands of ohms depending on the ratio of reactance to resistance (Q) in the circuit. The Q is  high when the resistance is low, which is usually the case for a bonding joint. At frequencies  above this point, the capacitive reactance is less than the inductive reactance; and the total  impedance begins to come back down. Often there are more complex series and parallel  resonances; and, at the higher frequencies, the impedance may vary considerably.  inversely proportional to the distance between the box and the structure. The magnitude of  capacitive reactance decreases 20 dB per decade of frequency increase.             For electromagnetic interference (EMI) testing, the equipment under test (EUT) bonding method  to the copper-top test table will be as close as practicable to the flight configuration (i.e., bond  strap, surface mating, etc.). Only the provisions included in the design of the equipment and  specified in the installation instructions will be used to bond units, such as equipment case and  mount, together or to the ground plane. If the EUT is secured to mounting bases, incorporating  shock or vibration isolators, such mounting bases will be used in the test configuration. Bonding  straps furnished with the mounting base will be connected to the ground plane. Where mounting  bases do not incorporate bonding straps, bonding straps will not be used in the test setup. If  installation conditions for the EUT are unknown, the EUT will not be grounded. Portable  equipment should be tested while bonded to the ground plane and also while not bonded to the  ground plane.   ee paragraph 4.1.5 for applicable requirements. Electrical bonding in itself does not ensure  lightning protection, but it is a major part of the overall plan. Lightning current usually enters  one extremity of the vehicle and exits at another extremity. Lightning current is high and  voltages developed across joints are high enough to arc and provide a path to some exit point. A  good current path should be provided around the outside of the vehicle to help protect internal  equipment. Electrical bonding helps provide the proper continuity for the path.  Even when a large current path is provided to carry the current, attach points across joints still  may present a problem. Arcing at joints can be expected even with good electrical bonds.  Lightning current waveforms, as defined in SAE-ARP-5412, have rates of rise of 1 x 1011  amps/second. Considering a bond connection with inductance of 0.1 H would result in a  voltage spike across the joint of 10,000 volts. The arc produces an ionized path that helps carry  the current. The majority of the current can be kept external to the vehicle through good  electrical bonding of the vehicle skin.   resistance are kept as low as possible. The strap and connections should be robust enough to  survive the high lightning current and the magnetic forces resulting from high lightning current.  Straps should not have loops or bends greater than 45 degrees to avoid damage from magnetic  forces. Information concerning lightning bonds may be found in “Lightning Protection of  Aircraft” by Lightning Technologies, Inc.  pertures should be kept as small as possible. Joints should be bonded in many places to prevent  long slots between bonds. Joints and apertures in the skin allow some voltage to be induced into  underlying cables. This voltage should be kept low enough to prevent disrupting electronic  equipment.  pecial care should be taken to route current around fuel or pyrotechnics to prevent arcs that  can ignite fuel or current that can fire pyrotechnics. Fuel and pyrotechnics should be completely  enclosed by a Faraday cage of conductive material bonded to structure to provide an adequate  margin against ignition. Wires to pyrotechnics should be shielded and the shields should have  360 degrees terminations to the metal enclosure.          lower charged object affects the rate of discharge for an item being charged. A low resistance  reduces the charge faster, but bonds with resistances that would be considered high, such as 10  kilohms to 100 kilohms, usually function adequately. The charging current, usually in  microamps, returning through the resistance to ground determines the voltage developed.  lectrostatic charges should be controlled and dissipated to avoid fuel ignition and ordnance  hazards, to protect personnel from shock hazards, and to prevent performance degradation or  damage to electronics. A requirement for 1.0 ohm or less to ground is a good requirement for  metal items because any good metal-to-metal connection will measure less than 1.0 ohm. Under  some circumstances, such as when semiconductive materials or complex configurations are used,  this limit may be increased. Metal straps or jumpers across joints are adequate since the current  is dc.  n arc discharge can cause direct effects to the item being discharged and to the item receiving  the discharge. Indirect effects may be caused by voltages induced into neighboring items. Direct  or indirect effects include physical damage to an item, upset of operation, ignition, or shock to  personnel.  ngineering guidelines and design practices to minimize the effects of spacecraft surface and  internal charging in space environments is given in NASA-HDBK-4002A, Mitigating In-Space  Charging Effects – A Guideline. It serves as a reference source that contains suggested detailed  spacecraft design requirements and procedures to minimize the effects of spacecraft charging and  to limit the effects of the resulting ESD. This Handbook is complementary to NASA-STD-4005,  Low Earth Orbit Spacecraft Charging Design Standard, and NASA-HDBK-4006, Low Earth  Orbit Spacecraft Charging Design Handbook. NASA-STD-4005 and NASA-HDBK-4006  address Low Earth Orbit spacecraft charging at the auroral zones (attitude from 200 and 1000 km  and latitude between -50 and +50 degrees).  aunch service providers, such as the Eastern Test Range (ETR), may impose additional  requirements on the flight vehicles that launch from their range. The ETR levies a surface  conductivity requirement on flight vehicles to protect from triboelectrification effects. Air Force  specification, AFSPCMAN91-710V6, Range Safety User Requirements Manual Volume 6 –  Ground and Launch Personnel, Equipment, Systems, and Material Operations Safety  Requirements, contains the following triboelectrification requirements:    “A7.2.5.4.10. Triboelectrification. Do not launch if a vehicle has not been treated for  surface electrification and the flight path will go through any clouds above the –10 °C  level up to the altitude at which the vehicle’s velocity exceeds 3,000 ft/sec. A vehicle is  considered “treated” for surface electrification if:               “A7.2.5.4.10.1. All surfaces of the vehicle susceptible to precipitation particle  impact have been treated to assure    “A7.2.5.4.10.1.2. That all conductors on surface (including dielectric  surfaces that have been treated with conductive coatings) are bonded to  the vehicle by a resistance that is less than 105ohms;   “A7.2.5.4.10.2. It has been shown by test or analysis that electrostatic discharges  (ESDs) on the surface of the vehicle caused by triboelectrification by ice particle  impact will not be hazardous to the launch vehicle or the mission. In  A7.2.5.4.10.1.1 above, the correct unit for surface resistivity is ohms/square. This  means that any square area of any size measured in any units has the same  resistance in ohms when the measurement is made from an electrode extending  the length of one side of the square to an electrode extending the length of the  opposite side of the square. The area-independence is literally valid only for  squares; it is not true for other shapes such as rectangles and circles.”  In summary, bonding for electrostatic charge should use the 1.0-ohm requirement for ordinary  metal joints to ensure a good connection. The 1.0-ohm requirement simply ensures the metal-to-  metal bond is a clean, quality bond that will retain its conductivity. Good connections that  measure up to 100 kilohms from equipment to ground for unusual configurations or  semiconductive materials may be acceptable. Jumpers and straps may be used.     Two materials may be placed in direct contact if the electromotive force (EMF) difference  between their groups is not more than 0.25 volts. Where other dissimilar materials are placed in  contact, galvanic reaction may cause corrosion of the material that is higher (more anodic) in the  galvanic series. Corrosion impedes current flow and damages materials. When two materials  form a couple that is incompatible, the materials should be plated, coated, or otherwise protected  with a conductive finish compatible with each; or a material compatible with each should be  inserted between the two materials.  If the mating of dissimilar materials cannot be avoided, the most active of the materials should  be replaceable in reusable vehicles. In all applications the electrolyte contact area of the most  anodic materials, higher in series, should be larger than that of the cathodic materials. The larger                           the anodic area the lower the current density will be on more cathodic-materials. An approved  sealant should be used to seal all edges from moisture.    tubing provides a charging source. If the fluid is not conductive, it can carry charges to  conductive items in the fluid path. Conductive items in the fluid flow path should be bonded to  structure to prevent a static charge buildup.   Conductive hose or tubing grounded to structure will help prevent charging. Conductive fluids  can also prevent the charge separation. With a nonconductive fluid in nonconductive tubing, the  charge may transfer to conductive items in the line or, if enough potential develops, a discharge  may occur through an arc from the fluid through the tubing to a metal sheath or other conductive  items outside the tubing. This arc may produce small holes in the tubing.  Tubing is available that is somewhat conductive and prevents the separation and movement of  the charge if its resistivity is less than 1 megohm per meter of length. Fluids with volume  resistivity less than 107 ohm-meters are conductive enough to prevent the separation of charge,  but there is seldom a choice of fluids.    could be a problem. CFRP, or composite materials that contain metal particles, could be  conductive enough to drain off static charges if given a conductive path from the material to  metallic structure. See paragraph 5.4 for applicable CFRP requirements when using materials,  such as honeycomb graphite panels.   ince these composite materials are relatively poor conductors, they should not be used to carry  high current. The resistance would cause excessive voltage drop for intentional power return, and  short circuit current may be limited to levels too low to trigger circuit protection devices.  CFRP may be used as RF ground even though its dc resistance may exceed the usual Class R  limits. If the resistance through the composite structure can be kept to a few ohms, the total  impedance to RF will depend upon the inductance of the configuration just as it would with metal.  Special attention should be given to bonding across joints in composite materials. The graphite  layers are conductive, but epoxy, phenolic, isocyanate, polyimide, or other polymeric resin may  cover the surface of the composite. This nonconductive outer layer should be removed to expose  the graphite so conductive connections may be made at joints. If the bond is for RF purposes, do  not depend on narrow straps. The connection should be continuous along edges that have been  abraded to expose graphite. Connection may be made by overlapping panels or by adding a  conductive bridge secured by metal fasteners or by conductive adhesive across the joint.                   he conductive layers of multilayer insulation may be bonded together at several points using  accordion-shaped metal foil fitted into the edges of the conductive layers so that each conductive  layer contacts the foil. A rivet or bolt through the layers and the foil will assure contact and will  provide a point for attachment to structure. Good conductivity should be verified by test.   required nor desirable unless specifically noted by the procuring agency. Usually tests of certain  processes can verify that the process will result in a satisfactory bond. Other bonds using the  same process can be verified by similarity. Verification that the same process was used on each  bond should be adequate. Testing to verify resistance limits may be required depending upon the  criticality of the equipment and the purpose of the bond as determined by the specific project.  For example, all antenna installations and all electronic equipment may be required to be tested  for resistance to structure, but the low impedance and current carrying requirements will still be  verified by inspection and analysis.     resistance requirements. These processes should also be called out on fabrication drawings and  verified by quality.   bond required. For Class C, H, and L, the bond should have enough contact area to carry the  intentional, fault, or lightning current. Class L bonds should also be robust enough to withstand  the magnetic effects of the large current being carried, if they are to be useful for more than one  strike. These requirements are typically verified by analysis and inspection of the drawings and  the installation.   made to determine the impedance of any RF bond other than direct metal-to-metal contact over a  large surface area.  he effectiveness of a direct bond is dependent upon the clamping pressure. A maintenance  program should be put in place to verify these bonds still meet the requirements throughout the  life cycle of the system.  n short, bonding should be verified by analysis, some tests of actual bonds, and tests of samples  of a process, inspection of physical bonds and processes, and similarity to other good bonds. An  electrical bonding path diagram may aid in verification of the complete bonding path. An  example of a bonding path diagram is shown in figure 2, Electrical Bonding Path Diagram  Example. It is not required to use the same symbols or even the same structure.                             "}