{"pdf_text_combined": "   NASA-HDBK-6025  w/CHANGE 1:  REVALIDATED  w/ADMINISTRATIVE/  EDITORIAL CHANGES  2017-04-28  Approved: 2014-04-24  Superseding NASA-HDBK-6025  GUIDELINES FOR THE SPECIFICATION AND CERTIFICATION OF  TITANIUM ALLOYS FOR NASA FLIGHT APPLICATIONS                             Document  Revision  Change  Number     2014-04-24  2017-04-28  Initial Release  Revalidated w/Administrative/ Editorial  Changes—This NASA Technical  Handbook was reviewed and no  technical changes resulted.  Administrative/editorial changes were  made to conform to the current NASA  Technical Handbook template.                    This NASA Technical Handbook is published by the National Aeronautics and Space  Administration (NASA) as a guidance document to provide engineering information; lessons  learned; possible options to address technical issues; classification of similar items, materials, or  processes; interpretive direction and techniques; and any other type of guidance information that  may help the Government or its contractors in the design, construction, selection, management,  support, or operation of systems, products, processes, or services.  his NASA Technical Handbook is approved for use by NASA Headquarters and NASA  Centers and Facilities. It may also apply to the Jet Propulsion Laboratory, other contractors,  recipients of grants and cooperative agreements, and parties to other agreements only to the  extent specified or referenced in applicable contracts, grants, or agreements.  his NASA Technical Handbook establishes guidelines for specifying and certifying wrought  titanium (Ti) alloys for use on NASA Flight Projects for organizations buying such materials.      his NASA Technical Handbook does not cover commercially pure Ti since it is not considered  a nonconforming issue because of its lack of sensitivity to heat treating and thermo-mechanical  processing.  supply chain. It recommends the involvement of certain technical disciplines to ascertain  whether there is nonconformance and also approaches to monitor and assure compliance of  procured materials with the relevant procurement specifications. As of the date of publication of  this NASA Technical Handbook, there is no known evidence of nonconforming Ti alloy issues  with foreign sources. The same guideline procedures described in this NASA Technical  Handbook should be used for foreign Ti alloy sources and foreign contractors. Ti alloys can be  procured from a foreign source by a United States (U.S.) or foreign entity associated with a  NASA program. The basic issues addressed in this NASA Technical Handbook apply whether  the Ti alloy is of U.S. or foreign source.  timeframe of 2008-2010, significant issues (and incurred costs) were encountered through the  investigations of multiple Government agencies with respect to nonconforming Ti alloys. Note:  the exclusion of other metals in this document is not meant to indicate that no problems can or                 will occur with other metals. Organizations procuring other metallic and nonmetallic materials  for flight applications should use due diligence to ensure such materials meet the requirements  for specifications used in the procurement process.  his NASA Technical Handbook focuses on product forms referred to as sheet, strip, plate,  forging, and bar, i.e., forms covered by the American Materials Specifications (AMSs) that  supersede MIL-T-9046, Titanium and Titanium Alloy, Sheet, Strip, and Plate, and MIL-T-9047,  Titanium and Titanium Alloy, Bars (Rolled or Forged) and Reforging Stock, Aircraft Quality,  and that are primarily related to the nonconforming Ti alloy issue. The other AMS specifications  covering product forms such as tubing, casting, extruded parts, or fasteners are not implicated in  the nonconforming Ti alloy issue.  equests for information should be submitted via “Feedback” at https://standards.nasa.gov.  Requests for changes to this NASA Technical Handbook should be submitted via MSFC Form  4657, Change Request for a NASA Engineering Standard.   Ralph R. Roe, Jr.  NASA Chief Engineer                     2   3   5   6   7   7   8   8   8   8   9   9   10   13   13   13   16   20   20   20   23   24   24   27   29   30   30   31   31   32   32   35   37   37  DOCUMENT HISTORY LOG .........................................................................................  FOREWORD ......................................................................................................................  TABLE OF CONTENTS ...................................................................................................  LIST OF APPENDICES ...................................................................................................  LIST OF FIGURES ...........................................................................................................  LIST OF TABLES .............................................................................................................  1.  1.1  1.2  2.  2.1  2.2  2.3  2.4  3.  3.1  3.2  4.  4.1  4.2  4.2.1   4.2.3  4.3  4.4  4.5  5.  5.1  5.2  5.3  5.3.1  5.3.2  5.3.3  5.4  5.5  SCOPE ................................................................................................................  Purpose .................................................................................................................  Applicability ........................................................................................................  APPLICABLE DOCUMENTS .........................................................................  General .................................................................................................................  Government Documents ......................................................................................  Non-Government Documents ..............................................................................  Order of Precedence .............................................................................................  ACRONYMS AND DEFINITIONS .................................................................  Acronyms and Abbreviations ..............................................................................  Definitions ...........................................................................................................  GENERAL ..........................................................................................................  General .................................................................................................................  Specifications used to Procure Ti Alloys .............................................................  SAE AMS-T-9047 and Subsequent SAE AMS Specifications used to Procure  Alloys ...................................................................................................................  SAE AMS-T-9046 and Subsequent SAE AMS Specifications used to Procure  Ti Alloys ..............................................................................................................  Other Non-Government Specifications ...............................................................  How Wrought Ti Alloys are Produced and Processed and in What Shapes ........  How Ti Alloys can be Supplied to a NASA Organization or Contractor ............  How Ti Alloys are Certified for Compliance to Procurement Specification .......  NONCONFORMING TI ALLOYS .................................................................  Definition of Nonconforming Ti Alloys ..............................................................  How Nonconforming Ti Alloys can be Supplied ................................................  Key Mechanical Properties of Interest .................................................................  Nonconforming Ti Alloy Testing at AFRL .........................................................  Billet Characterization Testing at AFRL .............................................................  JPL Material Certificate of Conformance Assessment and Mechanical Testing  How to Recognize Suspect Nonconforming Material .........................................  Example of Suspect and Nonsuspect Material Certifications ..............................                              37   37   38  38   39   39   39   39   39   40   41   41   41   42   45   47   51   54   63   70    6.1  6.2  6.3  MITIGATING THE PROCUREMENT OF NONCONFORMING TI  ALLOYS .............................................................................................................  General .................................................................................................................  Thorough Review of Certification Data Package ................................................  Use of M&P Engineering and Quality Assurance  Disciplines ...........................................................................................................  Securing the Supply Chain ..................................................................................  6.4  Supply Chain Surveys and Audits .......................................................................  6.4.1  6.4.2  Quality Clauses Improvements ............................................................................  6.4.3 Material Specifications ........................................................................................  Certification Review ............................................................................................  6.4.4  Independent Material Testing ..............................................................................  6.4.5  Component-Level Subcontractor .........................................................................  6.5  Purchase Order Subcontractors ............................................................................  6.5.1  Subcontractors .....................................................................................................  6.5.2   A  B  C  D  E  F  G  H  Reference Documents and Military Specifications .............................................  Chronological History for Nonconforming Ti Alloy GIDEPs ............................  Screening of Ti Alloy Parts for In-Process Projects at JPL .................................  Example Suspect Material Certifications ............................................................  Example of an Acceptable (“Clean”) Certification Package ...............................  Raw Material Supplier Audit Checklist ...............................................................  Example Quality Clause Entitled “Raw Material Traceability” .........................  Mechanical Test Results in Material Certification versus In-House Test Data  for Ti-6Al-4V .......................................................................................................                                                 Fabrication Process of Wrought Ti Alloys ...........................................................  Specification Minimum Strength Sensitivity of Ti-6Al-4V Sheet, Strip, and  Plate as a Function of Heat Treatment, Thickness, and Interstitial Element  Level ....................................................................................................................  Tensile Yield Strength Results Comparing Independent Test Laboratory  Values of 876 MPa (127 ksi) and 889 MPa (129 ksi) (illustrated by two upper  blue lines) with JPL Internal Test Results Shown by Bars on Graph (minimum  specification test value = 825 MPa (120 ksi) shown by lower red line) ..............  Ultimate Tensile Strength Results Comparing Independent Test Laboratory  Values of 945 MPa (137 ksi) and 952 MPa (138 ksi) (illustrated by two upper  blue lines) with JPL Internal Test Results Shown by Bars on Graph (minimum  specification test value = 896 MPa (130 ksi) shown by lower red line) .............  Elongation Results Comparing Independent Test Laboratory Values of  14 percent and 13 percent (illustrated by two upper blue lines) with JPL  Internal Test Results Shown by Bars on Graph (minimum specification test  value = 10 percent shown by lower red line). .....................................................  Reduction of Area Results Comparing Independent Test Laboratory Values of  31 percent and 19 percent (illustrated by upper and lower blue lines) with JPL  Internal Test Results Shown by Bars on Graph (minimum specification test  value = 25 percent shown by middle red line). ....................................................  1  2             6  63  List of SAE AMS Specifications Superseding SAE AMS-T-9047  (MIL-T-9047) .......................................................................................................  List of SAE AMS Specifications Superseding SAE AMS-T-9046  (MIL-T-9046J, Amendment 2) .............................................................................  Summary of AFRL Tensile Property Data on Incompletely Processed  Ti Alloys in Annealed Condition (AFRL-RX-WP-TR-2012-0238) ....................  JPL Tensile Test Results Summary of Suspected Nonconforming Ti-6Al-4V in  Annealed Condition ..............................................................................................  JPL-Established Pseudo S-Basis Nonconforming Ti Alloy Minimum  Specification Values .............................................................................................  An Example Raw Material Supplier Audit Checklist ..........................................                               GUIDELINES FOR THE SPECIFICATION AND  CERTIFICATION OF TITANIUM ALLOYS FOR NASA FLIGHT  APPLICATIONS  processes that will help mitigate the procurement of nonconforming wrought titanium (Ti) alloys  for National Aeronautics and Space Administration (NASA) flight applications. These guidelines  may be tailored to the program applications to obtain the most cost-effective, best quality  product.   his NASA Technical Handbook is applicable to NASA Centers and NASA programs utilizing  wrought Ti alloys for flight hardware, mission-critical ground support equipment, and elements  thereof.  his NASA Technical Handbook is approved for use by NASA Headquarters and NASA  Centers and Facilities. It may also apply to the Jet Propulsion Laboratory (JPL) or to other  contractors, grant recipients, or parties to agreements only to the extent specified or referenced in  their contracts, grants, or agreements.  his NASA Technical Handbook, or portions thereof, may be referenced in contract, program,  and other Agency documents for guidance. When it contains procedural or process requirements,  they may be cited in contract, program, and other Agency documents.  specifications from various organizations and agencies, and the quoted material may contain  “shall” statements. These “shall” statements are not requirements levied by this NASA Technical  Handbook but by the quoted organization/agency and are included in this NASA Technical  Handbook as guidance/reference information only. The “shall” statements in section 2 of this  NASA Technical Handbook are NASA Technical Standard Program Office requirements  regarding use of documents applicable to this NASA Technical Handbook.                     Handbook. Government specifications were originally developed and subsequently transformed  from military specifications to non-Government standard documents, such as the Aerospace  Materials Specifications (AMSs) for Ti alloys commercially available now. These specifications  have documented processing requirements and well-established minimum property values for  various product forms.   completeness, the following two Ti alloys, Ti-6Al-4V and Ti-6Al-6V-2Sn, are the two primary  alloys of interest. Most of the investigations into potential nonconforming Ti alloys occurred in  the mid to late 2000s and were centered on these two alloys. United States Air Force (USAF)  investigations into nonconforming Ti alloys first addressed Ti-6Al-6V-2Sn and, subsequently in  the late 2000s, included Ti-6Al-4V. NASA investigations, predominately in the late 2000s,  focused on Ti-6Al-4V, as this alloy had the most flight applications by a large number. However,  the procedures and processes described in this document can be applied to other Ti alloys.  Commercially pure Ti is generally not considered an issue because of its lack of sensitivity to  heat treating and thermo-mechanical processing.    he two original military documents for Ti and Ti alloys (MIL-T-9046, Titanium and Titanium  Alloy, Sheet, Strip, and Plate, and MIL-T-9047, Titanium and Titanium Alloy, Bars (Rolled or  Forged) and Reforging Stock, Aircraft Quality) have been replaced by approximately 55 AMS  non-Government standards. ASTM International (ASTM, formerly the American Society for  Testing and Materials) specifications are not listed in this NASA Technical Handbook because  of a shortfall of aerospace quality procurement requirements. However, a Center could utilize  ASTM specifications for non-flight applications and/or add additional requirements to the  procurement documents for flight applications.  .1.1 The latest issuances of cited documents shall apply unless specific versions are  designated.  .1.2 Non-use of specifically designated versions shall be approved by the responsible  Technical Authority.      AFRL-RX-WP-TR-  2012-0238                   Metallic Materials Properties Development and Standardization  Handbook, December 27, 2012. Licensed exclusively to Battelle  Memorial Institute for distribution.  Report of the Titanium Working Group Concerning the  Assessment of Non-Conforming Material as it Affects JPL Flight  Projects     NASA-HDBK-  8739.18  Procedural Handbook for NASA Program and Project  Management of Problems, Nonconformances, and Anomalies        Standard Specification for Titanium and Titanium Alloy Bars and  Billets. (Table 4 specifically references ASTM B348-10; however,  all other references to ASTM B348 cite the latest issue of the  document.)     Standard Test Method for Determination of Hydrogen in Titanium  and Titanium Alloys by Inert Gas Fusion Thermal  Conductivity/Infrared Detection Method   Standard Test Method for Stress-Corrosion of Titanium Alloys by  Aircraft Engine Cleaning Materials    Aerospace Standard: Quality Management Systems –  Requirements for Aviation, Space and Defense Organizations                                                  Titanium Alloy, Sheet, Strip, and Plate 5Al – 2.5Sn, Extra Low  Interstitial Annealed      Titanium Alloy Sheet, Strip, and Plate 8Al – 1V – 1Mo Single  Annealed   Titanium Alloy Sheet, Strip, and Plate 8Al – 1Mo – 1V Duplex  Annealed   Titanium Alloy Sheet, Strip, and Plate 13.5V – 11Cr –  3.0Al Solution Heat Treated  SAE  AMS4918**    Titanium Alloy Sheet, Strip, and Plate 6Al – 2Sn – 4Zr – 2Mo –  0.08Si Duplex Annealed   Titanium Alloy Sheet, Strip, and Plate 3Al – 8V – 6Cr – 4Mo –  4Zr Solution Heat Treated  SAE  AMS4988**  Titanium Alloy Sheet, Strip, and Plate 6Al – 6V – 2Sn Solution  Heat Treated    SAE  AMS4990**  Titanium Alloy Sheet, Strip, and Plate 6Al – 6V – 2Sn Solution  Heat Treated and Aged  AE AMS Ti Alloy Specifications Superseding SAE AMS-T-9047, Titanium and  Titanium Alloy, Bars (Rolled or Forged) and Reforging Stock, Aircraft Quality  * Ti-6Al-4V material specifications  ** Ti-6Al-6V-2Sn material specifications                                                               Titanium Alloy Bars, Forgings and Forging Stock 5Al – 2.5Sn  Annealed   Titanium Alloy Bars, Forgings and Forging Stock 5Al –  2.5Sn, Extra Low Interstitial Annealed   Titanium Alloy Bars, Forgings and Forging Stock 6.0Al –  2.0Sn – 4.0Zr – 2.0Mo Duplex Annealed   Titanium Alloy Bars, Forgings and Forging Stock 6.0Al –  2.0Sn – 4.0Zr – 6.0Mo Solution Heat Treated and Aged   Titanium Alloy Bars, Forgings and Forging Stock 6.0Al –  2.0Sn – 4.0Zr – 6.0Mo Duplex Annealed   Titanium Alloy Bars, Forgings and Forging Stock 8Al – 1Mo  – 1V Duplex Annealed   Titanium Alloy Bars, Forgings and Forging Stock 7.0Al –  4.0Mo Annealed   Titanium Alloy Bars, Forgings and Forging Stock 3Al – 8V –  6Cr – 4Mo – 4Zr Solution Heat Treated   Titanium Alloy Bars, Forgings and Forging Stock 3Al – 8V –  6Cr – 4Mo – 4Zr Solution Heat Treated and Aged   Titanium Alloy Bars, Forgings and Forging Stock 13V – 11Cr  – 3Al Solution Heat Treated   Titanium Alloy Bars, Forgings and Forging Stock 13V – 11Cr  – 3Al Solution Heat Treated and Aged   Titanium Alloy Bars, Forgings and Forging Stock 6.0Al –  4.0V Solution Heat Treated and Aged   Titanium Alloy Bars, Forgings and Forging Stock 6.0Al –  4.0V Annealed   Titanium Alloy Bars, Forgings and Forging Stock 6.0Al –  4.0V Extra Low Interstitial Annealed   Titanium Alloy Bars, Forgings and Forging Stock 6.0Al –  6.0V – 2.0Sn Solution Heat Treated and Aged                                                                 Titanium Alloy Bars, Forgings and Forging Stock 6Al – 6V –  2Sn Annealed   Titanium Alloy Bars, Forgings and Forging Stock 3.0Al –  2.5V Annealed   Ti-6Al-4V material specifications  ** Ti-6Al-6V-2Sn material specifications    Titanium Alloy Bars, Wire, Forgings, Rings, and Drawn  Shapes 6Al – 4V Annealed    Clarification of Terms Used in Aerospace Metals  Specifications        .4.1 The guidance and standard practices established in this NASA Technical Handbook do  not supersede or waive existing guidance and standard practices found in other Agency  documentation.  .4.2 Conflicts between this NASA Technical Handbook and other documents are resolved by  the delegated Technical Authority.        α  =  <  ε-N  alpha  equal  less than  strain versus number of cycles fatigue curve                           %  √  °C  °F  AFRL  Al  AMS  ARP  AS  ASL  ASM   percent  square root  degree(s) Celsius  degree(s) Fahrenheit  Air Force Research Laboratory  aluminum  Aerospace Materials Specification  Aerospace Recommended Practice  Aerospace Standard  Approved Suppliers List  ASM International (formerly American Society for  Metals)  ASTM International (formerly American Society for  Testing and Materials)  Allegheny Technologies Incorporated  California  centimeter(s)  square centimeter(s)  certificate of conformance  certificate of test  chromium  fatigue crack growth rate  Defense Contract Management Agency  Department of Defense  Data Requirement Description  tensile elastic modulus  extra-low interstitial  ultimate shear strength  tensile ultimate strength  tensile yield strength  Government-Industry Data Exchange Program  gigapascal(s)  handbook  heat treatment  inch(es)  square inch(es)  International Organization for Standardization  Jet Propulsion Laboratory  fracture toughness  kip(s)/square inch  longitudinal direction  natural logarithm  meter(s)  Materials & Processes  military  ATI  CA  cm  cm2  C of C  COT  Cr  da/dN  DCMA  DoD  DRD  E  El elongation  ELI  Fsu  Ftu  Fty  GIDEP  Gpa  HDBK  HT  in  in2  ISO  JPL  KIc  ksi  L  ln  m  M&P  MIL       Metallic Materials Properties Development and  Standardization  millimeter(s)  square millimeter(s)  molybdenum  megapascal(s)  megapound(s) per square inch  minimum specification value  number of individual measurements  National Aerospace and Defense Contractors  Accreditation Program  National Aerospace Specification  National Aeronautics and Space Administration  nondestructive evaluation  Ohio  on-the-job training  parts per million  pound(s) per square inch  quality assurance  Qualified Suppliers List  quick reaction evaluation  reduction of area  reasonable lower bound  RTI International (formerly Research Triangle Institute)  stress versus number of cycles fatigue curve  Society of Automotive Engineers  stress corrosion cracking  Subcontract Data Requirements List  fatigue limit  Système International  silicon  tin  solution treated  solution treated and aged  transverse direction  titanium  Titanium Metals Corporation  United States  United States Air Force  ultrasonic testing  vanadium  zirconium   mm  mm2  Mo  MPa  Msi  MSV  n  Nadcap  NAS  NASA  NDE  OH  OJT  ppm  psi  QA  QSL  QRE  RA  RLB  RTI  S-N  SAE  SCC  SDRL  Sf  SI  Si  Sn  ST  STA  T  Ti  Timet  U.S.  USAF  UT  V  Zr        A-Basis: The lower of either a statistically calculated number or the specification  minimum (S-basis). The statistically calculated number indicates that at least 99 percent of the  population of values is expected to equal or exceed the A-basis mechanical design property,  with a confidence of 95 percent. (MMPDS-06 Handbook)   elevated temperatures after working or a heat treatment (natural or artificial aging) or after a  cold -working operation (strain aging). The change in properties is often, but not always,  related to a phase change (precipitation), but it never involves a change in chemical  composition. (Donachie, 2000)     a suitable temperature, followed by cooling at a suitable rate. It is used primarily to soften  metallic material but also to simultaneously produce desired changes in other properties or in  microstructure. The purpose of such changes may be, but is not confined to, improvement of  machinability, facilitation of cold work, improvement of mechanical or electrical properties,  relief of stresses, and/or increase in stability of dimensions. Specific process names in  commercial use are final annealing, full annealing, intermediate annealing, partial annealing,  recrystallization, annealing, stress-relief annealing, and annealing to temper. (Donachie, 2000)   materials but that have been subject to subsequent heat treatment. (SAE ARP1917,  Clarification of Terms Used in Aerospace Metals Specifications)   is greater than its cross section with a diameter of 12.7 mm (0.5 in) and over or distance  between parallel surfaces. (SAE ARP1917) Note: This definition is recommended for NASA  programs.  ar (definition 2): A product shall be processed to the final thickness/diameter by  metallurgical working operations prior to any straightening, dimensional sizing, or surface  finish operations. Bar shall not be cut from plate. (Information in accordance with SAE  AMS6931, Titanium Alloy Bars, Forgings and Forging Stock 6.0Al – 4.0V Annealed, section  3.3.1)                      designed strictly for production of bar stock to the procured thickness. Cut plate shall not be  supplied in lieu of bar. (Information in accordance with SAE AMS4928R, Titanium Alloy  Bars, Wire, Forgings, Rings, and Drawn Shapes 6Al – 4V Annealed, section 3.3.1)    product whose cross sectional area is equal to or less than 103.23 cm2 (16 in2); rectangular bar  must be less than or equal to 254 mm (10 in) in width and greater than 4.76 mm (0.1875 in) in  thickness. (ASTM B348, Standard Specification for Titanium and Titanium Alloy Bars and  Billets, section 3.1.1)   equipment. Bars are hot/cold finished to final dimensions and are not cut to achieve the  required thickness. The maximum cross-sectional size of Ti alloy bar is based on the alloy but  is no larger than 309.68 cm2 (48 in2). (An amalgam of SAE ARP1917, SAE AMS6931, and  SAE AMS-T-9047.)   commonly recognized industry quality standard for a particular alloy, surface condition,  product form, heat-treat condition, and, most importantly, the method of fabrication. This term  is no longer used in specifications since the standard can vary from mill to mill and product to  product and is subject to interpretation. (SAE ARP1917)      that is intended for subsequent hot working into finished or semi-finished products. (SAE ARP  1917) Note: This definition is recommended for NASA programs.    with a cross sectional area greater than 103.23 cm2 (16 in2) whose width is less than five times  its thickness. (ASTM B348, section 3.1.2)    that is performed at a temperature that is below the recrystallization temperature. (SAE  ARP1917)  meets standards and/or requirements specified within the applicable document. (SAE  ARP1917)        conversion, or forging house, that performs forging and/or hot rolling operations on the Ti  alloy ingot and that can produce intermediate products referred to as billets, slabs, or blocks.  The company may also further hot roll or forge intermediate products to fabricate end product  forms.  eat: All material identifiable to a single molten metal source. All material from a heat  is considered to have the same composition. A heat may yield one or more ingots. A heat may  be divided into several lots by subsequent processing. (MMPDS-06 Handbook)     in the interstices of the Ti lattice. Common examples are oxygen, nitrogen, hydrogen, and  carbon. Extra low interstitial (ELI) content can be specified.  time into the same size and shape of product, and heat treated as a single heat-treat lot. (SAE  ARP1917) Note: This definition is recommended for NASA programs.     Lot (definition 3): All product of the same nominal size from the same heat, processed  at the same time, and solution heat treated and annealed as a heat-treat batch. (SAE AMS4928,  section 4.3)   product type having the same thickness or configuration and fabricated as a unit under the  same condition. If the material is heat treated, a lot is the above processed through the required  heat-treated operations as a unit. (MMPDS–06 Handbook)     specification, including the description of ingot through billet to final product processing  history with all relevant mechanical and chemical testing identified with results, inspection  type and results, heat-treat certifications, procured metal size, and lot number.            echanical Properties: The properties of a material that reveal its elastic and inelastic  (plastic) behavior when force is applied, thereby indicating its suitability for mechanical (load-  bearing) applications. Examples are elongation, fatigue limit, hardness, modulus of elasticity,  tensile strength, and yield strength. For instance, the A-basis values of Ti-6Al-4V annealed  plate with thickness of 50.8 to 101.6 mm (2 to 4 in) are: tensile strength = 896 MPa (130 ksi);  yield strength = 827 MPa (120 ksi); and elongation = 10 percent. (MMPDS-06 Handbook)    or more characteristics do not conform to requirements specified in the contract, drawings,  specifications, or other approved documents. Includes failures, defects, anomalies, and  malfunctions. This term is used interchangeably with discrepancy and noncompliance.  (NASA-HDBK-8739.18, Procedural Handbook for NASA Program and Project Management  of Problems, Nonconformances, and Anomalies)   late (definition 2): A product produced using standard industry practices designed  strictly for the production of plate stock to the procured thickness. Bar, billet, forgings, or  forging stock shall not be supplied in lieu of plate. (SAE AMS4911, Titanium Alloy Sheet,  Strip and Plate 6Al – 4V Annealed, section 3.3.2)    into slabs or billets and then into various product forms, such as bars, plates, and sheet, for  example. Hot rolling would be an example of a thermo-mechanical operation to reduce the  thickness of billets or plate stock.   Plate (definition 3): A flat rolled product of 4.78 mm (0.188 in) and over in thickness  and over 30.48 cm (12 in) in width, with the width at least five times the thickness. (MIL-T-  9046J, section 6.4.3)  level, this process consists of the production of Ti and Ti alloys from an ore, through the  sponge, to form an ingot. Primary mills may also produce subsequent shapes of Ti and Ti alloy  as either intermediate products or final product shapes.    and appropriate thermal treatment to meet the tensile properties and microstructure  requirements of this specification (referring to MIL-T-9047) or applicable forging  specification prior to structural use. (MIL-T-9047G, section 6.1.2)                   temperature, held at that temperature long enough to cause one or more constituents to enter  into solid solution, then cooled rapidly enough to hold these constituents in solution.  (Donachie, 2000)           nformation about Ti alloy specifications and how Ti alloys are fabricated, procured, and  certified is included in this section.     /space-quality Ti alloys for many years (until the late 1990s) through two military specifications:  MIL-T-9047 and MIL-T-9046.  IL-T-9047 was issued on June 16, 1953, and covered Ti and Ti alloy rolled or forged bar and  reforging stock products. MIL-T-9046 was issued on May 20, 1955, and encompassed Ti and Ti  alloy metal sheet, strip, and plate products. Both specifications were revised many times over  their years of use. As more Ti alloys were developed and more test data acquired, the  procurement specifications were altered accordingly. High-performance requirements for new          aircraft and space hardware designs resulted in ever more stringent specification requirements for  processing, chemical composition, mechanical testing, and inspection.   minor editorial and format changes. This specification was subsequently canceled by the  Aerospace Materials Division, SAE, as of May 2006 and has been superseded by the applicable  AMS specifications listed in table 1, List of SAE AMS Specifications Superseding SAE AMS-T-  9047 (MIL-T-9047). The requirements of the latest issue of the AMS specifications listed in  table 1 should be fulfilled whenever reference is made to the canceled SAE AMS-T-9047  specification.                     Alpha-Beta Ti  Alloys   5Al-2.5Sn  5Al-2.5Sn (ELI)         7AL-4Mo  3Al-8V-6Cr-4Mo-  4Zr   Annealed  Annealed  Duplex  Annealed  Annealed  Annealed  STA  Annealed  Annealed  STA  Duplex  Annealed  Duplex  Annealed  STA  Annealed  ST  STA  ST  STA  Superseding  Specification  SAE AMS6900  SAE AMS6901  SAE AMS6910  SAE AMS6940  SAE AMS6931  SAE AMS6930  SAE AMS6932  SAE AMS6936  SAE AMS6935  SAE AMS6905   SAE AMS6906  SAE AMS6915  SAE AMS6920  SAE AMS6921  SAE AMS6925  SAE AMS6926  metals are usually procured in the annealed condition and may be used as annealed in flight  hardware or later solution treated and aged (STA) during fabrication/assembly phases. Therefore,  according to table 1, the applicable procurement specifications for Ti-6Al-4V annealed bars and  forgings and Ti-6Al-6V-2Sn annealed bars and forgings are SAE AMS6931 and SAE AMS6936,  respectively.   hese two SAE AMS specifications have similar requirements to the last revised MIL-T-9047G,  Amendment 2. There is one divergence of interest with respect to maximum cross-sectional area  of tested material: SAE AMS6931 specifies minimum mechanical properties for stock with a  maximum cross-sectional area of 309.68 cm2 (48 in2) instead of 103.23 mm2 (16 in2) in MIL-T-  9047G, Amendment 2. See section 4.4 for more information regarding the topic of maximum  cross-sectional area. In addition, the latest SAE AMS6931B asserts in section 3.3.1, “The  product shall be processed to the final thickness/diameter by metallurgical working operations  prior to any straightening, dimensional sizing or surface finishing operations. Bar shall not be cut  from plate.”  ST = solution treated  STA = solution treated and aged            only minor editorial and format changes. This specification was canceled by the Aerospace  Materials Division, SAE, as of May 2006 and has been superseded by the applicable SAE AMS  specifications listed in table 2, List of SAE AMS Specifications Superseding SAE AMS-T-9046  (MIL-T-9046J, Amendment 2). The requirements of the latest issue of the AMS listed in table 2  should be fulfilled whenever reference is made to the canceled SAE AMS-T-9046 specification.    able 2—List of SAE AMS Ti Alloy Specifications Superseding SAE AMS-T-9046 (MIL-T-  9046J, Amendment 2)    SAE AMS-T-  9046 Material  Designation  A-1  A-2  5Al-2.5Sn  5Al-2.5Sn (ELI)        AB-5  B-1      6Al-2Sn-4Zr-  2Mo  3Al-2.5V  13V-11Cr-3Al  3Al-8V-6Cr-  4Mo-4Zr    Superseding  Specification  SAE AMS4910  SAE AMS4909  SAE AMS4915  SAE AMS4916  SAE AMS4911  SAE AMS4903  SAE AMS4904  SAE AMS4907  SAE AMS4918  SAE AMS4988  SAE AMS4990  SAE AMS4919  SAE AMS4989  SAE AMS4917  SAE AMS4939  Annealed  Annealed  Annealed  Duplex  Annealed  Annealed  ST  STA  Annealed  Annealed  ST  STA  Duplex  Annealed  Annealed  ST  ST  NASA Centers mainly procure two alpha-beta Ti alloys: Ti-6Al-4V and Ti-6Al-6V-2Sn in the  annealed condition. As indicated in table 2, applicable procurement specifications for Ti-6Al-4V  annealed sheet, strip, and plate and Ti-6Al-6V-2Sn annealed sheet, strip, and plate are SAE  AMS4911 and SAE AMS4918, respectively.  hese two AMS specifications have requirements similar to MIL-T-9046J, Amendment 2. In  addition, the latest SAE AMS4911 and SAE AMS4918 assert in section 3.3.2, “Plate product  shall be produced using standard industry practices designed strictly for the production of plate  stock to the procured thickness. Bar, billet, forgings, or forging stock shall not be supplied in lieu  of plate.”                 that might be relevant to procurement of Ti-6Al-4V material in the annealed condition,  specifically in bar and forging forms. SAE AMS4928 covers Ti-6Al-4V bars, wires, forgings,  rings, and drawn shapes in annealed condition. When compared with SAE AMS6931, which  superseded SAE AMS-T-9047, SAE AMS4928 does not specify any maximum cross-sectional  area of tested material nor does it specify macrostructure and ultrasonic inspection requirements.  SAE AMS4928 also allows a solution heat treatment (HT) in a mill-annealed material. This is  not permitted in any other mill-annealed specification. Solution HT increases strength at the  expense of fracture toughness. However, SAE AMS4928 has a more stringent requirement on  hydrogen content (maximum 125 ppm versus 150 ppm in SAE AMS6931) and higher tensile and  yield strength requirements for bars up to 50.8 mm (2 in) in thickness (931 MPa (135 ksi) and  862 MPa (125 ksi) versus 896 MPa (130 ksi) and 827 MPa (120 ksi) in SAE AMS6931).  Additional requirements can always be added to procurement documentation if this specification  needs to be utilized, thereby facilitating material purchased in accordance with this specification  to be acceptable for flight.  specifications, coupled with careful review of the certification data package, is required to assure  that material has been properly processed and certified.   material. However, this specification does not include requirements for microstructure,  macrostructure, and ultrasonic inspection and is not recommended for procurement of  aircraft-/space-quality Ti and Ti alloys for flight application without the use of additional  requirements to address noted shortfalls or performance of additional testing by procuring  organizations.       product begins as an ingot: in vacuum, a molten Ti alloy is allowed to solidify in a mold.  Example Ti alloy ingot diameters are 71.1 cm (28 in), 76.2 cm (30 in), and 91.4 cm (36 in).  he ingot is then typically hot worked in a forging press into the products referred to as billets,  slabs, or blocks. These partially forged, semi-finished materials are created as feedstock for final  processing. The semi-finished materials are intermediate products generally not intended for  finished products. Intermediate products require additional hot rolling, hot forging, or extruding  processes (also generally referred to as metallurgical working operations) to produce wrought  end-product shapes for aerospace applications. A typical fabrication process for aerospace-  quality wrought Ti alloy finished products is shown in figure 1, Fabrication Process of Wrought  Ti Alloys. (Figure 1 is modified from Calcaterra, 2009.)        The primary mill sources for ingots of Ti alloy in the U.S. include Allegheny Technologies  Incorporated (ATI) Allvac, RTI International (formerly Research Triangle Institute), and  Titanium Metals Corporation (Timet). These companies supply ingots to conversion houses that  forge and/or hot roll the ingot into intermediate products. Primary mill sources may also produce  intermediate or end-product forms.  xamples of end-product shapes intended for use in aerospace systems include bar (round or  rectangular), plate, sheet, strip, and wire. Some specifications also include a product form called  forging stock, which is the same as billet or intermediate product to be used for further  processing.  he complex microstructures of Ti alloys are developed from combined thermal-mechanical  processing of as-cast ingots through intermediate to the final product forms. The microstructure  and hence the mechanical properties of Ti alloys are dependent on the fabrication scheme and the  thermal history. Multiple cycles of work (heating, forging, rolling, and cooling) are required to  achieve the desired microstructure required for thin plate and sheet products used for flight  applications. Intermediate product forms may not have been worked sufficiently to produce the  microstructure necessary to achieve minimum acceptable specification-based mechanical  properties across the entire cross section. If, because of the size of a Ti alloy part to be  fabricated, intermediate product sizes such as billets of greater than 15.2 cm (6 in) thickness need  to be procured, the procuring organization can specify slightly lower minimum mechanical  properties than typical for thinner plate material. Based on information from USAF and JPL test  programs (discussed in sections 5.3.2 and 5.3.3 in this NASA Technical Handbook), only 5 to 10  percent reductions in tensile ultimate strength (Ftu) and tensile yield strength (Fty), respectively,  may be sufficient to bound the minimum mechanical properties of the billet material. However,  there are significant deviations in secondary properties. Specifically noteworthy are impacts to           fatigue and other dynamic mechanical properties, which are described further in section 5.3.2 of  this NASA Technical Handbook.  In addition to thermo-mechanical processing, Ti alloy mechanical properties are strongly  dependent on heat treatment. Ti-6Al-4V is commonly specified in either an annealed or an STA  condition. Annealing requires that the entire cross section be maintained at 704.4 °C (1,300 °F)  for 1 hour minimum, followed by furnace cooling, if maximum ductility, i.e., high percent  elongation and percent reduction of area at failure, is required. Note: Most specifications give a  temperature range with 704.4 °C (1,300 °F) as a minimum. Also, most specifications make a  reference to section thickness driving the time at temperature. SAE AMS-H-81200, Heat  Treatment of Titanium and Titanium Alloys, offers the following guidance in selecting soak  times:      annealed Ti 6Al-4V material are 827 MPa (120,000 psi) and 896 MPa (130,000 psi),  respectively. Carefully developed thermal processes exist for STA conditions. The resulting  effects of these thermal processes on minimum strength values as a function of plate thickness  can be seen in figure 2, Specification Minimum Strength Sensitivity of Ti-6Al-4V Sheet, Strip,  and Plate as a Function of Heat Treatment, Thickness, and Interstitial Element Level.  Figure 2— Specification Minimum Strength Sensitivity of Ti-6Al-4V Sheet, Strip, and Plate  as a Function of Heat Treatment, Thickness, and Interstitial Element Level              60  Wrought Material Dimension (mm)                                 Mills, conversion houses, or heat treatment shops use an acid treatment, referred to as pickling,  to remove the scale and/or an alpha case from material not heat treated in vacuum or suitable  inert gas environments. This etching process can be an issue regarding the generation of  hydrogen embrittlement; therefore, a hydrogen content determination test, e.g., in accordance  with ASTM E 1447, Standard Test Method for Determination of Hydrogen in Titanium and  Titanium Alloys by Inert Gas Fusion Thermal Conductivity/Infrared Detection Method, of final  products is required, and the test result should be included in the material certification package.  Also, because of the tendency of prestressed Ti alloys to crack while in contact with certain  chemical reagents, it is necessary to ensure that materials used during processing, testing, and  inspection, including ultrasonic couplants, will not initiate stress corrosion of titanium alloys.  ASTM F 945, Standard Test Method for Stress-Corrosion of Titanium Alloys by Aircraft Engine  Cleaning Materials, can be used for dealing with the contact material compatibility issue.   a “plate product shall be produced using standard industry practices designed strictly for the  production of plate stock to the procured thickness. Bar, billet, forgings, or forging stock shall  not be supplied in lieu of plate.” No matter whether the previous practice for any Ti alloy  supplier has included cutting down billet thicknesses, this practice is not standard.   be processed to the final thickness/diameter by metallurgical working operations. Bar shall not  be cut from plate. It is not allowed to cut a plate along its longitudinal direction and make a  bar. If cutting in the longitudinal direction is done, the product still needs to be identified as plate  stock. The customer may agree on the substitution, but the bar product from the plate stock  cannot be certified as bar stock. Cut strip from the plate without further thickness reductions is  acceptable, as noted above. However, it is important to maintain grain direction knowledge of  cut samples. In addition, it should be clear that cutting billet is permitted if the cut pieces are  subsequently hot or cold worked. This is a common industrial practice and completely  acceptable.    NASA organizations or associated contractors by material distributors or secondary processing  plants/companies, also referred to as conversion houses. For NASA flight program applications,  the use of an appropriate material specification as a part of the procurement process is standard  practice.   extrude) starting material into finished forms. Conversion houses have the in-house capability to  perform some or all of the standard hot-working operations. Starting material for conversion  houses may be referred to as forging stock, billet, or various other names. On the other hand,  most Ti alloy distributors have only capabilities to cut stock with low-speed band saws or high-  speed circular saws to meet size demands (different lengths and/or widths of a given thickness  plate) of customers. Neither low- nor high-speed cutting is considered to be a metallurgical  working operation or hot working.       A material distributor may place orders to build up internal stock from conversion houses for  finished products or procure intermediate products, e.g., billets or thick plate stock, or even  procure Ti alloy ingots directly from Ti alloy mills. These intermediate products and ingots  would subsequently be sent back out for hot working to meet a specific customer need. When an  ingot is hot worked, it is considered a wrought product. Wrought products are divided into  intermediate products and finished products. The thickness of wrought products is reduced  through the hot-working process. An ingot is considered a cast shape.   there is a part configuration issue, e.g., size/thickness, which precludes the use of finished  products. If the stock to be used is larger than what the specification allows/requires, it still  should be worked in the alpha-beta range to its final dimensions. Also, a purchaser needs to have  an agreement on the minimum non-specification-based mechanical properties. However, all of  the other specification requirements should apply. SAE AMS6931 and SAE AMS4911  specifications define what are considered finished plate and bar materials, respectively, and  describe how these products shall be processed. (See section 4.3 in this NASA Technical  Handbook.) Exceptions must be carefully dealt with by knowledgeable design, stress, and  materials/processing engineers or manufacturing engineering personnel so that the proper  minimum property values are used in the design, analysis, and verification activities.  he boundary size between billet and end product is alloy dependent. For example, Ti-6Al-6V-  2Sn is generally 20,645 mm2 (32 in2), Ti-6Al-4V is 309.68 cm2 (48 in2), and TI-6Al-4V ELI is  103.23 cm2 (16 in2). Intermediate product forms for Ti-6Al-4V, such as billets, are generally  considered to possess cross sections of greater than 309.68 cm2 (48 in2), but some specifications  are more stringent and stipulate that product forms with greater than 103.23 cm2 (16 in2) be  considered an intermediate product form. For example, ASTM B348 defines a billet as a solid  semi-finished section hot rolled or forged from an ingot with a cross-sectional area greater than  103.23 cm2 (16 in2) whose width is less than 5 times its thickness. SAE AMS6931 alternatively  requires a maximal cross-sectional area of 309.70 cm2 (48 in2) (with no stipulation for  relationship of width to thickness) of tested forging product instead of the original 103.23 cm2  (16 in2) maximum required by MIL-T-9047G, Amendment 2. The specification words referring  to “of tested material” are related to the requirement to extract mechanical test coupons, such as  tensile test coupons, from material that has less than the 309.68 cm2 (48 in2) cross section.   mechanical properties are a requirement, and if the material does not meet them, it can be  rejected. If the cross-sectional area is above the limit, then the mechanical properties are for  information only and cannot be used to reject the material, unless there is a pre-established  agreement between the procuring parties. While any size can be ordered, the procuring party  should be aware of when the specifications apply and when they do not.  s discussed in section 5.3.2 of this document, some data have emerged recently (AFRL-RX-  WP-TR-2012-0238, Quick Reaction Evaluation of Materials and Processes (QRE), tending to  show that barely acceptable tensile property values are attainable for semi-finished billets with  cross-sectional areas several times greater than 309.68 cm2 (48 in2). Caution is urged in this area  as the testing only represents large billets from one conversion house. On the other hand, the       USAF test program on large cross-sectional area billets indicated up to 70-percent knockdown in  fatigue life when compared with the control plate.  ntermediate product forms may not have been worked sufficiently to produce the microstructure  necessary to achieve minimum specification mechanical properties across the entire cross  section. It is possible, based on the above-mentioned extensive mechanical testing conducted by  the USAF, with some supporting evidence from JPL D-69922, Report of the Titanium Working  Group Concerning the Assessment of Non-Conforming Material as it Affects JPL Flight  Projects, that Ti-6Al-4V billet (unlike Ti-6AL-6V-2Sn material produced to USAF  requirements) can just meet the minimum mechanical values specified in AMS specifications for  plate material greater than 152 mm (6 in) thick. However, JPL has also performed mechanical  testing on suspected Ti-6AL-4V billet material provided as if the material was in a finished  product shape with relevant material certifications and found several lots of material that  exhibited mechanical properties just below minimum specification values. For example, out of  122 tensile test coupons made from 4 suspect lots of Ti-6Al-4V, 25 percent of test coupons failed  to meet the specified minimum tensile yield strength, 4 percent of coupons failed to meet the  minimum ultimate strength, and 53 percent of coupons failed to meet the minimum reduction in  area. These data are discussed further in section 5.3.3 in this NASA Technical Handbook.  distributors, conversion houses, or mills as part of standard procurement or acquisition processes.  In the case of procured finished products or parts, certification packages are supplied by the  vendors providing the finished parts. The certification package is to contain, as a minimum, the  information outlined in the material specification for finished material provided by a mill. In  addition, if material is processed by a conversion house, the original mill certification, the  conversion house certification, the heat treatment certification, the hydrogen content test report,  mechanical test data, ultrasonic inspection test report, micro/macrostructure evaluation, and any  other quality assurance data required by the specification are also to be provided.    he material certification should contain all the test results and/or verification that the material  meets all of the requirements contained in the applicable material specification. If the material  was procured from a mill or from a distributor that obtained the material in its final form from a  mill, this information will be in a mill certification. If the distributer had an intermediate product  converted into the final form, the certification should contain the original certification for the  ingot or billet, the certification from the conversion house (including starting size of billet and  the finish size), the certification from the heat-treat supplier, and the results for the ultrasonic  inspection, mechanical property testing, and the macrostructure and microstructure examinations.         Government specification to which it was certified specifically to the final products, such  as a plate, sheet, and forged bar.     key aspect of the Government-Industry Data Exchange Program (GIDEP) documents  associated with nonconforming Ti alloys (listed in Appendix B of this NASA Technical  Handbook) has been the allegation that some suppliers have delivered final product forms,  namely bar and plate, that have been cut from intermediate product forms without the necessary  additional thermo-mechanical working, a product called a cut-down billet. Moreover, it is  alleged that material certification data associated with these final product forms were derived  from test coupons drawn from prime locations within the intermediate products that may not be  representative of the cross section from which the final products were obtained.    and SAE AMS4904, Titanium Alloy Sheet, Strip, and Plate 6Al-4V Solution Heat  Treated and Aged. A forged plate thickness is produced as a part of the forging operation,  i.e., no cutting of plate thickness occurs. These two specifications, along with most other  Ti alloy specifications, require plate to be fabricated by rolling, not forging. Forging is  not a valid method to produce Ti alloy plate. A plate fabricated by forging may not have  been worked sufficiently to meet the minimum mechanical property specifications  required by rolled plate in the aforementioned specifications.   Cut-down billet. This material is unlikely to have been sufficiently mechanically worked  to meet the minimum mechanical specifications of SAE AMS4911 and SAE AMS4904  for rolled sheet and plate or by SAE AMS6931 for forged bar. The lack of mechanical  work is related to the larger cross section. Ti alloys supplied to DoD and NASA contracts  are to conform to all contract requirements, including specifications cited in such  contracts. When rolled plate is specified, the Ti alloy is to be rolled to the required  thickness using industry standard practices. When bar is specified, the Ti alloy is to be  hot worked to the required dimensions. The required Ti alloy dimensions are not to be  accomplished by cutting down a thicker material. Almost all Ti alloy specifications  specifically prohibit this practice. Cutting plate and bar stock to create the desired length  of product to meet customer requirements is standard acceptable practice.                  vidence began accumulating that Ti alloys were being delivered from metal distributors to the  industrial supply chain without having been processed in accordance with specification and that  these materials could have strength properties below specification minimum values.  response to GIDEP releases dating from as early as 2004. The concern for inappropriate  processing of Ti alloys does not extend to primary mills but rather to the distributors.   nvestigation by the Air Force Research Laboratory (AFRL), the Air Force’s repository of  materials and manufacturing expertise for Ti, ultimately led to a federal indictment (case number  3:08-cr-04229 in the U.S. District Court for the Southern District of California) by the U.S.  Department of Justice against the primary and other distributor companies. The case proceeded  to trial in the fall of 2010, resulting in a plea agreement involving the imposition of a fine and  payment of restitution to the U.S. Government.  he federal indictment alleged that nonconforming, cut-down Ti alloy billet was being sold as  forged and rolled sheet, strip, bar, and plate. Other finished product forms (castings, sheet, strip,  extrusions, die forgings, rod, and wire) were not implicated.  ASA and NASA contract engineers must design components assuming minimum strength and  ductility related values that will be delivered by procured materials. If a material is not processed  in accordance with relevant specification, the engineer’s design can be unknowingly  compromised. This could lead to flight project hardware designs having inadequate structural  margin, leading to structural failures and possibly mission failures.   deflections, such as in cantilever beam members, lower buckling margins for compression  structure, and changes in natural frequencies.     thermal and mechanical processing, which gives them their superior mechanical properties.  These microstructures and, hence, the alloy’s mechanical properties are sensitive to the  material’s processing history. Failure to properly process Ti alloy can result in lower than  specified (nonconforming) mechanical properties. The key mechanical properties are:   Tensile Ultimate Strength (Ftu)   Tensile Elastic Modulus (E)   Tensile Yield Strength (Fty)   Elongation (El)   Reduction of Area (RA)        reviously mentioned JPL mechanical testing (JPL D-69922) was focused on tensile properties.  In addition to extensive static mechanical property testing, the nonconforming Ti alloy testing at  AFRL (Calcaterra, 2009) included dynamic and damage tolerance properties. Reduced dynamic  properties could result in possible service life impacts such as decreased crack initiation life,  increased fatigue crack growth rate, and decreased fracture toughness. These impacts can result  in shorter part lives and reduced inspection intervals.        improperly processed material inconsistent with plate in accordance with SAE AMS-  T-9046.   – 32 specimens (37 percent) did not meet Ftu specification minimum.  – 19 specimens (22 percent) did not meet Fty specification minimum.  – Crack growth rate on 37 specimens was 4 times faster than rolled plate.  ubsequent to the testing discussed in section 5.3.1 above, the USAF embarked on a large billet-  level test program for assessing the degree to which mechanical properties of such material met  minimum specification values. This test program was designed to develop property data on a  specific billet form obtained from one conversion house of two Ti alloys (Ti-6Al-4V and Ti-6Al-  6V-2Sn) representing incomplete thermal-mechanical processed material.   cm (24 in) x 48.3 cm (19 in) x 16.5 cm (6.5 in) and of 61 cm (24 in) x 114 cm (45 in) x 16.5 cm  (6.5 in). Two Ti-6Al-6V-2Sn billets were fabricated for this program to thicknesses prescribed  by AFRL to produce two different levels of hot working in the material. These billets had  nominal dimensions of 30.4 cm (12 in) x 267 cm (105 in) x 11.4 cm (4.5 in) and 30.4 cm (12 in)  x 203 cm (80 in) x 20.3 cm (8 in). Both alloys were produced in accordance with the SAE AMS-  T-9047 specification that covers reforging stock and were delivered in the mill-annealed heat-  treat condition.       Fatigue Limit ( Sf)   Fracture Toughness ( KIc)   Fatigue Crack Growth Rate (da/dN)   Corrosion and Stress Corrosion Cracking (SCC) resistance.         Significant numbers of test coupons were fabricated for tensile, fatigue (both stress versus  number of cycles fatigue curve (S-N) and strain versus number of cycles fatigue curve (-N)),  da/dN, KIc, and SCC testing. For example, for the Ti-6Al-4V material alone, over 300 tensile test  coupons were fabricated and tested.   Incompletely Processed Ti Alloys in Annealed Condition. The test data are compared with the  required tensile properties of plate and sheet in accordance with SAE AMS-T-9046. The decision  to refer to these baseline values as reasonable lower bounds (RLBs) was based on the fact that an  insufficient quantity of material heats and lots were represented for the calculation of traditional  MMPDS A- or B-, or even S-basis allowables (AFRL-RX-WP-TR-2012-0238). However, the  number of specimens tested (often in replicate) is significant. Thus RLB was chosen by the  USAF Ti Task Force as an acceptable term to describe properties derived from the testing of  multiple specimens from the two heats (per alloy) of material in this program. While these do not  meet the requirements for standard baseline property determination, they are, nevertheless,  significant. Under normal circumstances, three heats of material would be needed for  establishing a specification minimum (S-basis) value; whereas 10 heats of material would be  required for A- and B-basis allowables.  ductility (El and RA) RLB values were determined by the lowest value in the population. For the  durability and damage tolerance properties (Sf, da/dN, and KIc), a life factor was determined that  compared the properties of the improperly processed alloys with baseline properties generated  from control plates.   or stiffness-driven designs of space structures, there can be concerns over degraded (lower)  elastic modulus values. There were no independent tests, such as ultrasonics, conducted and/or  vibration techniques to verify degraded values indicated in this section. Organizations are  encouraged to verify off-nominal elastic modulus test values through an independent test  technique if there are structural deflection concerns.   major conclusion of the report is that engineers and designers should account for reduced  properties when assessing the integrity and safety of components made with non-conforming  materials.         Table 3—Summary of AFRL Tensile Property Data on Incompletely Processed Ti Alloys in  Annealed Condition (AFRL-RX-WP-TR-2012-0238)          Ti-6Al-4V  Ti-6Al-6V-2Sn  Ti-6Al-4V         896 MPa (130 ksi)  945 MPa (137 ksi)  814 MPa (118 ksi)  903 MPa (131 ksi)  6.7%  8%  10%   105.5 GPa (15.3 Msi)  97.9 GPa (14.2 Msi)     Difference from SAE AMS-T-9046 Minimum  Values  (5.1 to 10.2 cm (2 to 4 in thick))  No difference  55 MPa (8 ksi) lower  14 MPa (2 ksi) lower  28 MPa (4 ksi) lower  3.3% lower than minimum specification value of  10%  No difference  15% lower than SAE AMS-T-9047 <10.2 cm (<4  in) thick)  1% lower than SAE AMS-T-9047 7.6 to 10.2 cm  (3 to 4 in) thick  4.8 GPa (0.7 Msi) lower than MMPDS-06 typical  12.4 GPa (1.8 Msi) lower than MMPDS-06  typical  n/a†    S-N  Fatigue*  -N  Fatigue*  Ti-6Al-4V  Ti-6Al-6V-2Sn  Ti-6Al-4V  Ti-6Al-6V-2Sn  61.2 MPa√m (55.7 ksiin)  0.61  0.14  0.71  0.69  1x  n/a†  n/a†  n/a†  n/a†  n/a†  da/dN* Ti-6Al-4V  †: No specification minimum value exists for this property. Data from tested control plates were used in the  determination of RLB or life factor.  *: Fatigue and crack growth rate life factors discussed in this report that describe the relationship between Ti alloy  billet and plate should be used for initial screening purposes only. These factors represent worst-case comparisons  for only two stress ratios (R=0.05 and -1 for fatigue, R=0.1 and 0.7 for da/dN); factors approach 1.0 at certain  regions of the curves from which the factors were derived. If a program’s initial screening indicates that sufficient  maintenance intervals continue to exist for Ti alloy components, no further analysis is required. However, if  maintenance intervals are found to be unacceptable during an initial screening using the published factors, a program  may conduct further analysis using the full range of the test data provided by AFRL, supplemented, as appropriate,  with test data and analysis generated by the program.         uring the course of the nonconforming Ti alloy assessment at JPL, materials and process  (M&P) engineers reviewed approximately 1,000 Ti alloy certification packages. Of these  certification packages, 120 were found to contain suspicious omissions or other irregularities.  While the investigation primarily focused on assessing if there was evidence of an improperly  processed material, specifically regarding the cutting-down billet issue, the review indicated  there were also material lots that could not be traced back to the source. Also, this investigation  revealed that heat treatment, composition, and inspection could also be issues. Out of the dozens  of lots of Ti alloy associated with these irregular certification packages, residual material from 4  lots happened to exist in sufficient quantity to facilitate the fabrication of 121 (total) tensile test  coupons. The summary of tensile test results of Ti-6Al-4V materials in annealed condition from  four certification packages indicating possible improper processing is shown in table 4, JPL  Tensile Test Results Summary of Suspected Nonconforming Ti-6Al-4V in Annealed Condition.   Table 4—JPL Tensile Test Results Summary of Suspected Nonconforming Ti-6Al-4V  in Annealed Condition  Lot Procurement  Specification1   Number of  Test  Results  30  Fty  (% of results below  minimum)  0  Ftu  (% of results  below minimum)  0  El  (% of results  below minimum)  10.0  B MIL-T-9047G  C ASTM B348-    30  24   56.7  37.5   6.7  12.5   0  50.0   RA  (% of results  below minimum)  No minimum  specified  36.7  95.8   Notes:  1. MIL-T-9046J, MIL-T-9047G and ASTM B348-10 minimum values: Ftu = 896 MPa (130 ksi), Fty = 827 MPa   2. ASTM B348-10 minimum RA = 25%. Percentages shown represent data from the longitudinal and transverse  directions. This specification was initially used for procurement of material to produce engineering model  hardware; subsequently, with additional in-house testing, this lot of material was deemed acceptable for one part  used on a flight project.   were machined from extra component parts that were known to be fabricated from  nonconforming material. The test data from these six coupons were combined with the 121 test  results listed in table 4, and the total set of test data was analyzed to determine a pseudo S-basis  minimum specification value (MSV) or knockdown, which could then be used in an on-going (at  the time of the nonconforming Ti alloy investigations only) Flight Projects schedule-critical Ti  alloy parts assessment process to determine if stress analyses yielded positive design margins for  specific spacecraft components. The resulting approximate S-basis MSVs are summarized in  table 5, JPL-Established Pseudo S-Basis Nonconforming Ti Alloy Minimum Specification  Values. This assessment process should not be used as a part of standard part design/test/analysis  processes for flight applications. This information is provided to indicate what one organization  did to assess flight load margins for existing schedule-critical flight hardware where there was  the possibility of having used a nonconforming Ti alloy lot.         Table 5— JPL-Established Pseudo S-Basis Nonconforming Ti Alloy Minimum  Specification Values1  Ti-6Al-4V Annealed2   Ftu  (MPa (ksi))  Fty  (MPa (ksi))     853.67  (123.81)  872.70  (126.57)  846.22  (122.73)  747.07  (108.35)  760.45  (110.29)  730.18  (105.90)  El  (%)     RA  (%)     E  (GPa  (Msi))  118.6  (17.2)  117.2  (17.0)  121.4  (17.6)  Specification  Knockdown Ftu  (%)  4.8  Specification  Knockdown Fty  (%)  9.7      Notes:  1. Data at room temperature.  2. Tested in accordance with ASTM E8, Standard Test Methods for Tension Testing of Metallic Materials.  3. All data are S-basis except E (mean) and Knockdown (%).  4. All = Results for all 121 test coupons described in table 4, plus 6 additional test coupons for a total of 127 test   5. L = Longitudinal direction; parallel to the principal of flow in a worked metal.  6. T = Transverse direction; perpendicular to the principal direction of flow in a worked metal    statistical value, where at least 99 percent of the population of values is expected to  equal or exceed the minimum value with a confidence of 95 percent.   • T99: statistically based lower tolerance bound for a mechanical property such that at  least 99 percent of the population is expected to exceed with 95 percent confidence  (MMPDS-06).   k99 = 2.326 + exp [1.34 − 0.522 ln(n) + 3.87/n], or k99 = 2.326 + exp [1.34 − 0.522  ln(127) + 3.87/127] = 2.64, in accordance with MMPDS-06, table 9.10.1. (n =  Number of individual measurements.)    MMPDS Handbook, of Battelle, and were found to be acceptable. The person who performed the  review is an expert in statistical treatment of materials property data. S-basis analysis of the  residual material test results indicated that yield and ultimate strength of the nonconforming  material fell short of specification minimum values by about 10 percent and 5 percent,                  coupled with a careful review of the certification data package (ideally, before material is  received), is needed to assure that material has been properly processed and certified. A useful  test of the integrity of the manufacturing process is to establish the chain of custody of the  material through the various stages of processing, as discussed in section 6.2 in this NASA  Technical Handbook. The absence of information in certificates about who hot worked the  product to final dimensions and what lot number is associated with the hot-working operation  seems to have increased in recent years.  respectively. These knockdown property values were used to assess whether there was still  positive stress margin for affected JPL flight parts.   he threat of nonconforming Ti alloys being used on one of many dozens of flight projects at  JPL resulted in an exhaustive component-by-component assessment in the late 2000s. Based on  the new pseudo S-basis mechanical properties established in testing (described in section 5.2.3  above) and detailed reviews of respective materials certifications, a disposition of use-as-is,  retest, or remanufacture was made on over 1,000 parts already fabricated from Ti-6Al-4V. These  were in-process parts for which the launch had not yet occurred. For a further description of this  nonstandard and temporary effort used to screen Ti alloy parts for in-process projects, refer to  Appendix C in this NASA Technical Handbook. This type of screening is not recommended as  standard practice.  ppendix D in this NASA Technical Handbook contains specific examples of four irregular  certification packages and a description of typical missing information that is either required by  the specification or expected in accordance with industry standard practice, as well as  information not in conformance with referenced specifications.    An example of a “clean,” i.e., acceptable, Certification Package is provided in Appendix E in this  NASA Technical Handbook.     Based on a thorough investigation of the quality of both certification documentation and the  supply chain for aerospace-grade Ti alloy material, some mitigation actions have been identified  to help avoid the chances of procuring and using nonconforming material. Some or all of these  steps and even more conservative steps can be implemented to help prevent nonconforming  material from finding its way into NASA’s and its contractors’ flight hardware. These measures             nonconforming material was judged to reside primarily with metal distributors. There has been  no indication of improper Ti alloy processing on the part of mills or conversion houses.  Independent testing laboratories have been known to be under pressure at times from customers  on such issues as test sample location selection and discarding of samples that have failed to  meet specification minimums. Since procurements from metal distributors have grown, the  mitigation efforts noted in this section are directed toward assuring that, when material is  procured from distributors, the buyer can be assured that it meets all requirements.    can help secure high-quality Ti alloy raw material, as well as Ti alloy components supplied  through subcontracted manufacturers and industry partners.   n important aspect of determining whether final product forms may be nonconforming involves  careful inspection of the associated certification data package. Most metal suppliers will provide  an electronic or faxed copy of the applicable, lot-specific certification package(s) before the  procurement is placed with them. This affords an opportunity to avoid rejecting any lot of  material after it shows up at the place of use.   the material through the various stages of processing to determine whether each stage was  performed by a firm having the necessary processing capability. For example, if a final product  form of plate is produced from an intermediate product form of larger thickness, additional  rolling of the intermediate form is required. If the supplier is known not to have rolling  capability, which is the case for most Ti alloy distributors, and if there is no indication that the  material was rolled by a conversion house or other facility, then one should be suspicious that the  final product may be cut-down billet.  etailed knowledge of the certification requirements associated with the various specifications,  coupled with careful review of the certification data package, including verification of claimed  chemical composition, is needed to help assure that material has been properly processed and  certified.  Mechanical Inspection, and Acquisition can all help mitigate the potential risk of procuring and  using nonconforming Ti alloys. Because of the options and conditions necessary for Ti alloys to  be compliant with a given specification, the use of appropriately trained/experienced M&P  engineers and/or QA personnel is recommended for review and acceptance of Ti alloys for flight  applications.                 upply chain surveys and audits are recommended to be performed by QA or equivalent and  M&P engineers. An example survey/audit list is shown in Appendix F in this NASA Technical  Handbook. Qualified suppliers can be placed on a Qualified Suppliers List (QSL)/Approved  Suppliers List (ASL) at JPL. An organization can then establish an internal practice that  aerospace-quality wrought Ti alloys to be used for flight application should be procured only  from QSL/ASL suppliers. Frequency of re-audits may be dependent on performance factors.  Note: The same guideline procedures described in this NASA Technical Handbook should be  used for foreign Ti alloy sources and foreign contractors.  nsure that quality clauses regarding material are sufficiently spelled out to assure that mill  certifications, processing certifications, and testing certifications are received with material or  procured metal parts.   NASA Technical Handbook, requires mill certifications, processing certifications, and  independent material testing reports for any material that has been altered subsequent to mill  processing. Mills should provide the original material test report to purchasing organizations.  Original mill material purchasing organizations who, in turn, sell portions of any given mill lot  of material are expected to provide a copy of the original mill material test report to subsequent  purchasers.    ll procurements should require the material type and specifications to be listed on the contract,  e.g., Ti-6Al-4V annealed bar in accordance with SAE AMS6931 and Ti-6Al-4V annealed plate  in accordance with SAE AMS4911.  ach drawing should require that the material type and specification are identified, e.g., Ti-6Al-  4V annealed bar in accordance with SAE AMS6931 for the Isolator of Feed Assembly drawing.   review of certifications by M&P engineers and/or trained/experienced QA or equivalent  personnel.            certification package are. Variations have occurred between outside test laboratory report results  for mechanical testing, as provided with supplied material certification packages, and internal  post-material delivery testing.     assessment, a detailed evaluation of mechanical test report values was conducted between values  reported in the certificate package and values from internal tests at JPL. The 24 test coupons  created 96 data points of mechanical test data for tensile ultimate, tensile yield, percent  elongation, and percent reduction of area. Out of the total 96 data points, 93 in-house test values  were less than any of the independent test laboratory reported values. The independent test lab  provided two test values for each mechanical property, i.e. eight total test values. For a detailed  comparison of the two sets of mechanical property values, see Appendix H in this NASA  Technical Handbook.   perform additional independent spot-check material testing to compare selected supplier’s  material test reports. The independent testing laboratory should be certified for specific testing,  such as mechanical testing, chemical analysis, nondestructive evaluation (NDE), etc., by the  National Aerospace and Defense Contractors Accreditation Program (Nadcap) or ISO in  accordance with AS9100, Aerospace Standard: Quality Management Systems - Requirements for  Aviation, Space and Defense Organizations. The Nadcap or ISO certification does not guarantee  accurate results; therefore, it is recommended that, along with looking for this certification, the  Center perform an audit of the testing house to ensure compliance with the test standards or  specifications and follow up with test laboratories that have demonstrated test result deviations  of concern.  nother potential issue is material test reports that contain typical or average test values rather  than actual test values. When the material specification requires quantitative limits for chemical,  mechanical, or physical properties, the test report should contain the actual test and/or inspection  values obtained. Certificates for physical properties should show actual values.  nonconforming material. The enhancements are in the vein of industry best practices and offer  the greatest amount of protection for the least cost.          n addition to the acquisition organization’s role in utilizing the revised approach for the  procurement of raw metal, it is recommended to use the same requirements when acquiring  machined/fabricated items when the supplier is responsible for acquiring the raw material to be  used. This requires an approach similar to that used for raw material, i.e., the ASL process, to  assure conforming materials are acquired and used for these part or multiple part/assembly-level  procurements. The same material requirements and specifications, mill/processing certifications,  and test reporting and review are as needed for raw metal. This can be accomplished by  incorporation of the already described quality clause entitled Raw Material Traceability.   different approach may be needed, since these efforts may not be controlled through the  procuring organization’s QA and/or M&P Engineering organizations. One approach can be to  establish standard Subcontract Data Requirements Lists (SDRLs)/Data Requirement  Descriptions (DRDs), that an organization’s contracting personnel can use. This would provide  the QA/M&P Engineering organizations standards to be used for these subcontracts and may be  tailored, with appropriate document-owner approval. Included in this set of DRDs is the  Hardware End Item Data Package DRD in which the applicable material certification  requirements are contained. In addition to using the recommended language contained in the  standard SDRLs/DRDs, it is important that the institutional Mission Assurance organization  support and verify that the appropriate requirements are included in these subcontracts.  Examples of recommended language for such SDRLs/DRDs are:      When a contractor supplies converted material produced by a raw material manufacturer,  the contractor shall submit all pre- and post-conversion chemical/physical tests reports  and any contractor arranged retests.               REFERENCE DOCUMENTS AND  MILITARY SPECIFICATIONS   Heat Treatment of Titanium and Titanium Alloys (Cancelled; refer  to SAE AMS-H-81200A)    Titanium and Titanium Alloy, Sheet, Strip, and Plate (Cancelled;  refer to SAE AMS-T-9046A)  Titanium and Titanium Alloy, Bars (Rolled or Forged) and  Reforging Stock, Aircraft Quality (Cancelled; refer to SAE AMS-  T-9047)  his Appendix provides guidance in the form of (1) a list of documents for further reference and  (2) background information on the last revisions of MIL-T-9047 and MIL-T-9046, for historical  reference with respect to the source of present day non-Government standards related to Ti  alloys.           Titanium Alloy, Bars, Wire, and Rings 5Al – 2.5Sn Annealed, 110  ksi (758 MPa) Yield Strength   Titanium Alloy Tubing, Seamless, Hydraulic 3.0Al – 2.5V Cold  Worked, Stress Relieved   Titanium Alloy Tubing, Seamless, Hydraulic 3.0Al – 2.5V,  Controlled Contractile Strain Ratio Cold Worked, Stress Relieved                                                   Titanium Alloy, Round Bar and Wire 3Al – 8V – 6Cr – 4Mo – 4Zr  Consumable Electrode Melted Solution Heat Treated and Cold  Drawn  Titanium Alloy Bars and Rods 3Al – 8V – 6Cr – 4Mo – 4Zr  Consumable Electrode Melted Solution Heat Treated and  Centerless Ground or Peeled and Polished   Titanium Alloy, Bars, Wire, Forgings, and Rings 6.0Al – 4.0V  Solution Heat Treated and Aged   Titanium Alloy, Bars, Wire, Forgings, and Rings 6.0Al – 4.0V  Annealed, Heat Treatable   Titanium Alloy Bars, Wire, Forgings, and Rings 6Al – 6V – 2Sn  Annealed   Titanium Alloy Bars, Wire, Forgings, and Rings 6Al – 6V – 2Sn  Solution and Precipitation Heat Treated    Titanium and Titanium Alloy, Sheet, Strip, and Plate (Cancelled;  superseded by SAE AMS4939A; SAE AMS4911M, SAE  AMS4918M, SAE AMS4940A, SAE AMS4915K, SAE  AMS4904B, SAE AMS4989B, SAE AMS4988A, SAE  AMS4907J, SAE AMS4990A, SAE AMS4917G, SAE  AMS4916K, SAE AMS4902J, SAE AMS4909H, ASTM B265,  SAE AMS4910N, SAE AMS4908G, SAE AMS4903B, SAE  AMS4919G, SAE AMS4900N, SAE AMS4901S)  Titanium and Titanium Alloy, Bars (Rolled or Forged) and  Reforging Stock, Aircraft Quality (Cancelled; Refer to: SAE  AMS4970H; superseded by: SAE AMS6901A, SAE AMS6931B,  SAE AMS6936A, SAE AMS6906A, SAE AMS6907A, SAE  AMS6920B, SAE AMS6926A, SAE AMS6921A, SAE  AMS6905A, SAE AMS6900A, SAE AMS6940A, SAE  AMS6932A, SAE AMS6910A, SAE AMS6935A, SAE  AMS6915A, SAE AMS6925A, SAE AMS4921M, SAE  AMS6930D)  Requirements for final product hydrogen content, maximum thickness, and cross-sectional area  for certification testing of material, coupon sample location, macrostructure and microstructure                                          confirmation, and ultrasonic inspection were specified. In addition, the heat number, lot number,  and size (thickness by width by length) of the product were required to be provided by the  distributor. This last revision had two following amendments:   reduced the maximum cross-sectional area for certification tested material from 309.68  cm2 (48 in2) to 103.23 cm2 (16 in2). This amended specification became inactive for new  design on April 4, 1998, and was only allowed for Ti and Ti alloy replacement purposes  for hardware designed/built before April 14, 1998.   MIL-T-9047, Notice 3, canceled this specification on February 10, 2005, and indicated  that future acquisition of these items should refer to SAE AMS-T-9047. SAE AMS-T-  9047 was a word-for-word translation of MIL-T-9047, containing only minor editorial  and format changes.    for final product hydrogen content, maximum thickness for certification testing of material,  coupon sample location, macrostructure and microstructure confirmation, and ultrasonic  inspection were specified. In addition, the heat number, lot number, and size (thickness by width  by length) of the product were required to be provided by the distributor. The maximum cross-  sectional area was not specified. This last revision had two amendments (Amendment 1 and  Amendment 2), which specified the controls of multiple melting processes of Ti alloys.                CHRONOLOGICAL HISTORY FOR NONCONFORMING TI ALLOY  GIDEPs                 1. All companies, with the exception of primary company, which had previously been  identified as having sold nonconforming material, were removed from the GIDEP  together with their corresponding GIDEPs.                   1. Titanium and titanium alloys supplied to DoD and NASA contracts must conform to all  contract requirements, including specifications cited in such contracts. When rolled plate  is specified, the titanium material must be rolled to the required thickness using industry  standard practices. When bar is specified, the titanium material must be hot worked to the  required dimensions. The required titanium material dimensions must not be  accomplished by cutting down a thicker material. Forged material must not be substituted  for rolled material requirements. Rolled material must not be substituted for forged  material requirements.   unacceptable product substitution under a government contract when the controlling  specification does not allow it.  . The superseding indictment referenced in the October 5, 2009, issuance of AAN-U-10-  005 was filed in the U.S. District Court, southern district of California, in criminal case  no. 08-cr4229-JLS. A second superseding indictment dated February 23, 2010, was also  filed in this case.         SCREENING OF TI ALLOY PARTS  FOR IN-PROCESS PROJECTS AT JPL    used, material distributor, heat number, mill source, mill product size, mill certification, lot  number, name of conversion house, certification of conversion processing, billet or starting  material size, final product size, final product condition, mechanical test report, nondestructive  testing certification, heat-treatment certification, and more.     Additionally, a method was developed to assess the risk of components with suspect or  incomplete certification paper. Ultimately, each Ti alloy component was reviewed by an M&P  Engineering specialist and assigned a category number, as described below:        he Ti part identification triggered a review of material certifications if a suspect source was  observed in the certification trail. Then, an emphasis was placed on obtaining a full certification  package for review by M&P Engineering.                             Suspect source material conditions that triggered a “suspect certification/suspect material rating”  were:    − Test methods used to generate data.  − What standards were used.  − Test laboratories/certifications.  − Mill certification/source.  − Heat treatment/thermal processing information.  − Properties indicate on certificate that they do not meet specification requirements.  however, the certificate should contain information to determine if material was bar or  billet.   − Mill-only certified ingot chemistry was provided with final product.  − Lacks conclusive evidence of adequate hot working.     specification requirements were satisfied; however, supplied material was cut from  billet that exceeded allowable cross-sectional area of 309.68 cm2 (48 in2).                                  Justification: Producing Ti alloy plate, sheet, or strip material in thicknesses less than  or equal to 4.8 mm (0.188 in) for multi-square feet of product via machining billet  stock material is considered more challenging (potato chip effect) and costly and,  therefore, highly unlikely to be used by suppliers, than typically used sheet  production techniques, i.e., rolling operations, used in industry.    − Producing Ti alloy wire form in diameters less than or equal to 7.9 mm (0.312 in)  in any reasonable lengths (multi-meters) via machining of Ti alloy billet stock  material is considered more challenging and costly, hence, highly unlikely to have  been used by suppliers, than typically used wire drawing operations used in  industry.   material to be thermo-mechanically processed, i.e., drawn through smaller and  smaller dies, interspersed with annealing operations, to create required wire gage  (diameter) product form.   procurement specifications, e.g., NAS 4004, Fastener, 6AL-4V Titanium Alloy,  Externally Threaded, 160 ksi Ftu, 95 ksi Fsu, 450 °F, for inch fasteners and NAS  NA0007, Procurement Specification Metric Fasteners, Titanium Alloy, Externally  Threaded, 1100 MPa Tensile, 660 MPa Shear, for metric fasteners, via machining  Ti alloy billet material are considered too high to be credible. Fasteners are made  with highly specific fastener head upset forge operations, and threads are roll  − Suppliers making Ti alloy fasteners are required to provide mechanical property  testing reports at the fastener level. This practice provides a standard measure of  quality on which JPL has relied for years.                        forged. No difficulties have been observed with JPL’s fastener procurement  process.      • Casting parts.  • Extruded parts.  • Die (open or closed) forging producing final parts.                      in) certified to SAE AMS4928R. Deficiencies related to SAE AMS4928R requirements  included:     . The independent mechanical test laboratory certification contained within the  material certification package did not provide a lot number as required by both SAE AMS4928R  and MIL-T-9047G.    H-81200B, Heat Treatment of Titanium and Titanium Alloys, which was referenced by the heat-  treating contractor.                      one-page certification package was provided. Company B certified the Ti-6Al-4V material to  meet specification ASTM B348 Grade 5. The 1.9 cm x 15.2 cm x 21.6 cm (0.75 in x 6 in x 8.5  in) plate was cut from 15.5 cm (6.1 in) x random/width x random/length material. Deficiencies  with respect to this certification package included:     . The following information was not provided in the material certification package:  ingot certification, heat number, conversion processing certifications from ingot-to-billet and  billet-to-final product, thickness, cross-sectional area, and test coupon location pertaining to  mechanical testing and final product hydrogen content certification.   tested failed to meet the minimum percent reduction in cross-sectional area required by ASTM  B348-10.      length) along with copies of certifications from the mill that cast the ingot and from the  independent test laboratories performing certification tests of the alloy. The independent test  laboratories certified the material to meet requirements in accordance with MIL-T-9047G, SAE  AMS4928R, and ASTM B348-10. Company B added the following statement on the cover page  of the material certification package: “We hereby certify that these are correct copies of reports  now on file at Company B.” In accordance with reasonable industry standard practice, it was  assumed that this statement by Company B, as distributor, certified the material to the  specifications listed in the independent test laboratories and ingot material certifications.                    H-81200B or SAE AMS-H-81200C, Heat Treatment of Titanium and Titanium Alloys, specified  in MIL-T-9047G.          EXAMPLE OF AN ACCEPTABLE (“CLEAN”) CERTIFICATION  PACKAGE  Certification Package. This example is one of the better Certification Packages, but even it does  not include the reference to the tensile test specification used. The names and addresses of  subcontractor, distributor, and mill and JPL purchase order numbers, job numbers, and part  numbers have been intentionally removed.                                                                      materials does the company  sell?   What sizes of bar and plate  does the company sell?   Does the company sell  material in billet or ingot  form?  Review listing of all material being manufactured  by the supplier. Verify if it includes Ti alloy.  Verify the size of bar and plate material being sold  by the supplier. Review several purchase orders,  and check if the shipping records match customer  orders.  Seek evidence regarding the form in which  material is being sold. Is it sold as ingot or billet?  1.4 What lot sizes are  produced?  Review several manufacturing travellers to verify  how lot sizes are produced.   How does the company  classify bar versus plate?  Verify how the supplier classifies bar versus plate  and how the distinction is being made during the  manufacturing process.    Review specifications being utilized and several  dimensional test records to ensure plates are not  greater than 10.2 cm (4 in) thick.   sizes greater than allowed  by SAE AMS-T-9047? Are  any plates greater than 10.2  cm (4 in) thick?    Has the company ever sold  cut intermediate product as  bar or plate?  Assess several travellers and shipping documents.  Verify if the supplier has ever sold cut intermediate  product as bar or plate.  ote: Answer should be no. If the answer is yes, it  should be something the company did in the past.    Interview quality management and ask if there has  been any substitution of bar for plate.                                                               Request and verify criteria for qualifying suppliers.  Review list of suppliers being procured from and  cross check to verify they exist in the ASL.  Review supplier rating criteria. Is rating based on  quality (acceptable parts received, on time  deliver…?) Select sample of lowest rating  suppliers, and verify how issues are being  addressed. What constitutes a withheld status?  Review several purchase orders to verify type of  requirements flowed down to suppliers. Interview  the person performing this function to assess  whether he/she is qualified.  Verify whether customer conversion requirements  have been met. Review customer communication  documentation for several customers.  ote: Conversion requirements should be  consistent with end product requirements.  Review several sub-tier supplier folders, and verify  that documentation received with product, e.g.,  Certificate of Conformance (C of C), test records  certification, material condition, etc., is in  accordance with specification.  Seek evidence of whether supplier maintains  complete traceability records specifying material  condition and properties.  Select sample of receiving inspection records to  assess whether material has been purchased from  Western Titanium, Inc. Verify how the company  assures that JPL does not receive that material.      2.2 How does the company  measure performance of  suppliers and address  issues?  2.3 How does the company  flow requirements  (material, processing and  testing) to suppliers, and  who is qualified to do this?  2.4 How is it determined what  conversion methods should  take place, and who is  qualified to determine this?  2.5 What documentation and  certifications are required  from suppliers of material  and/or processes?  2.6 Does the company buy  from third parties rather  than going direct to a mill?  If yes, how does the  company maintain  traceability?    3.1 How does the company  assure that the material  procured meets  specification requirements?  Interview receiving and in-process inspection  personnel, and verify records of testing performed  on material received. Also, verify if testing is  performed according to specification.  Review inspection records generated throughout  the manufacturing process to verify that  dimensional tolerance is measured and kept within  limits.    measure and maintain  dimensional tolerance in its  products? How is  dimensional tolerance  measured?    Interview personnel performing dimensional  verification. Verify that training records show  evidence that personnel have received adequate  training.  minimum, on-the-job training (OJT) for  understanding material processing, testing, and  verification to specification.    3.3 How are personnel who  perform material  verification trained?                                                         3.4 How is acceptance  documented?   process for dispositioning  nonconforming material?  3.6 How much billet material is  rejected by QA? How much  bar/plate?   material and/or scrap  segregated?     If the company sends  material out for testing, is  the testing house a Nadcap-  or ISO-approved  laboratory? If not, how are  the laboratories approved?  Request to see material inspection areas (receiving  inspection, in-process inspection, etc.), and verify  that material acceptance records include stamp or  signature with date.  Seek evidence on action taken on rejected material.  Is it documented as nonconforming, tagged, and  segregated to ensure that it is not mixed with  conforming material?  Select sample of inspection records to verify the  amount of billet, bar/plate material rejected by QA.  Request to see area where noncomforming material  is kept. Assess whether it is suitable to ensure bad  material is not mixed with conforming material. Is  scrapped material permanently marked to identify  that it is scrapped?  Identify several testing houses listed in the ASL,  and verify whether those are Nadcap or ISO  certified. If they are not, ask how they are  approved.    Verify that test samples are taken in accordance  with specification and/or procedure.  4.3 What is the test sampling  plan for large lots of  material?  Review test procedures and/or test documentation  to verify sampling plan used for large lots. Do the  sampling plan and acceptance level meet  specification requirements?      Verify process for marking of billet/finished  products and location of marking on the part.   distinguished from  bar/plate?   included in the marking?  (specification, producers  name, lot/heat number,  composition, heat treat,  finish)  Seek evidence on how billets are distinguished  from bar/plate. Verify how they are labeled to  avoid mixing with other material.  Review procedure and marking information. Select  several products to verify marking information is  done in accordance with procedure or  specification.    Select several products, and verify marking is  painted or stamped on per procedure.     maintained from purchase  through stocking to sale?   protected from degradation,  contamination, and  corrosion?  Select several part numbers of completed products,  and verify that numbers are traceable to incoming  inspection records and throughout manufacturing.  Review supplier’s Storage, Handling, and  Preservation procedure, and verify controls are  being followed to protect material.                                                                         7.3 How is finished product  segregated from  intermediate product during  cutting?  Request to see the cutting procedure, and seek  evidence on the type of equipment used to cut  material. Cutting may cause a heat-affected zone  when using a saw. Check if the materials are  cooled during the cutting process.  Seek evidence on point during material processing  at which material is cut, including type: billet, bar,  or plate? Is this done in accordance with  specification and procedure?  Select several travellers or manufacturing  documentation to verify how finished product is  segregated from other product?    Is bar or plate ever cut on  the thickness? Width?  Review cutting procedure, and verify how bar or  plate is cut, whether through thickness or width?   Is billet ever cut on the  thickness? Width?  Assess manufacturing practices, and check if billet  is ever cut on the thickness or width.  Review the material control procedure and/or stock  procedure. Seek evidence on how traceability is  achieved.   Verify on several travellers how cutting is  annotated. Are there specific instructions related to  material cutting?  7.6 How does the company  maintain traceability for  your stock? Does the  company track traceability  by weight?   on the manufacturing  paperwork?  7.8 How is cutting annotated  on the certification?  Select several certifications, and verify how cutting  is annotated.   after cutting to maintain  traceability?  Review several travellers to verify if remarking of  material after cutting is performed. Is it being done  in accordance with procedure? Permanent marking  methods such as stamping or scribing are  recommended over paint or adhesive labels.     provide certifications and  test reports with complete  traceability from mill  through finished product  delivery?  Verify several final delivery packages. Is all  relevant paper work included to ensure entire  traceability of material?  Can auditor trace work  documents back to specific  lots of material?  Take a sample of finished products, and verify  whether documentation allows traceability to lots  of material.  Select several certification packages, and assess  whether final hot-worked size is included.   On final delivery packages, verify that heat-  treatment condition is included. Is this step also in  the procedure?  Is final hot-worked size  shown on all certification  packages?  Is heat-treatment condition  shown?                                                                              While reviewing certification packages, verify that  heat and lot numbers are included.   Is size ordered shown on  the certification package,  and does it match size of  hot-worked product? Is  thickness the same?  Verify in certification packages that size ordered  and hot-worked product size match. Also, verify  the thickness. Sometimes the pieces are identified  by their weights instead of lengths. The dimensions  can be verified from the weight.  Ensure certification packages selected also  reference appropriate test/inspection specifications.  From reviewing certification packages, verify that  all of the information listed to the left is included.  Are these characteristics also called out in the  certification package procedure?   specifications and revisions  to which the material has  been tested/inspected  shown on certification  package?   packages include  specification number,  composition, heat-treat  condition, finish, melting  practice, tensile properties,  ultrasonic testing (UT)  results, microstructures,  reforging stock  identification, and sampling  for quality conformance,  identification of UT’d  products and packing level?     While reviewing certification packages, verify that  conversion certifications and/or C of C is included.  Verify that nondestructive testing certifications  and/or C of Cs are included.  Show supplier copy of QC-06B. Make sure  supplier can meet the requirements.   certifications and/or C of  Cs included in the package?   testing certifications and/or  C of Cs included in the  package?   any problem meeting JPL’s  quality clause entitled  “Raw Material  Traceability” (QC06B)?    9.1 What are the typical  rolling/forging  temperatures?     typically completed in final  finishing? What is the  minimum required  reduction?  Ask if supplier performs rolling/forging. Verify at  what temperatures this process is being performed.  Determine if the working temperatures are stated  on the traveller or as a part of a standard procedure.  Review rolling/forging procedure or specification  used to verify how many reheats are allowed and  whether the company complies with this number.  Verify the amount of reduction at final finish and  what would be the minimum. Traveller should  show this information.                                                                 Review the company’s processes to assess how  rolling and forging are controlled. Are they being  done in accordance with the specification and/or  procedure?  During process verification, check how  temperature is monitored on a sample of work  pieces.   compliant with SAE  AMS2750, Pyrometry?  Review procedure to verify above procedure is  invoked and if it is being followed and complied  with in regard to conversion of furnaces.    9.8 What is the distance of the  furnace to the press/mill?        determine where to place  material in furnace?  Document the type of furnaces being used. Verify  furnaces’ capabilities to ensure they meet  requirements delineated in the specification.  Verify the distance from the furnace to the  press/mill. Does it meet what is called out on the  specification and procedure? Is there a minimum  temperature that must be kept?  Request temperature information on dies/rollers. Is  heating being done? If dies/rollers are not heated,  is insulating material used to prevent direct surface  contact between the dies/rolls and the material?  Review specification and/or procedure to check if  cold finishing is allowed. If so, does it comply with  the specification?  Rolling/forging certifications should be identified  in the procedure. Is procedure in compliance with  specification?  Verify that specification and procedure identify  location within the oven where material must be  placed. Witness the process being done, and verify  travellers indicate the location as well and are  complied with.    Identify whether heat treat is done in house. If so,  review the procedure. Verify how material is being  handled: by customer, part number, lot number,  etc.  Request a copy of the heat-treat specification being  used. Was it flowed down as a requirement?  Verify that specification or procedure identifies  how soak time is calculated and whether it is  calculated in accordance with specification.   Verify if temperature is controlled in accordance  with specification or customer-specific  requirements. Make note of the number of  thermocouples that are used during heat treat.   performed, does the  company mix JPL material  with other customers’  materials?   specification(s) does the  company use?    10.4 How do you control the  temperature, i.e.,  thermocouples?   thermocouple placement  for suppliers or allow them  to do it?  If heat treat is outsourced, is thermocouple  placement requirement flowed down to suppliers?  Select sample of suppliers, and review several  purchase orders for this requirement.                                                                                assure that its oven is  suitable for the  specification?  10.7 Does the company make a  practice of overloading the  furnace?    Identify the oven type and its capability. Can it  meet heating specification requirements?  Review heat-treat specification. Does it have a  requirement for maximum number of parts that can  be placed in the oven at one time? Is this complied  with?  Verify several documents on parts that have gone  through heat treat. Is there a map included,  indicating where parts were placed within the oven  during heat treating?   Is your heat-treat facility  Nadcap approved?  If heat-treat process is Nadcap approved, request to  see the certification.  10.10 Who does the flattening of  warped material? Is it done  hot or cold?  Identify within the specification and/or procedure  whether flattening is performed and at what  temperature.  Witness the quenching process. Is it being  performed in accordance with  specification/procedure and at specified  temperatures? Make note of the proximity of the  furnace to the quench tank. Some specifications  may have a requirement on the maximum time the  part can be out of the furnace before it is quenched.  Verify if temperature is maintained during  quenching in accordance with specification. Is the  quenching medium recalculated? Are there  instruments used to monitor quench temperature?  Seek evidence whether heat-treat temperature is  based on the beta transus.   10.11 For solution treating, how  does the company quench  the material?   maintain the temperature  during quench?   heat-treat temperature on  the beta transus?                                                EXAMPLE QUALITY CLAUSE ENTITLED  “RAW MATERIAL TRACEABILITY”      All certifications and test reports required below shall be traceable through some method of  identification, i.e., heat, lot, part, and serial numbers; purchase order; invoice number; etc., from  mill through finished product delivery.    The contractor shall include with each shipment the raw material manufacturer's test report, i.e.,  mill test report, that states that the lot of material furnished has been tested, inspected, and found  to be in compliance with the applicable material specifications. The test specimen shall come  from the same thickness/diameter that is being supplied. The test report shall contain the  following information:       • When the material specification requires quantitative limits for chemical, mechanical,  or physical properties, the test report shall contain the actual individual test and/or  inspection values obtained, not summarized values.”    forming, heat treating, thermal cycling, conversion, etc., has occurred and that the  results meet all specification and testing requirements.                             If the material was altered (forged, rolled, heat treated, etc.) subsequent to  procurement from the mill and before delivery to the place of use, an independent  laboratory test shall be submitted with the material. The testing shall be performed  after all subsequent conversion processing. The test report shall comply with  requirements above for manufacturer test certifications. The independent testing  laboratory shall be Nadcap or ISO certified.  Note: To periodically assess the credibility of independent testing laboratories and the  organizations on the ASL, random procurement organization facilitated mechanical  testing is recommended. The frequency of such testing can be reduced as confidence  is gained in test results provided by the metal supplier and its independent testing  company.”      • Questionable practices by changing letterhead and altering original documents by  suppliers, such as copying of material test Reports with the company’s letterhead  pasted over the existing letterhead, shall be prohibited.”                             (Lot C in table 4), based on independent test laboratory results in material certification versus  additional JPL in-house test data. For more information, see section 6.4.5 in this NASA  Technical Handbook.   igure 3, Tensile Yield Strength Results Comparing Independent Test Laboratory Values of  876 MPa (127 ksi) and 889 MPa (129 ksi) (illustrated by two upper blue lines) with JPL Internal  Test Results Shown by Bars on Graph; figure 4, Ultimate Tensile Strength Results Comparing  Independent Test Laboratory Values of 945 MPa (137 ksi) and 952 MPa (138 ksi) (illustrated by  two upper blue lines) with JPL Internal Test Results Shown by Bars on Graph; figure 5,  Elongation Results Comparing Independent Test Laboratory Values of 14 percent and 13 percent  (illustrated by two upper blue lines) with JPL Internal Test Results Shown by Bars on Graph; and  figure 6, Reduction of Area Results Comparing Independent Test Laboratory Values of 31  percent and 19 percent (illustrated by upper and lower blue lines) with JPL Internal Test Results  Shown by Bars on Graph, provide these mechanical test result comparisons.    The JPL internal tensile test results summary of suspected nonconforming Ti-6Al-4V is shown in  table 4, Lot C, section 5.3.3 in this NASA Technical Handbook.                   Figure 3—Tensile Yield Strength Results Comparing Independent Test Laboratory Values  of 876 MPa (127 ksi) and 889 MPa (129 ksi) (illustrated by two upper blue lines) with JPL  Internal Test Results Shown by Bars on Graph                                                   Figure 4—Ultimate Tensile Strength Results Comparing Independent Test Laboratory  Values of 945 MPa (137 ksi) and 952 MPa (138 ksi) (illustrated by two upper blue lines)  with JPL Internal Test Results Shown by Bars on Graph                                                     Figure 5—Elongation Results Comparing Independent Test Laboratory Values of 14  percent and 13 percent (illustrated by two upper blue lines) with JPL Internal Test Results  Shown by Bars on Graph                                                           Figure 6—Reduction of Area Results Comparing Independent Test Laboratory Values of  31 percent and 19 percent (illustrated by upper and lower blue lines) with JPL Internal  Test Results Shown by Bars on Graph        "}